var relearn_search_index = [
  {
    "breadcrumb": "王梅四郎maloudown",
    "content": " 1.文章 Git常遇问题 如何用旧电脑搭建自己的服务器？ 创建hugo静态网站的经历 网站内常用到的模版 网站的目录与子目录创建 2.AndroidStudio AndroidStudio AndroidStudio笔记 2-1.Toolbar工具栏 3.STM32_RFID 4.Esp8266_WiFi 物联网通信技术-小知识 5.CC2530_ZigBee 实验2 IO端口输出实验 6.Arduino 物联网控制-小知识 7.物联网工程 8.51单片机 pretues+kiel5仿真软件配合使用时需要注意的地方 9.操作系统 Linux期末复习 10.微信小程序 基础知识 11.哲学 庄子之道 费尔巴哈提纲 12.实战项目 贺青工程 志愿活动软件设计与开发 验收问题 唛盟杯比赛详记 13.计算机组成原理 过年 计算机组成原理-复习 常用的数学表达\n常用箭头\n",
    "description": "",
    "tags": null,
    "title": "一、博客文章",
    "uri": "/branch-bundle-1/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": " Git常遇问题1、使用git commi -m “……“时报错： Your branch is up to date with ‘origin/master‘ 今天在提交项目的时候报了这个错误，在网\n如何用旧电脑搭建自己的服务器？拥有一个属于自己的服务器个人感觉就很赞，我最初是在不买公网IP情况下，用一台电脑做服务器，然后另外一台电脑可以远程访问，部署网站，然后别人可\n创建hugo静态网站的经历附件 一、为什么要创建属于自己博客网站 自从进入大三的学习，自己接触了许多开发板、以及七七八八的软件，个人记忆力又不咋地，平时很容易把重要或者重\n网站内常用到的模版代码分制表 以\u003c tabs title=\"file name\" \u003e，\u003c /tabs \u003e结尾； 然后里面写以% tab title=\"code name\" style=\"info\" color=\"blue \" %，% /tab %结尾 他们都需要用{{}}括起来 ​ 代码 {{\u003c tabs title=\"hello.\" \u003e}}\n网站的目录与子目录创建不论是创建首页页面，还是左边框的选项，归根结底它们都是“目录”，从根上说，你需要创建一个目录然后在目录里面创建一个.md文件来装这个目录或说\n",
    "description": "",
    "tags": null,
    "title": "1.文章",
    "uri": "/branch-bundle-1/%E5%85%B6%E4%BB%96%E6%96%87%E7%AB%A0/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 12.实战项目",
    "content": " 志愿活动软件设计与开发设计一款可以参加志愿活动的小程序，其制作流程大致如下： 需求分析与规划 确定目标用户群体及其需求：考虑志愿者、活动组织者和管理员等不同角色的功能\n验收问题页面美化验收 1.登录页面 2.首页—将志愿活动和活动时长数据放到轮播图下面 3.我的页面优化了吗？ 4.点击找回密码后，页面颜色不够美\n",
    "description": "",
    "tags": null,
    "title": "贺青工程",
    "uri": "/branch-bundle-1/12.%E5%AE%9E%E6%88%98%E9%A1%B9%E7%9B%AE/%E8%B4%BA%E9%9D%92%E5%B7%A5%E7%A8%8B/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 13.计算机组成原理",
    "content": " ",
    "description": "",
    "tags": null,
    "title": "过年",
    "uri": "/branch-bundle-1/1.%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BB%84%E6%88%90%E5%8E%9F%E7%90%86/%E8%BF%87%E5%B9%B4/"
  },
  {
    "breadcrumb": "王梅四郎maloudown",
    "content": " 草屋夫妇胡冲村被一条蜿蜒的河道所包围，河道流向东边与其他支流汇聚在不远的东侧，人们把那里叫作三岔口，三岔口往西沿着泥巴公路走上几十分钟就到了胡冲村，\n人物关系木尸王朝 1.文中的人类变成树木的原因是什么？ 与金钱绑定的一种木材，注定了她会给人类带来财富，当我可以使用金钱来奴役别人时，金钱不再是一般等价\n君绘语第一章 与君初相识 高中那会儿我老失眠，原因一言难尽。 记得有一次我去吃饭，遇到张君，我们聊闲聊中，谈到了我失眠的事，张君听了说，他们有个朋友以睡\n白唐战绛“时间的真的存在吗？” 我很意外王妈为什么会问我这样的问题，王妈小时候家境不好，没有机会上学，她对我说过，去学校上学的次数十个手指都数得过来。\n阿牛和阿花的爱情故事牛村与花村仅隔一片红树林，深秋里，满山的红叶铺天盖地，牛村的村尾是个好地方，常聚着城里来的人，就是离阿牛家远了些。 “嘿！ 阿牛。你要老婆不……\n时空国度-木尸王朝第一章 序 火车站往东沿着才华路步行十分钟便到衡岭财经学院，这条路王肖一年会走五六次——多的是回家或回校，他的理想大学是南国大学，虽与之擦肩而过\n",
    "description": "",
    "tags": null,
    "title": "二、小  说",
    "uri": "/textbook/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": " AndroidStudioAndroidStudio简介 1.配置Android开发环境： 安装JDK： （1）下载JDK （2）配置环境变量； 安装Android Studio\nAndroidStudio笔记第一章 配置开发环境： 1.安装JDK “安装连接” 2.安装AndroidStudio “安装连接”\n2-1.Toolbar工具栏Toolbar是什么？ 简单理解就是页面的上的菜单栏，或者叫工具栏，在AndroidStudio的页面布局中使用Toolbar， menu文件的\n",
    "description": "",
    "tags": null,
    "title": "2.AndroidStudio",
    "uri": "/branch-bundle-1/2.androidstudio/"
  },
  {
    "breadcrumb": "王梅四郎maloudown",
    "content": "",
    "description": "",
    "tags": null,
    "title": "三、关于",
    "uri": "/about_create_web/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": "Lorem Ipsum.\n",
    "description": "",
    "tags": null,
    "title": "3.STM32_RFID",
    "uri": "/branch-bundle-1/3.stm32_rfid/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": " 物联网通信技术-小知识通信串口 参照上一节课 物联网是新一代信息技术领域的重要组成部分。其英文名称是“The Internet of things”，顾名思义，“物联网就是物物相连的互联网\n",
    "description": "",
    "tags": null,
    "title": "4.Esp8266_WiFi",
    "uri": "/branch-bundle-1/4.esp8266_wifi/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": " 实验2 IO端口输出实验实验2 IO端口输出实验 1、实验要求： 利用实验箱的基础板，实现八盏灯的点亮，下面是八盏灯的位置图： 在实际中我们可能没有实验箱，往往需要自己做一\n",
    "description": "",
    "tags": null,
    "title": "5.CC2530_ZigBee",
    "uri": "/branch-bundle-1/5.cc2530_zigbee/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": " 物联网控制-小知识物联网的特点 物联网是互联网的拓展和延伸，物联网设备通常为带传感器的电子硬件，并与网络相连接。 物联网的应用层是核心。 物联网的作用 全面感知：全面\n",
    "description": "",
    "tags": null,
    "title": "6.Arduino",
    "uri": "/branch-bundle-1/6.arduino/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": " ",
    "description": "",
    "tags": null,
    "title": "7.物联网工程",
    "uri": "/branch-bundle-1/7.%E7%89%A9%E8%81%94%E7%BD%91%E5%B7%A5%E7%A8%8B/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": " pretues+kiel5仿真软件配合使用时需要注意的地方不知道keil5从哪个版本开始就不支持了晶振的设置操作，我在网上搜也得到不同的答案，所以从哪个版本开始限制这就不提了， 好在这样的改变并不会形\n",
    "description": "",
    "tags": null,
    "title": "8.51单片机",
    "uri": "/branch-bundle-1/8.51%E5%8D%95%E7%89%87%E6%9C%BA/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": " Linux期末复习认识Linux 安装Linux 图形界面与命令行 文件管理与常用命令 文件/目录的打包和压缩 gzip压缩文件和gunzip、zcat压缩文件命令 一般\n",
    "description": "",
    "tags": null,
    "title": "9.操作系统",
    "uri": "/branch-bundle-1/9.%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": " 基础知识附件\n",
    "description": "",
    "tags": null,
    "title": "10.微信小程序",
    "uri": "/branch-bundle-1/10.%E5%BE%AE%E4%BF%A1%E5%B0%8F%E7%A8%8B%E5%BA%8F/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": " 庄子之道今天通过王德峰老师的视频课来进一步的了解《庄子》的哲学之道，推荐看曹楚基注释的《庄子》。 行无为而知避害，避害就是避开人为，像自然灾害不在道家\n费尔巴哈提纲一 从前的一切唯物主义（包括费尔巴哈的唯物主义）的主要缺点是：对对象、现实、感性，只是从客体的或者直观的形式去理解，而不是把它们当作感性的人的\n在我个人看来中国的哲学重在修心，探讨入世出世，为人处世的哲学问题，而相比于西方的哲学，我觉得中国的哲学更贴近与生活，人的内心变化影响着人的生活，西方哲学注重探讨自然界的规律。所以我有时也很能理解为什么科技革命发生在西方，而不是我们中国，西方哲学下的社会似乎总能带来一些新东西，有时候会让你感觉到它带来了不属于这个世界的新事物，最典型的就是科技的发展带来的一些新事物。但这样的看法看待中国哲学和西方哲学还是太片面了，在哲学的大集合里，哲学主要还是为人服务的“ 工具 ”，哪个顺手我就用哪一个，哪个能帮我与事物更好的打交道，我就用哪个。\n学哲学是为了了解自己，看透世界，这就是当下我觉得学哲学的意义。\n学中国的哲学不是为了出家，不是为了攀登看破红尘的高山。如果你不是很富有，家境也不怎么样，我劝你打消这个念头，父母辛苦把你养大，你跑去山里去修道？国家现在还没有富起来，你不投身于社会为祖国做贡献，幻想着修自己心中所谓的道？你能安心吗？我想学完中国哲学的人不应该是有这样的想法，而是有与社会权力打交道的巧招妙招，有为家为国做贡献的决心，有好好活下去的勇气。\n",
    "description": "",
    "tags": null,
    "title": "11.哲学",
    "uri": "/branch-bundle-1/11.%E5%93%B2%E5%AD%A6/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": " 贺青工程志愿活动软件设计与开发设计一款可以参加志愿活动的小程序，其制作流程大致如下： 需求分析与规划 确定目标用户群体及其需求：考虑志愿者、活动组织者和\n唛盟杯比赛详记比赛说明 自己有幸参加这次唛盟杯的比赛，这次比赛流程如下： 一、报名时2024年1月1到31日本来是12月份但延期了。 二、培训时间，现在还不确定\n",
    "description": "",
    "tags": null,
    "title": "12.实战项目",
    "uri": "/branch-bundle-1/12.%E5%AE%9E%E6%88%98%E9%A1%B9%E7%9B%AE/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章",
    "content": " 过年\n计算机组成原理-复习1 计算机系统概论 计算机的分类 计算机总体上分为：电子模拟计算机1和电子数字计算机。二者区别如下表 比较内容 电子数字计算机 电子模拟计算机 数据表示方\n",
    "description": "",
    "tags": null,
    "title": "13.计算机组成原理",
    "uri": "/branch-bundle-1/1.%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BB%84%E6%88%90%E5%8E%9F%E7%90%86/"
  },
  {
    "breadcrumb": "王梅四郎maloudown",
    "content": "",
    "description": "",
    "tags": null,
    "title": "Categories",
    "uri": "/categories/"
  },
  {
    "breadcrumb": "王梅四郎maloudown",
    "content": "",
    "description": "",
    "tags": null,
    "title": "Tags",
    "uri": "/tags/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: X1-小说",
    "uri": "/categories/x1-%E5%B0%8F%E8%AF%B4/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 二、小 说",
    "content": " 胡冲村被一条蜿蜒的河道所包围，河道流向东边与其他支流汇聚在不远的东侧，人们把那里叫作三岔口，三岔口往西沿着泥巴公路走上几十分钟就到了胡冲村，在村口有一片灰白色的石斜坡，斜坡直至的扑到山顶上， 好像一块灰白色的布披在了山的一边，从斜坡上直直的延伸下一条绳索，绳索紧紧的拴住斜坡与江河，在江河的另一端也有同样的绳索，在这条路上这样的绳索很多，当绳索拉起，一张绿色的渔网就会浮出水面，将鱼儿团团困住。\r再往里走两侧会看到一些废旧的木瓦房，木瓦房历经风雨起立不到，只是废弃后的木瓦房多了些许苍凉，木瓦房往前是一排排建在公路旁的洋房，前面有一条T字形的路口，往左转可以看到一面五星红旗，前面的小学建在山脊靠江的地方，由于地势的原因，这地方很像一个半岛的形状，学校除了校门口有高强和杉木围栏外其他地方都没有围起来，似乎江河就是最好的围栏。\n弥嘟在很小的时候就在这所学校，那时候他和他姐姐一起住在宿舍里，平日不是在宿舍等姐姐下课，就是在学校里玩等姐姐下课，有一次姐姐担心他乱跑就把弥嘟锁在了宿舍里，这天宿舍来了一位身穿黑色衣服的夫妇，他们在校长的带领下视察了宿舍，这天视察他们发现了弥嘟被锁在了宿舍里面，众人都疑惑一个男孩子怎么被锁在了女生宿舍里，后面询问宿管阿姨才知道是弥嘟的姐姐偷偷带了弟弟来上学，校长为此次事向黑衣夫妇表示歉意，黑衣夫妇说没关系后，黑衣女子半蹲下来试着要抚摸弥嘟，但弥嘟快速的跑到了被叫来的姐姐身后，黑衣女子看着不断吸着往外流鼻涕的弥嘟，她嘴角微微一笑，从包里面抽了几张纸，走上前递给了弥嘟姐姐，弥嘟被姐姐拉到一旁，洗了把鼻涕，姐姐一边擦拭着弥嘟，一边看着远去的两位怪人，而在弥嘟眼里他们是令他好奇的生物！\n两夫妇走后不久，在学校的河对岸的山林里就建起了一座草房子，房子四面围墙由杉木围成，房子四周种着高达的杉木，每每起雾路人转角就能立马看到远处的木屋，木屋不是由当地的人建起来的，正是由之前到胡冲村的两位黑衣夫妇建起来的，他们那天到学校是想买下那所学校，但是后面没有与当地政府谈拢，后来又跑到山里买了一块地建了一座草房子，草房子旁边原来有个放黑山羊的老人，老人来自胡冲村，人们都叫他卜勇娃，村里人都觉得他是个怪人，有的人也说他患上了精神病，如果你在村里你就能时常看到他穿着衣衫褴褛的衣服在街上，边走边自言自语，有时候还偷偷的对着路人露出奇怪的笑容，他若是在家你偶尔还能在半夜听到他破口大骂的声音……正因为这些很多人讨厌他，至于他的名字有很多人都遗忘了，或许是他的第一个孩子叫勇娃吧，在胡冲村这一带人们往往以第一个孩子的名来称呼对方的父母，有时候会在姓的中间加上一个卜字。\n卜勇娃的妻子和孩子商量后决定让他到山里放羊，于是卜勇娃来到了胡冲村江河源头上的木巴放了羊，木巴这个地方除了一片片的杉木，还有满山的梧桐树，每每到梧桐花盛开的季节，满山的梧桐花，白的，粉红的飘满一座座山，花朵铺满前往黑衣夫妇的草房子，远远看着也是一道靓丽的风景。\n两位夫妇来到木巴的第一天就去访问了卜勇娃，但卜勇娃并不理会她俩，而是继续赶着自己的山羊到山里，过了三四年黑衣夫妇始终很难与这位奇怪的中年男人搭上话。\n又到了山石榴成熟的季节，在黑衣夫妇草屋旁就生有山石榴树，每到星期五放学孩子们回家路过总要下来摘山石榴，这一天弥嘟姐姐让另外两个弟弟去打水，她去摘山石榴，其他家的孩子也是打水的打水，摘山石榴的摘山石榴，吩咐好后他们就各自往木巴山下走，留下几个低年级的孩子，就在这时弥嘟闹肚子，跑到同龄的旁边说了声，我肚子疼。同龄的孩子指着学校的方向说，往那个地方下去，那里有树挡着去哪里拉吧。\n弥嘟沿着路往下走，走着走着肚子不疼了，反倒眼前的草屋吸引住了他，他不知不觉走到了草屋旁边，突然左侧出现了一个穿白色衣服的女子，柔长的黑色细发，直直的披在那位女子的两肩，女子穿着穿着荷花色的上服和雪白的长裙，这时候的弥嘟哪里知道这很像电视里的女鬼形象，他往前走了几步，接着呆呆的站在原地看着出现的白衣女子，女子梳着自己的细发。时间似乎过了很久，这时女子才注意到了弥嘟，朝他看了看，嘴角微微一笑，白皙的脸颊撑起端正的五官，那双眼灵动迷人，似乎她的面容就是为了吸引男子而生的，但弥嘟并不知道眼前世俗所谓的美女，在他眼里女子面容苍白，好似快死去的人，看着纤细的身段也不过是骨瘦如柴，女子的笑容似乎勾起了弥嘟的回忆，他在哪里见过这位女子。\n小弟弟你哪里来啊？女子问道，弥嘟还是站在原地沉默不语，女子朝他走了过来，从身后拿出了一本小册子，还有一根棒棒糖，别人东西不能乱拿，弥嘟还是知道的，弥嘟后退了几步，准备回去，不巧姐姐朝他走了过来，一把包住了他。“叫你在上面等你乱跑什么咯，真的是。”姐姐责骂道。“小妹妹你也别怪他哦，“白衣女子收起了手里的东西，弥嘟姐姐点了点头，便把弥嘟拽走了。\n“你们去哪了？”\n“去找弥嘟了！”\n“哦哦，回来了就走了吧，他们都上前走了。”\n“嗯嗯——弥嘟快点，还慢慢的嘛！”\n弥嘟姐姐与同村的收拾了书包，便快速离开了木巴，人多的时候还不觉着有什么好怕的，但这人少的时候，只有两个女孩子和一个男孩子，还是不由的害怕这个地方，毕竟这个地方有时候还传出奇怪的声音，弥嘟姐姐想想背凉了一半，一遍拽着弥嘟一边加快脚步。\n“也不用这么快的，你也慢点。”\n弥嘟姐姐笑了笑，转而说道：“你知道几年前来学校的两个黑衣服夫妇嘛？就是要把学校买走那两个。”\n“知道啊，后面不是学校不让卖，这件事就这么结束了吗。”\n“是啊，但是……你知道吗，我刚才去找弥嘟的时候在下面遇见了一个人的，长得很像几年前的那个来学校的，当时她还给我递纸巾呢！”\n“会不会看错了，人家怎么会来这里呢？”\n“我也希望不会来这。不过刚刚那个女人长得好年轻啊？还穿着一身白色衣服。”\n“啊？不会是有人死了吧？”\n“不是，就是普通的白色衣服，你也别这么说呀，还在路上呢。”\n同龄女孩呸呸呸几声后，又骂了自己嘴，本来还没什么，同龄女孩这么说后弥嘟姐姐更害怕，刚才背凉一半，现在凉透了——突然，前面传来几声怪异的尖叫，叫声一把吓到两个女孩双双尖叫了几声，相互往弥嘟身上包住，几个男孩子从路上的灌木丛跑了出来，原来他们在边走边玩躲猫猫的游戏，估计是负责找的孩子没找到这几个男孩子，这几个男孩子便在这等着吓弥嘟姐姐一行人了，同龄女孩子边走边责骂几个男孩子，差点把她两吓死。\n走着走着，弥嘟姐姐发现弥嘟嘴脸塞着糖，“哪来的糖？”姐姐问道。“我摸口袋在口袋里的。”弥嘟乖乖的回答道。弥嘟姐姐想想回家的时候似乎有买过糖，但好像没有棒棒糖，难道是别家的孩子给的吗？至此她也没多想。\n一天夜里卜勇娃从外面赶羊回家，太阳渐渐西斜，林子里也渐渐地变得昏暗，但是卜勇娃并不担心，因为他不记得也没关系，羊是识路的，就算羊不识路他也不慌，因为他从来没有因为迷路而慌乱过，在村里的时候，他有时候一个人半夜还走到几公里外的村寨，即使迷了路，他似乎也知道只要往前走就能回到自己原来出发的地方，走到家旁边的山沟里的时候，山沟下的小溪和蛙声勾起了他的兴趣，特别是小溪倒影着他家的炉火光，他知道家里又来人了，这已经不知道是第几次了，他把羊赶回羊圈里，深深吸了一口烟，走到屋里是自己的妻子和两个儿子，“回来就吃饭了，刚热的菜。”妻子说道。对妻子和两个儿子的到来他并不意外，因为这次一定又是有关那件——“吃饭了，收拾回去吧！”妻子的话打断了他的思索。\n“要回你们自己回。”卜勇娃说道。\n“小六死了，你个做哥的不回去怎么行。”妻子道出了这次的理由。\n“你们要回去自己回去。”他还是说同样的话。\n妻子说着说着自己倒是恼火了，原来只是劝他回去，接着说道，他是不是被旁边的婆娘给迷惑了，现在想在这里终年。以为这样的话会惹恼卜勇娃，没想到他还是冷冷的重复了刚才的话，他这样的态度反倒是让他妻子更气愤，两个儿子连忙拉住她，劝说让各自都让一步，老大也是无意的调侃道，他这样疯疯癫癫的别人也看不上。说出后老大知道自己说错了话，以为父亲会因此生气，而卜勇娃不但没生气，还慢悠悠的盛了饭一屁股坐下吃起了饭，突然又疯疯癫癫的自说自话。母子看到这样的状况只好作罢让他回家的念头。在前几天，张家的小六在床上死去，郎中来看的时候诧异小六的身体，因为小六不是生了什么重病而死，是应为阳衰过度而死的，听到这个结果他家里的人都怀疑郎中是不是误判了。\n小六是卜勇娃的弟弟，早年和卜勇娃上学不好好上学，整日想着赚钱，当时他的父亲是胡冲的大户，养他们六个孩子还是绰绰绰有余，只是后面父亲病逝，家庭渐渐没落，当时还读书的他两就想着赚钱，在三岔口建立他们的渔场后，便开始在各个县之间贩卖鱼，几年下来也赚了不少钱，后来卜勇娃用攒下来的钱继续上了学，那时候他已经20多岁，那时候大龄还在读初中也是正常的事情，只是当时他母亲很反对他这么做，母亲觉得既然卖鱼挣钱就应该趁热打铁，但是卜勇娃毅然决然继续去上初中，在初中他还用自己挣来的钱拜师学了功夫，后来因为没钱交学费，自己便止步于那几套三脚猫的功夫，虽然母亲明面上反对，但还是私下给他送了钱，直到初中毕业那年，母亲因劳累过世他不得不回家料理家事，考高中的事情也就此搁置。后来他娶了妻子，也和妻子有了孩子，一天下井被下落的石头砸中了脑袋，疯疯癫癫的病根就此落下病根。\n听到自己的弟弟去世卜勇娃不为所动，两个儿子对自己的父亲多少是失望的，失望自己的父亲连最基本的情亲都丢了，而他们的母亲却一心想着他是不是与旁边的白衣女子有一腿，而死活不愿回家。\n第二天早上，母子三人早早离开了木巴，临走时老大还帮卜勇娃赶山羊上了山，或许他觉得自己昨晚的话太过了，虽然父亲没有说什么，但自己心里还是过意不去。起来的卜勇娃看见自己的羊已经被赶上了山，便一人在门口伫立着，突然顾自言语，时而对着眼前的树木骂骂咧咧，“哗哗”的声响打断了他的的咒骂，他往屋后走去，一位穿着白色上衣的中年男子正在草屋前倾倒污水，男子正好看见出门的卜勇娃，“起早嘛！”男子说道。卜勇娃点了点头，“为啥子要搬到这座里呢？”卜勇娃问了一直想问的问题，男子为此感到惊讶，他惊讶于这次的搭讪卜勇娃竟然还问了自己问题，换在以前点头后他就该往回走了。\n“再不出来家里面的孩子就要没饭吃了。”男子说道。\n“出门在外不容易，你们是哪里的人呢？”\n“外地过来的……”男子回了后，从屋子里走出位一身白色穿着的女子，二十多岁的样子，卜勇娃第一次看到这样的女子，这或许是他这辈子见过最美的女子了，女子的一举一动无不吸引着他，女子看着卜勇娃的那副摸样似乎有些得意，笑了笑便又回到了家里，可女子这样男子却很不高兴，卜勇娃这时候还蒙在鼓里，“这是你的女儿吗？生得很好。”卜勇娃说道。男子有些不情愿的回答是的，他似乎想争辩什么，但他似乎又接受了别人这样的问法。\n卜勇娃回到屋里后，闲着没事在床上找来了烟丝，又从口袋里抽出了一张揉皱了的纸，正准备卷成烟——纸上的字迹让他停了下来，换做以往他一定会马上卷成烟，然后抽出火柴点起来，但这次他没有这么做，他慢慢的把纸展开，上面写着“在天愿作比翼鸟，在地愿”后面的字看不清了，不知道为什么，他突然很想知道后面的内容，不知怎的他回忆起初中暗恋隔壁班女同学的事，为了追到那位女同学，他好好的学了一年的古诗词，那时的他觉得最美的爱情，最好的告白应该从诗词开始……想着想着他突然骂了起来，旁边也传来争吵的声音，卜勇娃跑到外面，白衣女子突然跑到了他身后，嘴里喊着帮帮我，帮帮我，我家那个疯了。可女子没想到的是卜勇娃这时候也疯了，两个男人说着说着便扭打了起来，女子一时间也没办法，打着打着卜勇娃从羊圈里抽出一把铲子，一铲子往男子的身上重重的砸去，男子身体扭动了一会顺势倒在了地上。女子吓坏了急忙跑过来一把抱住了男子，卜勇娃见到男子倒在地上意识也清醒了过来，似乎他的正常状态能通过这种方式唤醒一样。\n两人把男子抬进了屋子，卜勇娃为自己刚才失误道了歉，女子说没关系，要不是他自己可能死在这男人的手里了。说着女子给卜勇娃到了一杯水，卜勇娃谢过后接过水杯一饮而尽，接着他从兜里拿出刚才准备卷的烟，正好抽出了刚才写有“在天愿作比翼鸟，在地愿”字样的纸，他愣了一会，女子看见后问他怎么了，又看见纸上写有字迹，要说这字迹太清晰，还是女子的眼力够好，她竟看到了上面的字样。\n“这是……”\n“哦!这是用来卷做烟抽的。”\n“你知道我问的不是这个。”\n“初中那时候写的了。”卜勇娃不知道为什么总感觉眼前的女子与自己很熟，还是她是一个快熟性格的女子呢？卜勇娃笑着说，接着又谈到了自己以前是怎么追隔壁班女孩子的事情，似乎这是风尘已久的心事，这么说出来后卜勇娃气色好了许多，或是他把刚才打男子的事情放了放呢？\n“写的时候一定很用心吧！”女子边照顾男子，边回答道。\n“或许吧！”卜勇娃迟疑了一会，支支吾吾地回答后，问了一句，“你知道后面的一句是什么吗？”\n“不知道唉！”女子答道。\n“看你是个读书的娃这个不懂？”\n女子又是微微一笑，卜勇娃看着笑容有点渗人，他顿时后背凉凉的，说到底女子的家真的很凉。\n“在天愿作比翼鸟，”后一句是，“在地愿做连理枝。”卜勇娃嗯了一声不再说什么，女子回答后便出去倒掉在地上的血水，留下卜勇娃一人，他看着刚才的纸一手拿出烟丝卷成了纸烟，抽出火柴，轻轻的滑动火柴，点燃了烟，深深吸了一口，走出去与女子寒暄几句后，说自己该上山了。女子心想他问自己那句古诗，就不问问它的意思吗？在卜勇娃心里他早已离开那个世界。\n回到家后的弥嘟的父母并不在家，父亲在电视柜上留下了一封信件，上面写着：去清林湾办丧，大后天回来，照顾好弟妹。后面还写着日期，弥嘟姐姐看了信件后收了起来，跑到外面抱柴准备烧火做饭，第二天，这几天有酒太多了，忙不过来啊！说话的是弥嘟的父亲，他父亲在与来客拉家常，接着他父亲还说几个人的死法都很怪异，很多人怕是得了什么传染病。\n吃完早饭后，孩子们也该去上学了，“爸我下个星期可能不回家，学校那边说让我们留在学校里面复习。”弥嘟姐姐说道。\n“复习什么？”她父亲问道。\n“就是准备毕业考了，老师让我们好好备考。”\n“行吧，你不回来，弥嘟他们怎办呢？”这话即使问弥嘟姐姐，也是问他自己，他吸着烟接着说，“你就在学校吧！到时候我去接他们几个人小的。”\n说罢，弥嘟姐姐带着弟弟们上了学，到木巴后，孩子们照旧去摘山石榴，弥嘟挣着自己也要去，姐姐说到时候别人都走了，姐姐可不管你。以为这能把他镇住，没想到弥嘟还是挣着要去，从卜勇娃家和白衣女子草房中穿过，前面是羊圈，羊圈的右侧有一条路通往后山，山石榴树就在那。\n姐姐和弥嘟走到羊圈旁，弥嘟姐姐突然说，你看他们都在前面，等会他们先摘完他们就走了，到时候我还要带你，我们慢慢的，到时候他们就不等我们了，到时候我们在后面遇到鬼怎么办，你现在回去我去摘好吗？\n但是弥嘟还是不依，弥嘟姐姐也是没办法放了狠话，你再这样下次不带你了，让你一个人在后面……说完姐姐往回走，继续说，你要摘你自己去吧！我回去等你。这么以来弥嘟也是怕了，差点哭出来，他只好原路返回，路过白衣女子门前时，他停留了一会，恰好女子开了门。昏暗的背景让弥嘟看不见她家里的全貌，女子依旧微微一笑，只是这次似乎透露着无比的高兴和得意。你还记得这个吗小弟弟，说着女子掏出了一本小册子。递到了弥嘟的眼前。\n“再送你一根棒棒糖，“女子说道：“然后送你这个小册子。”\n弥嘟尝过那颗独特的棒棒糖，确实与以往自己吃过的不一样。\n“我姐姐说，不能那别人的东西。”弥嘟说道。\n这时弥嘟后面走来摘完山石榴的孩子，他们叫住弥嘟，弥嘟跑向了他们，女子把东西收起来，看向孩子们，孩子们也看向她，孩子们都诧异这里竟然住着这么漂亮的姐姐。孩子们走后卜勇娃从山上下来，准备进屋看见女子站在门口，问道：“则怎么站在门外？”\n“没什么。”女子回答道。\n“对了，你怎么不去上学呢，还在读书吧？”\n“读啊，但是我是在家里读的。”\n“这里吗？”\n“是的啊，我家那个教我的。”\n之前没注意女子这么说，现在他才注意到，原来被他一铲子打倒的男子是他的丈夫，想到这他内心竟有些不自在，感觉什么东西一瞬间被拿掉一样。\n“张老师！！”\n卜勇娃转头看向了说话的人——弥嘟的姐姐，他还有点诧异，弥嘟姐姐有些不确定，并再次问道：“是胡冲村的张老师吗？”\n“嗯嗯，是我。”卜勇娃顿了一会才艰难的回答道，他想到在这里还能遇见认识自己老师这个身份的人。\n在卜勇娃母亲去世不久，因为当时村里缺一位数学老师，作为当时最高学历的卜勇娃被学校聘请当老师，起初他是拒绝的，但是母亲死后不久自己身上的钱也花光，自己本来也没多少钱，虽然自己的父亲留下有地产和渔场，但现在都掌握在其他的兄弟手里，自己再去读书的这几年里家里的这些财产几乎被其他兄弟划分完了，虽说也给他分了，无奈卜勇娃不想到田间水上劳作，想找个清闲一些的工作，当老师也可以，自己掂量掂量自己似乎又不够格，他那么晚上想了很多，自己真的有资格去教那些孩子吗？\n一天他待在家里想出去买东西，但摸了摸口袋自己只摸出了一张母亲生前给他寄的钱，这钱已经被蹂躏得褶皱不堪，或许在市面上已经不能用了，卜勇娃索性回到屋里，这时候的的房子是他弟弟的，按照传统谁照顾父母，或常年赡养父母，父母的房子就归谁，这人自然不是卜勇娃，而是他的弟弟，弟弟知道卜勇娃也是不容易，他弟弟生平也是一个好人，即使卜勇娃天天在家吃吃喝喝他也不说什么，但是他的妻子就不一样了，在走访亲戚吃饭的时候总拿这件事说事，卜勇娃弟弟对此也是没辙，闲话说多了也自然传到卜勇娃的耳朵里，一天在家请人吃饭的时候，来的亲戚说着说着，便把这件事抬到了台面上，这不说还好，说了便一发不可收拾。\n“实（卜勇娃的小名）啊，你也该去找点事做了，天天窝在你弟弟家里……”一位长辈说道。\n“我说啊，实啊，我说啵，说嘛你也别说我骂你，你在你弟弟家……该找点事做，我和你爸，从小看你长大，现在你爸不在……别给他老人家丢了面子……”另一位长辈说道。\n……\n第二天，卜勇娃便去学校应聘，“问你的时候你死活不来，你看现在学校已经不缺数学老师了。”学校的领导说道。\n卜勇娃看这事是泡汤了，准备回去到渔场走走，干回自己最初的活，走出门口后领导叫住了他，“语文你教得了吗？现在缺一个语文老师，可以教的话就去教语文吧！”领导说道。\n卜勇娃上前感谢后，激动跑回家准备去了，领导聘用倒不是真的缺语文老师，只是学校受卜勇娃的父亲资助过，这个人情领导不能不认，再者领导也听说了卜勇娃的事情，卜勇娃毕竟也上过初中，也是个有用之才。\n就这样卜勇娃在胡冲村当了语文老师，这一干就是五六年，一天早上卜勇娃因为带学生到宿舍赶蝙蝠，被领导叫到了办公室，并拿到一张辞退书，他被辞退倒不是因为带学生打蝙蝠，而是有学生举报他教学方式有问题，学校也收到了家长的反馈，迫于压力学校辞退了卜勇娃，当时卜勇娃是弥嘟姐姐班的语文老师，而到宿舍赶蝙蝠的事情就是弥嘟姐姐向卜勇娃汇报后，卜勇娃带着孩子们去宿舍驱赶蝙蝠的。\n后来学校里传着卜勇娃是因为带学生到宿舍打蝙蝠被辞退的，虽然后来弥嘟姐姐知道那是谣言，但是她内心还是对此过意不去。\n说道这，弥嘟姐姐向卜勇娃说了声抱歉，“这不怪你，我当年被辞退是教学方式有问题，这不怪你，你不用放在心上。”卜勇娃吸着烟说道。\n弥嘟的姐姐还想多说些什么，但是卜勇娃说，你该去上学了，不然你的同学先走了。\n“好的老师，下次放学回家再来看您。”说罢弥嘟姐姐边跑了回去。\n“没想到你还有这样的过往。”白衣女子高兴的说道，好像她发现了什么惊天的秘密一样。\n“都过去了，现在照样在这放羊。”卜勇娃苦笑的说道。\n“要不来我家坐坐，喝喝茶。”\n卜勇娃说声不了，便想回家休息，但女子再次邀请，又说，上次的帮忙还没感谢呢，怎么说也来家坐坐，喝喝茶以表感谢。\n自从那次以后卜勇娃经常与白衣女子搭话，两人也渐渐熟络起来，似乎白衣女子正一步一步带他返回那个世界。\n因为来山的胡冲村猎人常在卜勇娃休息，所以晚上自己家里灯火通明自己也不会觉得奇怪，他想或许猎人们又得猎物了，说不定今晚又是把酒言欢的一晚，他赶着牛羊往圈子里走去，看到一个猎人从白衣女子家里有说有笑的走出来，卜勇娃想问什么，欲上前问，他又想，难道我要问你一脸高兴的从里面走出来是有什么好事吗？没等他想明白，“回来啦！”那人便说了声，感觉自己现在是个外来人，要借宿在那位猎人家一样。\n附件 ",
    "description": "",
    "tags": "恐怖",
    "title": "草屋夫妇",
    "uri": "/textbook/5.%E7%99%BD%E9%AA%A8%E5%A4%AB%E5%A6%87/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 恐怖",
    "uri": "/tags/%E6%81%90%E6%80%96/"
  },
  {
    "breadcrumb": "",
    "content": " Search 搜索 欢迎来到我的个人博客网站……\n",
    "description": "",
    "tags": null,
    "title": "王梅四郎maloudown",
    "uri": "/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: Version",
    "uri": "/categories/version/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 三、关于",
    "content": " 附件 ",
    "description": "",
    "tags": [
      "网站版本",
      "网站优化"
    ],
    "title": "版本",
    "uri": "/about_create_web/%E7%89%88%E6%9C%AC/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 网站版本",
    "uri": "/tags/%E7%BD%91%E7%AB%99%E7%89%88%E6%9C%AC/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 网站优化",
    "uri": "/tags/%E7%BD%91%E7%AB%99%E4%BC%98%E5%8C%96/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: B4-拓展笔记",
    "uri": "/categories/b4-%E6%8B%93%E5%B1%95%E7%AC%94%E8%AE%B0/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 10.微信小程序",
    "content": " 附件 ",
    "description": "",
    "tags": "微信",
    "title": "基础知识",
    "uri": "/branch-bundle-1/10.%E5%BE%AE%E4%BF%A1%E5%B0%8F%E7%A8%8B%E5%BA%8F/%E5%9F%BA%E7%A1%80%E7%9F%A5%E8%AF%86/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 微信",
    "uri": "/tags/%E5%BE%AE%E4%BF%A1/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 三、关于",
    "content": "推送网站步骤 #在项目更目录下运行下面这句命令 hugo --theme=hugo-theme-relearn-main --baseURL=\"https://wungmeisilong.github.io/\" --buildDrafts #进入public文件夹 cd public/ #初始化文件夹，这个命令不一定要需要， #有时候不初始化也可以推送，之前执行过久不建议在执行 git init #加入要推送的文件 git add . #添加更改备注文字 git commit -m \"备注的文字\" #推送到远程仓库 git push origin main ",
    "description": "",
    "tags": null,
    "title": "推送网站步骤",
    "uri": "/about_create_web/%E6%8E%A8%E9%80%81%E7%BD%91%E7%AB%99%E6%AD%A5%E9%AA%A4/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: git",
    "uri": "/tags/git/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: github",
    "uri": "/tags/github/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 1.文章",
    "content": "1、使用git commi -m “……“时报错： Your branch is up to date with ‘origin/master‘ 今天在提交项目的时候报了这个错误，在网上查了解决办法，有的说创建新的分支可以解决，但我的不行。\n最后我的解决办法是先退出git base here，再重新进入，下面是具体步骤：\n先使用git add .； 接着使用git status -s查看我更改的文件，也是我要推送的文件，如果前面的有M和??，那么久重新更新文件，然后重复上面的步骤； 发现前面的M是绿色的后就可以使用git commit -m \"文件备注\"； 然后推送就可以了git push origin main。 这里的关键命令是git status -s，我现在搞不懂这个错误产生的原因…… 附件 ",
    "description": "",
    "tags": [
      "github",
      "报错与解决",
      "git"
    ],
    "title": "Git常遇问题",
    "uri": "/branch-bundle-1/%E5%85%B6%E4%BB%96%E6%96%87%E7%AB%A0/github%E5%B8%B8%E9%81%87%E9%97%AE%E9%A2%98/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: W1-博客文章",
    "uri": "/categories/w1-%E5%8D%9A%E5%AE%A2%E6%96%87%E7%AB%A0/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 报错与解决",
    "uri": "/tags/%E6%8A%A5%E9%94%99%E4%B8%8E%E8%A7%A3%E5%86%B3/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: B5-比赛",
    "uri": "/categories/b5-%E6%AF%94%E8%B5%9B/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: X1-项目",
    "uri": "/categories/x1-%E9%A1%B9%E7%9B%AE/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 后端",
    "uri": "/tags/%E5%90%8E%E7%AB%AF/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 12.实战项目",
    "content": "比赛说明 自己有幸参加这次唛盟杯的比赛，这次比赛流程如下：\n一、报名时2024年1月1到31日本来是12月份但延期了。\n二、培训时间，现在还不确定，不过也是可以肯定是年后的事了。\n三、项目制作时间3-5月，不知道后面会不会改。\n四、项目环境及操作流程\n（一）、开发工具\n1、要求使用唛盟低代码平台作为开发项目模板唛盟低代码平台链接；\n2、要求使用唛盟研发管理系统（唛盟xm）进行软件研发项目管理唛盟研发管理系统链接;\n（二）、唛盟xm操作流程\n1、先在唛盟xm中建立一个产品，产品名称为“知识产权流程管理系统”； 2、细化产品需求； 3、由产品派生一个项目，构建项目团队； 4、由需求派生项目任务，并确定任务执行人、计划完成时间等； 5、编制测试用例，建立测试计划，执行测试； 6、出具项目报告，提交结项申请。 （三）、代码提交\n官方提供代码库链接，我们下载后，在该代码库基础上进行开发、提交代码。\n比赛题目 一、项目主题 知识产权流程管理系统\n二、项目描述\n该系统用于知识产权项目申报的全过程跟踪管理，其功能包括：\n客户下单、 提交申请、 申请反馈、 订单查询、 订单详情、 文档查阅下载等六大部分。 该系统分为客户端和管理端两个子系统。客户端对客户开放，主要功能包括：\n客户下单、 付款、 订单查询、 订单进度消息推送（推送到公众号、网站内部消息）、 文档查阅下载等。 管理端对管理人员开放，不对客户开放，负责订单管理、文档上传（批量上传）等。\n三、项目需求 （一）、用户端\n个人中心模块：\n1、订单查询\n分为我的订单（综合查询）及商标、专利、版权、科技项目四大子类查询，订单查询按全部业务下单时间顺列。\n订单查询功能大致效果图： 2、订单详细\n可根据订单详情按钮跳转到对应的订单详情。 订单详情页展示图： （二）、管理端\n订单管理模块：\n1、订单查询\n查询订单，展示列表。\n2、订单详细\n在订单列表中点击某个订单，进入订单详情。\n3、文档上传\n在订单详情页，点击文档上传，选中本地文件，上传本地文件到服务器，支持批量、单文件上传。\n注册唛盟账号 队长和队员注册账号 一、扫描一级部门的二维码\n这一部分只建议参加了比赛的网友查看。本次是组队参加，一队3-5人，队长要在他们的官方网页端注册号团队（二级部门），方便后面的项目管理，然后再通过一级部门添加自己的团队，首先是扫描官方给的二维码，扫这个二维码后注册就会在一级部门下，这也是要注册在一级部门之下的办法，\n二、授权登录成功后，跳转到提示页面，点击“首页”\n三、进入低代码平台首页，按照提示，点击“账户明细”\n四、按照提示，输入姓名，并提交\n五、点击唛盟低代码平台官网，选择微信扫码登录\n唛盟低代码平台官网：https://maimengcloud.com/lcode/m1/#/login\n六、看到用户名称是自己的即报名成功\n队长注册团队 1要求 1.构建每个参赛团队的独立部门 2.将参赛队员拉入部门 3.给每个参赛队员设置好岗位 2相关环境 唛盟账户系统\n3操作步骤 3.1 在一级部门，即总部下建立子部门\n进入【部门管理】，点击【添加下级】\n3.2输入部门信息\n部门名称要求：以参赛团队名称作为部门名称 上级领导选：一级部门 部门负责人：选参赛团队组长 部门性质：技术部门 协作类型：内部组织 其它字段不填\n（如果你不是第一届比赛的同学，那这个不需要关注，可能每年都不一样）\n3.3保存提交\n3.4把岗位挂接到部门上\n【部门管理】中找到刚才建立的部门，点击【岗位】按钮弹出以下岗位选择框：\n选择左边需要绑定的岗位，移动到右边，点击【提交】按钮即完成岗位绑定（如果没有显示岗位，多次刷新，或者退出重新登录，这个知识第一届遇到此问题解决的方案）\n3.5把用户拉入部门\n打开【用户管理】菜单，先把自己的搜索出来，如果不是通过一级部门的二维码注册的，会搜不到的哦。找到需要拉入的队友，点击【部门/岗位】\n弹出以下部门岗位选择界面：\n在弹出的界面中左边选中归属的部门，右边选中岗位，再【提交】即可\n这部分本来也不想记了，毕竟没什么用了，可能下一届又不一样了，但想想自己记一下当作回忆也可以。\n安装git和nodejs 在安装前我们通过这个链接https://gitee.com/maimengcloud/mdp-lcode-ui-web去看看这个项目的介绍，\n大概浏览一下，然后往下拉根据导航直接跳到 快速开始\n这里并不是说其他的不重要，只是说对于一个项目而言如果不是涉及本地启动的话不必花费时间去纠结，等你能让项目在本地启动后再回来看看也不迟，当然这也有弊端，可能会错一些细节哈。\n在快速开始的地方提到：\n注意：该项目使用 element-ui@2.3.0+ 版本，所以最低兼容 vue@2.5.0+ nodejs版本v14.16.1\n所以我们安装的时候要注意版本的问题尽量不要选太高的，如果你已经安装了一部分或全部，而且版本很高或很低，这样也不必太担心（大不了删掉重新安装，哈哈），下面是我的一些经验，希望帮到你。\ngit的安装 这部分没有太多可讲的，网上有很多的教程，讲的也很好，这里需要你记住的一条命令是：\ngit clone \u003c远程仓库地址\u003e \u003c本地存放目录\u003e这里举个例子，就比如这次比赛用到的这个项目,我们建一个文件夹装要下载的项目，比如是mdp文件夹，然后右键，win11选显示更多，在弹出的选项选择： git bash here\n然后复制下面的内容回车就可以了。\ngit clone https://gitee.com/maimengcloud/mdp-lcode-ui-web.git mdp-lcode-ui-web/\n但是有的时候也会因为网速的问题，导致无法下载，比如回车后报错，如下:\nCloning into ‘mdp-lcode-ui-web’… fatal: unable to access ‘https://gitee.com/maimengcloud/mdp-lcode-ui-web.git/': Failed to connect to 127.0.0.1 port 26501 after 2017 ms: Couldn’t connect to server\n简单翻译理解就是这个远程仓库无法访问，其实这也是使用让我比较烦恼的问题，这里的原因我可能没办法给你讲清楚（你有时间可以去琢磨哈），但有个软件可以分享给你，帮你解决这个问题，即 watt toolkit ,而且这个软件在微软软件商城就有。\n下载后选github，然后点击一键加速。\n然我们再回到git base here，再次输入刚才的命令回车，\n发现刚才的代码仓库已经下载到本地了。\n如果你使用上面的软件还是无法下载远程的仓库，那你需要根据报错信息在网上查考相关的信息，这里提供上面报错的可能解决方案，只是针对上面的问题哦！参照文章\n安装node 网上可能称为nodejs都是一个工具，这个工具的简介还请参照官方，这里我们有做过多的了解哦。在安装node之前我们要先安装nvm。这是一个管理node的工具，这里安装的主要目的是 升高或降低node版本，简单就是想安装哪个版本（已发布且可下载的版本）的可以用这个工具来实现。\nnvm是否要安装取决于你的情况，除了nvm，此次项目还需要安装工具node，vue，mvn。\n方案一：为防止版本过高过低影响运行，以后可能还需要，最好是下载nvm管理node，然后也要了解升级或降低vue版本的方法，最后下载mvn；\n方案二：自己不管安装还是没安装，直接安装node，vue，mvn，本次项目用到的node，vue，mvn都在package.json文件里定义写好了，运行后会根据里面去下载，似乎对项目没太大影响（因为我工具处于最高版本，或是相对低一点的版本，使用相同的命令，报错都是一个，基于这点你可以尝试。）\n方案一 安装nvm 参照文档 关于文章的几点说明：\n登录github的时候记得开watt toolket; 如果nvm下载不了要刷新或者退出重新进入，多试几次； 基于本次的项目我们只看文章的一——四，五往后有时间就了解一下就好了； 里面的 三、配置路径和下载源我们需要把淘宝镜像改为如下：\nnode_mirror: https://cdn.npmmirror.com/binaries/node/ npm_mirror: https://cdn.npmmirror.com/binaries/npm/这是因为淘宝的镜像换了。\n接着参照文章，目的是node还要做一些配置，主要node的环境变量设置，还有目录node_cache和目录node_global的一些设置。从文章的下图开始看，关于node的下载就不看了。 注意在设置目录node_cache和目录node_global时，\nnpm config set prefix “\u003c自己的文件目录\u003e\\node_global” npm config set cache “\u003c自己的文件目录\u003e\\node_cache”\n这两个路径时要记得把它改成自己安装的路径：\n安装指定的vue版本 情况一：你没安装过vue 首先你要先安装好node，然后用node的npm工具安装vue。\n使用命令查看可安装版本：\n要查看的vue版本是1.x和2.x的\nnpm view vue-cli versions --json 要查看的vue版本是3.x的\nnpm view @vue/cli versions --json安装vue指定的版本：\n安装的vue版本是1.x和2.x的\nnpm install -g @vue/cli@版本号 yarn global add @vue/cli@版本号 要查看的vue版本是3.x的\nnpm install -g vue-cli@版本号 yarn global add vue-cli@版本号第一次安装要去配环境变量。\n情况二：你安装过vue 卸载已经安装的Vue Cli\n卸载 3.x 或 4.x 版本的Vue Cli\nnpm uninstall -g @vue/cli yarn global remove @vue/cli 卸载 1.x 或 2.x 版本的Vue Cli\nnpm uninstall vue-cli -g yarn global remove vue-cli重复情况一的步骤，然后打开cmd，输入：\nvue -V显示安装的版本则说明安装完成。\n原文章链接\n安装mvn（Maven）工具 直接参照这个文章就好了。\n方案二 安装node和vue 参照文章，同样的里面涉及到镜像文件的设置要注意换掉：\nnode_mirror: https://cdn.npmmirror.com/binaries/node/ npm_mirror: https://cdn.npmmirror.com/binaries/npm/除此之外在设置目录node_cache和目录node_global这两个路径时要记得把它改成自己安装的路径：\nnpm config set prefix “\u003c自己的文件目录\u003e\\node_global” npm config set cache “\u003c自己的文件目录\u003e\\node_cache”\n安装mvn 直接参照这个文章就好了。\n至此工具就就安装完了，接着我们就要去启动项目了。\n本地启动项目 本次使用的系统是win11和code应用程序，如果你用的不是这个系统和应用程序情况可能不一样哈。\n根据项目的简介开始运行项目 这里我使用的是code应用程序（你如果用的是别的应用程序另说咯），点击文件夹用code打开后，根据项目文档执行命令：\nnpm install结果…………………………报错啦（我就知道没这么简单）！！！错误如下：\n上面的报错意思是：在尝试安装项目依赖时，npm遇到了依赖冲突问题。具体来说，babel-loader需要webpack的版本在2、3或4之间，但是你的项目中已经安装了webpack的5.90.1版本。这导致了peer依赖冲突，因为babel-loader期望的webpack版本与实际安装的版本不匹配，\n解决办法如下：\n1.查看自己的node版本；\n``` node -v ``` 2.修改\"package.json\"，在\"devDependencies\"中增加\"node\": “^21.6.1\"依赖；\n``` \"node\":\"^21.6.1\", ``` 3.npm install -s node-sass@4.14.1;\n4.npm install –save –legacy-peer-deps;\n结果……………………报错啦！！！！！ 修改\"package.json\"，原来的改为\"node\": \"^13.14.0\"依赖； 再次运行结果没报错。 5.npm install –registry=https://cdn.npmmirror.com\n接着我们运行如下代码 `npm install --registry=https://cdn.npmmirror.com` 6.npm run dev\n运行npm run dev，结果还是报错了…… 这里的错误说vue-template-compiler的版本为2.7.16，那我们就去\"package.json\"找到vue， 原来的vue版本： 把上面的修改为`\"vue\":\"^2.7.16\",` 这时候要重新运行 `npm install --save --legacy-peer-deps`,然后再次运行 `npm run dev`; 结果还是报错，如下： 大概意思是没有找到ajv这个包，那么我们在\"package.json\"里的 **\"dependencies\"** 添加`\"ajv\": \"^8.12.0\",` 然后重复`npm install --save --legacy-peer-deps`, `npm run dev`操作就可以了。 显示如下： 我们再看看页面，页面如下： 到这里说明没问题了。 从上面我们可以了解到一点，自己安装的版本似乎并不会影响项目的运行，所以选择方案二来进行安装似乎更简单，但从往长远的看方案一更更好，他可以随时换版本，更为方便。\n原文章链接\n",
    "description": "",
    "tags": [
      "前端",
      "后端"
    ],
    "title": "唛盟杯比赛详记",
    "uri": "/branch-bundle-1/12.%E5%AE%9E%E6%88%98%E9%A1%B9%E7%9B%AE/%E5%94%9B%E7%9B%9F%E6%9D%AF%E9%A1%B9%E7%9B%AE%E9%94%99%E8%AF%AF%E8%AE%B0%E5%BD%95/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 前端",
    "uri": "/tags/%E5%89%8D%E7%AB%AF/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 1.文章",
    "content": "拥有一个属于自己的服务器个人感觉就很赞，我最初是在不买公网IP情况下，用一台电脑做服务器，然后另外一台电脑可以远程访问，部署网站，然后别人可以访问这个网站，这样一个功能。如果你也有这样的想法还请阅读下去，希望自己的经验对你有所帮助。\n所需设备 一台旧电脑，一台目前在使用的电脑。\n在旧电脑上安装natapp程序 在百度上搜索NATAPP，或点击这个链接:NATAPP,\n进入网站后先简单注册一下用户,顺便实名认证一下，因为买隧道会提示需要实名，接着点击首页下载自己的电脑系统对应版本，我的是Windows（下面的测试也是基于Windows）\n下载好后解压文件，得到如下图程序：\n在解压文件下新建一个文件： config.ini,做好这一步后我们去购买免费的隧道，如下图：\n点击网站的文档，然后点击教程/文档里的 使用本地配置文件config.ini 文章，\n然后复制里面的配置信息：\n#将本文件放置于natapp同级目录 程序将读取 [default] 段 #在命令行参数模式如 natapp -authtoken=xxx 等相同参数将会覆盖掉此配置 #命令行参数 -config= 可以指定任意config.ini文件 [default] authtoken= #对应一条隧道的authtoken clienttoken= #对应客户端的clienttoken,将会忽略authtoken,若无请留空, log=none #log 日志文件,可指定本地文件, none=不做记录,stdout=直接屏幕输出 ,默认为none loglevel=ERROR #日志等级 DEBUG, INFO, WARNING, ERROR 默认为 DEBUG http_proxy= #代理设置 如 http://10.123.10.10:3128 非代理上网用户请务必留空在字段authtoken后面值在我的隧道配置里可以找到，如下：\n复制下图authtoken的值填到config.ini文件里\n我这边演示的效果如下：\n完成上面的操作后，我们运行NATAPP程序，结果如下：\n你会得到一个随机的网址，这个网址指向你的本地端口，当你有网站挂载到本地端口时，你就可以通过网址访问到你的本地端口网址，内网外网都可以，但是这个网址每一次运行都会不一样，这点需要注意，然后就是端口的设置，看下图：\n我这里写的的端口是1313，如果你网站运行后不在1313，例如你运行网站后，本地的网站启动端口是8080.那你就把这个地方的1313改为8080就可以了。\n下面我们举个例子看看，假设我现在我需要外网的网友访问我挂在在自己电脑本地的网站，那们在做好上面的操作后我先去启动自己的网站，这里使用hugo的网站模版，用code程序打开网站模版，然后调出终端，在终端输入命令 hugo server ,表示启动网站，如下图：\n然后去复制刚才运行NATAPP程序后的网站，在浏览器中打开，我们先试一下局域网能不能访问，结果如下：\n将网站发给自己的朋友，测试外网是否可以访问，\n结果是外网可以正常可以访问。\n那么到这里你的电脑其实就充当了一台服务器，将网站放到了你电脑上，只要你的电脑保持开机状态那么别人就可以一直访问你的网站，或许NATAPP网站还有别的有趣功能，所以你不妨去摸索摸索，所不定可以找到多次启动NATAPP指向你本地的网址不变，你也就不用每次启动后都要发新的网址给对方了。\n那么其实到这里就差不多了，但是我们还需要用一台电脑控制另一台电脑，简而言之就是电脑的远程登录，其实电脑远程登录有许多的方法，这里我需要借助一个来实现内网穿透，其实上面的旧电脑变服务器也是使用了内网穿透， 附件 ",
    "description": "",
    "tags": [
      "前端",
      "网络",
      "网站"
    ],
    "title": "如何用旧电脑搭建自己的服务器？",
    "uri": "/branch-bundle-1/%E5%85%B6%E4%BB%96%E6%96%87%E7%AB%A0/%E5%A6%82%E4%BD%95%E7%94%A8%E6%97%A7%E7%94%B5%E8%84%91%E6%90%AD%E5%BB%BA%E8%87%AA%E5%B7%B1%E7%9A%84%E6%9C%8D%E5%8A%A1%E5%99%A8/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 网络",
    "uri": "/tags/%E7%BD%91%E7%BB%9C/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 网站",
    "uri": "/tags/%E7%BD%91%E7%AB%99/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: Z1-哲学",
    "uri": "/categories/z1-%E5%93%B2%E5%AD%A6/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 哲学",
    "uri": "/tags/%E5%93%B2%E5%AD%A6/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 庄子",
    "uri": "/tags/%E5%BA%84%E5%AD%90/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 11.哲学",
    "content": "今天通过王德峰老师的视频课来进一步的了解《庄子》的哲学之道，推荐看曹楚基注释的《庄子》。\n行无为而知避害，避害就是避开人为，像自然灾害不在道家讨论的范围内。避害的方法有两个:\n一是天下的人为的事情辨认出来。 二是自己不参与任何人为的事情。不参与是一种人生态度。 一、如何辨别人为？\n二、如何不参与人为之？\n庄子行于山中，见大木枝叶盛茂。伐木者止其旁而不取也。问其故，曰:“无所可用。”庄子曰:“此木以不材得终其天年。”夫子出于山。舍于故人之家。故人喜命竖子杀雁而烹之。竖子请曰:“其一能鸣，其一不能鸣，请奚杀?”主人曰:“杀不能鸣者。”明日弟子问于庄子曰:“昨日山中之木以不材得终其天年，今主人之雁以不材死，先生将何处?”庄子笑曰:“周将处夫材与不材之间。材与不材之间，似之而非也，故未免乎累。若夫乘道德1而浮游2则不然3。 ——《庄子山木篇》\n全身避害，终究避不了害，怎么办呢？\n列子有言：生非贵之所能存，生非爱之所能厚。\n老子的给出的方法：贵以身为天下，若可寄天下;爱以身为天下，若可托天下4。\n下面是原文： 宠辱若惊，贵大患若身。 何谓宠辱若惊?宠为下，得之若惊，失之若惊，是谓宠辱若惊。何谓贵大患若身?吾所以有大患者，为吾有身，及吾无身，吾有何患?故贵以身为天下，若可寄天下;爱以身为天下，若可托天下。 ——《道德经》第十三章\n接下来讨论逍遥游与齐物论。前一篇将境界，后一篇讲道理，前一篇讲要达到哪一种境界，后一篇是如何讲达到这种境界。\n《逍遥游》原文 北冥有鱼，其名为鲲。鲲之大，不知其几千里也；化而为鸟，其名为鹏。鹏之背，不知其几千里也；怒而飞，其翼若垂天之云。是鸟也，海运则将徙于南冥。南冥者，天池也。《齐谐》者，志怪者也。《谐》之言曰：“鹏之徙于南冥也，水击三千里，抟扶摇而上者九万里，去以六月息者也。”野马也，尘埃也，生物之以息相吹也。天之苍苍，其正色邪？其远而无所至极邪？其视下也，亦若是则已矣。且夫水之积也不厚，则其负大舟也无力。覆杯水于坳堂之上，则芥为之舟；置杯焉则胶，水浅而舟大也。风之积也不厚，则其负大翼也无力。故九万里，则风斯在下矣，而后乃今培风；背负青天，而莫之夭阏者，而后乃今将图南。蜩与学鸠笑之曰：“我决起而飞，抢榆枋而止，时则不至，而控于地而已矣，奚以之九万里而南为？”适莽苍者，三餐而反，腹犹果然；适百里者，宿舂粮；适千里者，三月聚粮。之二虫又何知！小知不及大知，小年不及大年。奚以知其然也？朝菌不知晦朔，蟪蛄不知春秋，此小年也。楚之南有冥灵者，以五百岁为春，五百岁为秋；上古有大椿者，以八千岁为春，八千岁为秋。此大年也。而彭祖乃今以久特闻，众人匹之，不亦悲乎？\n汤之问棘也是已：“穷发之北，有冥海者，天池也。有鱼焉，其广数千里，未有知其修者，其名为鲲。有鸟焉，其名为鹏，背若泰山，翼若垂天之云；抟扶摇羊角而上者九万里，绝云气，负青天，然后图南，且适南冥也。斥鷃笑之曰：‘彼且奚适也？我腾跃而上，不过数仞而下，翱翔蓬蒿之间，此亦飞之至也。而彼且奚适也？’”此小大之辩也。\n故夫知效一官、行比一乡、德合一君、而征一国者，其自视也，亦若此矣。而宋荣子犹然笑之。且举世誉之而不加劝，举世非之而不加沮，定乎内外之分，辩乎荣辱之境，斯已矣。彼其于世，未数数然也。虽然，犹有未树也。夫列子御风而行，泠然善也，旬有五日而后反。彼于致福者，未数数然也。此虽免乎行，犹有所待者也。若夫乘天地之正，而御六气之辩，以游无穷者，彼且恶乎待哉？故曰：至人无己，神人无功，圣人无名。\n尧让天下于许由，曰：“日月出矣，而爝火不息；其于光也，不亦难乎？时雨降矣，而犹浸灌；其于泽也，不亦劳乎？夫子立而天下治，而我犹尸之；吾自视缺然，请致天下。”许由曰：“子治天下，天下既已治也；而我犹代子，吾将为名乎？名者，实之宾也；吾将为宾乎？鹪鹩巢于深林，不过一枝；偃鼠饮河，不过满腹。归休乎君，予无所用天下为！庖人虽不治庖，尸祝不越樽俎而代之矣！”\n肩吾问于连叔曰：“吾闻言于接舆，大而无当，往而不反。吾惊怖其言。犹河汉而无极也；大有径庭，不近人情焉。”连叔曰：“其言谓何哉？”曰：“藐姑射之山，有神人居焉。肌肤若冰雪，淖约若处子，不食五谷，吸风饮露，乘云气，御飞龙，而游乎四海之外；其神凝，使物不疵疠而年谷熟。吾以是狂而不信也。”连叔曰：“然。瞽者无以与乎文章之观，聋者无以与乎钟鼓之声。岂唯形骸有聋盲哉？夫知亦有之！是其言也犹时女也。之人也，之德也，将旁礴万物以为一，世蕲乎乱，孰弊弊焉以天下为事！之人也，物莫之伤：大浸稽天而不溺，大旱金石流，土山焦而不热。是其尘垢秕糠将犹陶铸尧舜者也，孰肯以物为事？”宋人资章甫而适诸越，越人断发文身，无所用之。尧治天下之民，平海内之政，往见四子藐姑射之山，汾水之阳，窅然丧其天下焉。\n惠子谓庄子曰：“魏王贻我大瓠之种，我树之成，而实五石。以盛水浆，其坚不能自举也。剖之以为瓢，则瓠落无所容。非不呺然大也，吾为其无用而掊之。”庄子曰：“夫子固拙于用大矣。宋人有善为不龟手之药者，世世以洴澼絖为事。客闻之，请买其方百金。聚族而谋曰：‘我世世为洴澼絖，不过数金，今一朝而鬻技百金，请与之。’客得之，以说吴王。越有难，吴王使之将，冬，与越人水战，大败越人。裂地而封之。能不龟手一也，或以封，或不免于洴澼絖，则所用之异也。今子有五石之瓠，何不虑以为大樽，而浮于江湖，而忧其瓠落无所容？则夫子犹有蓬之心也夫！”\n惠子谓庄子曰：“吾有大树，人谓之樗。其大本拥肿而不中绳墨，其小枝卷曲而不中规矩，立之涂，匠者不顾。今子之言大而无用，众所同去也。”庄子曰：“子独不见狸狌乎？卑身而伏，以候敖者；东西跳梁，不辟高下；中于机辟，死于罔罟。今夫斄牛，其大若垂天之云。此能为大矣，而不能执鼠。今子有大树，患其无用，何不树之于无何有之乡，广莫之野，彷徨乎无为其侧，逍遥乎寝卧其下。不夭斤斧，物无害者，无所可用，安所困苦哉！”\n轻物重生————老子:反者道之动，以不变应万变————庄子:齐生死一物我\n附件 道德：事物的德性。 ↩︎\n浮游：即物物而不物于物。意思是说，做一件事情，不被这件事情所支配。 ↩︎\n若夫乘道德而浮游则不然。按照事物的德性去做该做的事情，但又不被事物所支配。 ↩︎\n看重自己的身体把它等同于看重天下，于是就可以把身体寄托于天下（这里这么说的原因是如果你爱惜自己的身体向把一艘船藏到山沟里一样，不让人发现，但第二天还是被人偷走了一样，如果你把船藏于天下，那么不管怎么样船都不会被偷走。）。爱惜自己身体等同于爱惜天下，于是可以把它寄托于天下。 ↩︎\n",
    "description": "",
    "tags": [
      "庄子",
      "哲学"
    ],
    "title": "庄子之道",
    "uri": "/branch-bundle-1/11.%E5%93%B2%E5%AD%A6/%E5%BA%84%E5%AD%90%E4%B9%8B%E9%81%93/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 费尔巴哈",
    "uri": "/tags/%E8%B4%B9%E5%B0%94%E5%B7%B4%E5%93%88/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 11.哲学",
    "content": "一\n从前的一切唯物主义（包括费尔巴哈的唯物主义）的主要缺点是：对对象、现实、感性，只是从客体的或者直观的形式去理解，而不是把它们当作感性的人的活动，当作实践去理解，不是从主体方面去理解。因此，和唯物主义相反，能动的方面却被唯心主义抽象地发展了，当然，唯心主义是不知道现实的、感性的活动本身的。费尔巴哈想要研究跟思想客体确实不同的感性客体：但是他没有把人的活动本身理解为对象性的［gegenständliche］活动。因此，他在《基督教的本质》中仅仅把理论的活动看作是真正人的活动，而对于实践则只是从它的卑污的犹太人的表现形式去理解和确定。因此，他不了解“革命的”、“实践批判的”活动的意义。\n二\n人的思维是否具有客观的［gegenständliche］真理性，这不是一个理论的问题，而是一个实践的问题。人应该在实践中证明自己思维的真理性，即自己思维的现实性和力量，自己思维的此岸性。关于思维——离开实践的思维——的现实性或非现实性的争论，是一个纯粹经院哲学的问题。\n三\n关于环境和教育起改变作用的唯物主义学说忘记了：环境是由人来改变的，而教育者本人一定是受教育的。因此，这种学说一定把社会分成两部分，其中一部分凌驾于社会之上。\n环境的改变和人的活动或自我改变的一致，只能被看作是并合理地理解为革命的实践。\n四\n费尔巴哈是从宗教上的自我异化，从世界被二重化为宗教世界和世俗世界这一事实出发的。他做的工作是把宗教世界归结于它的世俗基础。但是，世俗基础使自己从自身中分离出去，并在云霄中固定为一个独立王国，这只能用这个世俗基础的自我分裂和自我矛盾来说明。因此，对于这个世俗基础本身应当在自身中、从它的矛盾中去理解，并在实践中使之革命化。因此，例如，自从发现神圣家族的秘密在于世俗家庭之后，世俗家庭本身就应当在理论上和实践中被消灭。\n五\n费尔巴哈不满意抽象的思维而喜欢直观；但是他把感性不是看作实践的、人的感性的活动。\n六\n费尔巴哈把宗教的本质归结于人的本质。但是，人的本质不是单个人所固有的抽象物，在其现实性上，它是一切社会关系的总和。\n费尔巴哈没有对这种现实的本质进行批判，因此他不得不：\n（１）撇开历史的进程，把宗教感情固定为独立的东西，并假定有一种抽象的——孤立的——人的个体。\n（２）因此，本质只能被理解为“类”，理解为一种内在的、无声的、把许多个人自然地联系起来的普遍性。\n七\n因此，费尔巴哈没有看到，“宗教感情”本身是社会的产物，而他所分析的抽象的个人，是属于一定的社会形式的。\n第八条\n全部社会生活在本质上是实践的。凡是把理论引向神秘主义的神秘东西，都能在人的实践中以及对这个实践的理解中得到合理的解决。\n九\n直观的唯物主义，即不是把感性理解为实践活动的唯物主义至多也只能达到对单个人和市民社会的直观。\n十\n旧唯物主义的立脚点是市民社会，新唯物主义的立脚点则是人类社会或社会的人类。\n十一\n哲学家们只是用不同的方式解释世界，问题在于改变世界\n附件 ",
    "description": "",
    "tags": [
      "费尔巴哈",
      "哲学",
      "马克思主义哲学"
    ],
    "title": "费尔巴哈提纲",
    "uri": "/branch-bundle-1/11.%E5%93%B2%E5%AD%A6/%E8%B4%B9%E5%B0%94%E5%B7%B4%E5%93%88%E6%8F%90%E7%BA%B2/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 马克思主义哲学",
    "uri": "/tags/%E9%A9%AC%E5%85%8B%E6%80%9D%E4%B8%BB%E4%B9%89%E5%93%B2%E5%AD%A6/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 爱情",
    "uri": "/tags/%E7%88%B1%E6%83%85/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 二、小 说",
    "content": "木尸王朝 1.文中的人类变成树木的原因是什么？\n与金钱绑定的一种木材，注定了她会给人类带来财富，当我可以使用金钱来奴役别人时，金钱不再是一般等价物，而是一种凌驾于身上奴役人的力量。牧盛发现死去的实体与活着的尸体在被桃花源的涌泉浸泡后会变成一颗又一颗树苗，而且树苗长大后会在树底下凝结出一种叫血玉的物体，而这种血玉就是制造那个时代货币的原材料。\n2.文中牧盛为什么要将人变成血木？\n为了获得更多的权利，为了改变那个时代。\n3.文中所处的时代是以哪一个朝代为历史背景的？\n秦朝末年\n4.文中人们的经济基础怎么样？\n农耕女纸，自给自足；\n5.穷极祖为什么人为桃花源能给别人快乐\n人们不再需要货币进行物质交换。\n6.这个故事的结局是什么？\n牧盛被处死，主人公逃离了桃花源。\n时间 事件 备注 丁亥年（项元帝3年） 年19岁的林太极（穷极祖）寻得桃花林 项元帝5年 牧盛来到了桃花林并发现了木尸的源头。\n同年为继承家业牧府明争暗斗，一场浩劫即将来临。 项元帝7年 牧府被抄家，牧盛躲过一劫来到了与桃花源接壤的月牙沟，为了推翻项王朝开始收兵买马。 项元帝10年 牧盛开始暗地修筑宫殿，在月牙沟建立起自己的政权，战争一触即发 项元帝13年 牧盛大败项王朝于朔阳，同年项元帝驾崩，项郢即位，然而实际掌权的却是牧盛将领魏相王。\n同年12月，王肖穿越来到了乌鸡山，加入了准备发动起义的郭康阵营。 项灵帝1年（庚子年） 郭康起义军与牧盛君发生冲突，王肖巧妙化解，\n同年6月王肖离开起义军，在途中与登须被捕发配到月牙沟充当劳工，\n同年7月中旬在月牙沟遇到了同样被抓的覃武，第二天，掌管劳工的司空英举行了一年一度的桃林总管竞选，在登须的帮助下，王肖成功杀入阵营，夺得总管职位； 项灵帝1年（庚子年） （本来七月就出发的因为穷极祖有客，牧盛便将行程往后了一个月）八月中旬，王肖大伤初愈不久，前往桃花源的行程便开始了，在前往的途中，有许多人想着逃走，但都被抓了回来，而且被处死了。\n九月初，王肖等人抵达了桃花林受到了当地的欢迎，来前司空英曾说，送人到就可以返回不必停留，不想在这遇到了牧盛的女儿寜儿（牧寜），发生了一些事，于是耽搁了几日，在这几天王肖渐渐发现了木尸的来历。 时间 事件 备注 乌鸡山神庙 --- title: 故事顺序 --- graph LR; A[ ] --\u003e|Link text| B(Round edge) B --\u003e C{\u003cstrong\u003eDecision\u003c/strong\u003e} C --\u003e|One| D[Result one] C --\u003e|Two| E[Result two] mindmap root((niha)) ni nikldl dsask daj dfv fas sds ",
    "description": "",
    "tags": [
      "校园",
      "爱情"
    ],
    "title": "人物关系",
    "uri": "/textbook/%E4%BA%BA%E7%89%A9%E5%85%B3%E7%B3%BB/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 校园",
    "uri": "/tags/%E6%A0%A1%E5%9B%AD/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 软件",
    "uri": "/tags/%E8%BD%AF%E4%BB%B6/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 12.实战项目 \u003e 贺青工程",
    "content": "设计一款可以参加志愿活动的小程序，其制作流程大致如下：\n需求分析与规划 确定目标用户群体及其需求：考虑志愿者、活动组织者和管理员等不同角色的功能需求。\n志愿者：\n注册/登录：志愿者可以通过手机号、邮箱或第三方账号进行注册和登录。 个人中心：查看并编辑个人信息，包括姓名、联系方式、服务时长、参与过的活动记录等。 活动浏览：查看活动列表，搜索感兴趣的服务项目，支持按地区、时间、类型筛选。 活动报名：选择感兴趣的志愿活动进行报名，填写相关报名表单，并能收到报名成功或失败的反馈信息。 签到打卡：参加活动时通过GPS定位、二维码扫描等方式进行签到和签退，记录服务时长。 互动交流：可在活动详情页留言评论，与其他志愿者交流心得，也可以对已完成的活动进行评价。 积分系统：根据参与活动的情况获取积分，可用于兑换礼品或其他激励。 活动组织者：\n活动发布：创建新的志愿活动，填写活动名称、地点、时间、内容描述、所需志愿者数量、技能要求等详细信息。 活动管理：查看已发布的活动状态，审核志愿者报名申请，确认志愿者名单，发送通知消息给志愿者。 数据统计：查看各项活动的报名人数、实际参与人数、总服务时长等统计数据。 评价反馈：查阅志愿者对活动的评价和建议，以便改进后续活动组织。 资源管理：上传活动相关的文档、图片等资源，管理活动物料。 管理员：\n用户管理：审核志愿者注册信息，处理用户投诉与咨询，维护用户账户安全。 权限管理：分配不同的角色权限，如设置哪些用户可以发布活动、审核报名等。 活动审批：对于某些大型或重要的活动，可能需要经过管理员审核后才能正式发布上线。 系统配置：设置全局参数，如积分规则、活动类别等基础数据的增删改查。 数据分析：获取平台整体运营数据，分析用户行为、活跃度以及志愿服务的整体状况，为决策提供依据。 功能列表梳理 活动浏览、报名参与、签到打卡、服务时长记录、通知公告、评价反馈、积分兑换等功能模块。 数据结构设计：定义数据库表结构，包括但不限于用户信息、活动信息、报名记录等。 原型设计与UI/UX设计 创建低保真或高保真原型，展示小程序的主要界面布局及交互流程。 设计符合用户体验的UI界面，确保简洁易用且美观大方。 技术选型与开发环境搭建 根据团队技术栈选择合适的开发平台，如微信小程序、支付宝小程序、百度小程序等。 搭建开发环境，安装所需的IDE工具（如微信开发者工具）及相关依赖库。 后端服务器开发 设计并实现后端API接口，处理用户的注册登录、活动发布与管理、报名审核等操作。 开发数据库系统，用于存储用户信息、活动数据等内容。 前端小程序开发 根据原型图编写前端页面代码，使用各小程序平台提供的组件和API进行功能开发。 实现用户认证、活动详情展示、报名表单提交、状态更新等功能。 测试与优化 单元测试：对各个功能模块进行独立测试，确保逻辑正确无误。 集成测试：模拟真实场景，测试整个应用的完整流程是否顺畅。 性能测试：检查在大量并发请求下系统的响应速度和稳定性。 用户体验测试：邀请部分目标用户试用，并根据反馈进行迭代优化。 上线部署与版本管理 将完成开发和测试的小程序上传至对应平台进行审核发布。 制定版本更新策略，持续收集用户反馈，定期更新优化软件。 后期维护与运营 定期检查系统性能，及时修复已知问题和潜在隐患。 对接新的需求，不断丰富和完善产品功能。 进行数据分析，了解用户行为，以数据驱动产品迭代优化。 自我异化的解释\n类力量：\n肉体存在于感性存在 随地大小便是前者，上公厕表示后者\n资本主义的三大作用 推动世界史的形成， 为人类的全面发展准备物质资料\n人是人感性活动的产物，人类与自然界打交道 人的类存在基础是感性存在 感性的存在就是把自然的东西变成人的东西，就是变成社会的存在，就像美，美的感觉的\n人不仅是感性的对象，还是感性的活动的产物 附件 ",
    "description": "",
    "tags": [
      "软件",
      "微信"
    ],
    "title": "志愿活动软件设计与开发",
    "uri": "/branch-bundle-1/12.%E5%AE%9E%E6%88%98%E9%A1%B9%E7%9B%AE/%E8%B4%BA%E9%9D%92%E5%B7%A5%E7%A8%8B/%E5%B0%8F%E7%A8%8B%E5%BA%8Fui%E8%AE%BE%E8%AE%A1/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 12.实战项目 \u003e 贺青工程",
    "content": "页面美化验收 1.登录页面 2.首页—将志愿活动和活动时长数据放到轮播图下面 3.我的页面优化了吗？ 4.点击找回密码后，页面颜色不够美观，该页面应符合小程序主色调 5.首页—-为你推荐的志愿活动适当放大活动名称字体，调整活动名称下面的显示信息，请适当调整字体大小、行距、间距。 6.贺院学子一直在行动调整这个模块数字、志愿活动、志愿者等字段的字体大小，现在看起来感觉数字和文字很随意，请适当调整。 7.让“无权限”字段直接显示在页面上，字体背景设置为透明，而不是像现在这样看起来像一个按键。 8.我的组织页面中，显示的组织之间间距太近，请适当调整。 小程序功能验收 1.不同的登录方式有问题吗？ 2.签到开始时间为活动开始前半小时，（现在是没到签到时间不可以签到，精确度很高） 3.活动结束后不能进行签退，但是活动发起者可以对其进行补签，补签时长可以自定，自定义时长不能超过该志愿者从开始签到至活动结束的时长。 4.服务时长为签到签退时间差吗？ 5.签到签退需要在活动地点三公里以内才能进行。 6.活动发起者发布活动后或得四位数数字密码，该密码在志愿者点击签到或签退时弹出小弹窗，输入密码后实现签到签退。 7.当成员加入活动时，活动发起者能够一键通过成员的审核 8.发现页面上方，将日期和距离归纳在一个板块“排序” 9.当我登录后点击返回，返回到的页面是上一次的登录页面，需要一步一步返回，请设置为登陆成功后直接跳转到我的页面。 10. 11. 附件 ",
    "description": "",
    "tags": [
      "软件",
      "微信"
    ],
    "title": "验收问题",
    "uri": "/branch-bundle-1/12.%E5%AE%9E%E6%88%98%E9%A1%B9%E7%9B%AE/%E8%B4%BA%E9%9D%92%E5%B7%A5%E7%A8%8B/%E9%AA%8C%E6%94%B6%E6%96%B9%E6%A1%88/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: F1-复习资料",
    "uri": "/categories/f1-%E5%A4%8D%E4%B9%A0%E8%B5%84%E6%96%99/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 9.操作系统",
    "content": "认识Linux 安装Linux 图形界面与命令行 文件管理与常用命令 文件/目录的打包和压缩 gzip压缩文件和gunzip、zcat压缩文件命令 一般压缩解压文件： ​ 命令 gzip [文件名]\rgunzip [解压文件名] 例子：\n[root@localhost stdio]# ls\r1.c 2.c 3.c hello.txt\r[root@localhost stdio]# gzip hello.txt\r[root@localhost stdio]# ls\r1.c 2.c 3.c hello.txt.gz\r[root@localhost stdio]# gunzip hello.txt.gz [root@localhost stdio]# ls\r1.c 2.c 3.c hello.txt\r[root@localhost stdio]# 如果不想删除源文件要怎么做呢？使用如下命令： ​ 命令 gzip -c [文件名] \u003e [压缩文件名.gz]\rzcat [解压文件名.gz] \u003e[压缩文件名.gz] 例子：\n[root@localhost stdio]# ls\r1.c 2.c 3.c hello.txt\r[root@localhost stdio]# gzip -c hello.txt \u003ehello.txt.gz\r[root@localhost stdio]# ls\r1.c 2.c 3.c hello.txt hello.txt.gz\r[root@localhost stdio]# zcat hello.txt.gz \u003ehe.txt\r[root@localhost stdio]# ls\r1.c 2.c 3.c hello.txt hello.txt.gz he.txt\r[root@localhost stdio]# 在上面的命令中，zcat [解压文件名.gz] \u003e[压缩文件名.gz] 与 gunzip -c [解压文件名.gz] \u003e[压缩文件名.gz] 作用一样，另外，zcat [文件名]会将文件压缩信息输出在窗口上，即输出在 std。\nbzip2压缩文件和bunzip2压缩文件命令 一般压缩解压文件： ​ 命令 bzip2 [文件名]\rbunzip2 [解压文件名]\r//压缩解压后不会删除原文件\rbzip2 -k [文件名]\rbunzip2 -k [解压文件名] 例子：\n[root@localhost stdio]# ls\r1.c 2.c 3.c hello.txt\r[root@localhost stdio]# bzip2 hello.txt [root@localhost stdio]# ls\r1.c 2.c 3.c hello.txt.bz2\r[root@localhost stdio]# bunzip2 hello.txt.bz2 [root@localhost stdio]# ls\r1.c 2.c 3.c hello.txt\r[root@localhost stdio]# bzip2 -k hello.txt [root@localhost stdio]# ls\r1.c 2.c 3.c hello.txt hello.txt.bz2\r[root@localhost stdio]# rm hello.txt\rrm：是否删除普通文件 \"hello.txt\"？y\r[root@localhost stdio]# ls\r1.c 2.c 3.c hello.txt.bz2\r[root@localhost stdio]# bunzip2 -k hello.txt.bz2\r[root@localhost stdio]# ls\r1.c 2.c 3.c hello.txt hello.txt.bz2\r[root@localhost stdio]# tar归档文件命令 ​ 命令 在Linux系统中，tar 是一个非常重要的归档工具，用于将一组文件和目录打包到一个单一的.tar文件中。它创建的这种归档文件并不进行压缩，仅仅是将多个文件集合在一起，并保持原始文件的权限、所有权和其他元数据信息。\ntar -cvf [文件名]\rtar -xvf [解压文件名]然而，为了减少存储空间占用以及在网络上传输时加快速度，通常会结合使用 tar 和压缩工具（如gzip或bzip2）对归档文件进行压缩。这里 -z 或 -j 参数的作用就是启用压缩功能\ntar -czvf [文件名]\rtar -xzvf [解压文件名]\rtar -cjvf [文件名]\rtar -xjvf [解压文件名]如果要选择性的归档或压缩、解压某个文件或目录，那么需要加 w，如下：\ntar -cwzvf [文件名]\rtar -xwzvf [解压文件名]\rtar -cwjvf [文件名]\rtar -xwjvf [解压文件名] 在命令中;\nc（create）：表示创建新备份 z（gzip或gunzip）:表示使用gzip指令处理文件 v（verbose）：显示指令执行过程 f（file）:指定备份文件 w(interactive):对每一步都进行确认 j:表示使用bzip2、bunzip2指令进行压缩解压 如果加选项 -C （directory），则说明转到指定的目录，命令如下：\n[root@localhost ~]# tar -cjvf stdio.tar stdio/\rstdio/\rstdio/1.c\r[root@localhost ~]# tar -xjvf stdio.tar -C st/\rstdio/\rstdio/1.c\r[root@localhost ~]# cd st/\r[root@localhost st]# ls\rstdio\r[root@localhost st]# ls stdio/\r1.c\r[root@localhost st]# 用户与用户组管理 用户与组文件 用户文件-passwd 存放用户登录用户信息的文件位置：/etc/passwd 文件中域的的格式：\nusername:passwd:uid:gid:userinfo:home:shell:\n例子：\n[root@localhost st]# tail -1 /etc/passwd daliu:x:1008:1006::/home/daliu:/bin/bash\n/etc/passwdw 文件中域的含义\n域 含义 username 用户名 password 登录密码（一般显示的是密码转换后的乱码） uid 用户ID（0-99一般为系统保留） gid 用户组ID userinfo 用户信息 home 分配该用户的主目录（但位置是人为决定的，自己可以修改） shell 登录后启动的shell 一般root用户的UID为0，UID一般是唯一的为的是区分不同的用户，但UID为0的除外，UID为0则说明为超级用户；\n创建用户时，系统会分配一个主目录给用户一般在 home 目录下，例如用户user主目录为 /home/user。\n用户文件-shadow Linux系统中的/etc/shadow文件是存放用户密码信息的重要安全文件，也称为“影子口令文件”。它的主要作用是存储用户的加密密码以及与密码相关的属性，以增强系统的安全性。\n在早期的Unix/Linux系统中，密码是以明文或简单加密的形式存储在/etc/passwd文件中。为了提高系统的安全性，从1970年代末期开始引入了影子口令的概念，将密码字段从/etc/passwd移出，并存放在只有超级用户（root）可以读取的/etc/shadow文件中，而原来的 /etc/passwd 中的密码字段显示 x ,这就是上面的例子中显示x的原因。\n通过这种方式，即使攻击者获取了/etc/shadow文件，由于密码已经被高度加密，直接破解难度大大增加，从而有效提高了系统的密码安全级别。同时，通过对密码策略的设定，还可以实现对用户密码复杂度和有效期的管理。\n域 含义 username password min max warm inactive expire flag 下面就举个例子：\n[root@localhost st]# tail -1 /etc/passwd daliu:x:1008:1006::/home/daliu:/bin/bash\n[root@localhost st]# tail -1 /etc/shadow daliu:$6$f703Izgm$gIA74I6Vyqdjstz3BazhvEUVWfSyelNuv7UKTUtB3cScauSctebqrBIr/KShHnBcWWQideao3aucMrXsO.I6Z/:19694:0:99999:7:::\n用户组文件-group 用户组一方面是为了查找用户时更方便，比如查找user用户，你不需要去passwd文件一行一行的查找，你只需要去group文件找到对应的用户组即可。\n同样的，用户组也有类似passwd、shadow之和这样的文件，分别为group、gshadow.\n/etc/group 文件中域的含义如下：\n域 含义 group_name 组用户名 group_password 加密后的用户组口令 group_id 用户组ID group_members 以逗号隔开的用户清单 /etc/gshadow 文件中域的含义如下：\n域 含义 group_name 组用户名 group_password 加密后的用户组口令 group_members 以逗号隔开的用户清单 检验用户与用户组文件之间是否正确 检验 /etc/passwd 与 /etc/shadow 文件之间的正确性，使用命令 pwck,当发生错误，两个文件之间信息不对应时，系统会提示对相应项进行修改； 检验 /etc/group 与 /etc/gshadow 文件之间的正确性，使用命令 grpck,当发生错误，两个文件之间信息不对应时，系统会提示对相应项进行修改。 相关的命令操作 1.添加用户与用户组———— useradd \u0026 groupadd\n用法：\nuseradd [选项] 登录 useradd -D useradd -D [选项] 值得注意的是，对于选项的-d、-md，加了m表示在/home目录创建用户目录，如果不加，表示该目录已存在不需要再使用m,详细请结合下面的展开内容来开。 展开 选项：\r-b, --base-dir BASE_DIR\t新账户的主目录的基目录\r-c, --comment COMMENT 新账户的 GECOS 字段\r-d, --home-dir HOME_DIR 新账户的主目录\r-D, --defaults\t显示或更改默认的 useradd 配置\r-e, --expiredate EXPIRE_DATE 新账户的过期日期\r-f, --inactive INACTIVE 新账户的密码不活动期\r-g, --gid GROUP\t新账户主组的名称或 ID\r-G, --groups GROUPS\t新账户的附加组列表\r-h, --help 显示此帮助信息并推出\r-k, --skel SKEL_DIR\t使用此目录作为骨架目录\r-K, --key KEY=VALUE 不使用 /etc/login.defs 中的默认值\r-l, --no-log-init\t不要将此用户添加到最近登录和登录失败数据库\r-m, --create-home\t创建用户的主目录\r-M, --no-create-home\t不创建用户的主目录\r-N, --no-user-group\t不创建同名的组\r-o, --non-unique\t允许使用重复的 UID 创建用户\r-p, --password PASSWORD\t加密后的新账户密码\r-r, --system 创建一个系统账户\r-R, --root CHROOT_DIR chroot 到的目录\r-s, --shell SHELL\t新账户的登录 shell\r-u, --uid UID\t新账户的用户 ID\r-U, --user-group\t创建与用户同名的组\r-Z, --selinux-user SEUSER\t为 SELinux 用户映射使用指定 SEUSER\r用法： groupadd [选项] [组名] ，一般会用到的选项有\n-g: 用户设置组ID； -o: 与-g配合使用，设置不唯一的组ID; -n: 修改组的名字，如：gpasswd -n [新组名] [旧组名] 2.删除用户与用户组———— userdel \u0026 groupdel\nuserdel:一般用法就是在后面加要删除的用户，如果加选项-r则会删除主目录文件； groupdel：在后面加要删除的用户组 3.修改用户与用户组———— usermod 、passwd \u0026 gpasswd\nusermod： 一般就是对问文件中的域进行修改，会加加上选项-u、-g、-s等，最后还得指定用户，用法： usermod [选项] [用户名]。另外，-L（-U） 的作用是对用户的锁定（解锁）； passwd：一般就是用来修改用户的密码，在登录的是root用户情况下passwd是要指定修改密码的用户的，而如果登录的是用户本身，使用passwd时就不用指定在； gpasswd： 用法： gpasswd [选项] [组名] ，一般会用到的选项有 -a(添加组的用户)， -d(删除组里的用户)，gpasswd -d [用户名] [组名] -A(添加组的管理员). -g(修改组GID),例如：gpasswd -g [新ID] [组名] 对于usermod的进一步说明，除了上面提到的选项，还有如下选项：\n展开 选项：\r-c, --comment 注释 GECOS 字段的新值\r-d, --home HOME_DIR 用户的新主目录\r-e, --expiredate EXPIRE_DATE 设定帐户过期的日期为 EXPIRE_DATE\r-f, --inactive INACTIVE 过期 INACTIVE 天数后，设定密码为失效状态\r-g, --gid GROUP 强制使用 GROUP 为新主组\r-G, --groups GROUPS 新的附加组列表 GROUPS\r-a, --append GROUP 将用户追加至上边 -G 中提到的附加组中，\r并不从其它组中删除此用户\r-h, --help 显示此帮助信息并推出\r-l, --login LOGIN 新的登录名称\r-L, --lock 锁定用户帐号\r-m, --move-home 将家目录内容移至新位置 (仅于 -d 一起使用)\r-o, --non-unique 允许使用重复的(非唯一的) UID\r-p, --password PASSWORD 将加密过的密码 (PASSWORD) 设为新密码\r-R, --root CHROOT_DIR chroot 到的目录\r-s, --shell SHELL 该用户帐号的新登录 shell\r-u, --uid UID 用户帐号的新 UID\r-U, --unlock 解锁用户帐号\r-Z, --selinux-user SEUSER 用户账户的新 SELinux 用户映射 3.登录用户与用户组———— su newgrp\nroot用户与普通用户之间的切换使用su,如果要切换根目录则需要在su 后加-，即： su - [用户]。\n在Linux中，组的登录使用 newgrp ，即 newgrp [组名]。\n下面通过一个例子加以理解：\n添加一个用户名为15user，且该用户在用户组15group中，设置用户组和用户密码为123，创建一个用户15user2让该用户为用户组管理员,修改user的UID为2024，最后删除所用所建信息。\n展开 [root@localhost ~]# groupadd 15group\r[root@localhost ~]# useradd -g 15group 15user\r[root@localhost ~]# tail -1 /etc/passwd\r15user:x:1001:1007::/home/15user:/bin/bash\r[root@localhost ~]# tail -1 /etc/group\r15group:x:1007:\r[root@localhost ~]# gpasswd 15group\r正在修改 15group 组的密码\r新密码：\r请重新输入新密码：\r[root@localhost ~]# passwd 15user\r更改用户 15user 的密码 。\r新的 密码：\r无效的密码： 密码少于 8 个字符\r重新输入新的 密码：\rpasswd：所有的身份验证令牌已经成功更新。\r[root@localhost ~]# useradd 15user2\r[root@localhost ~]# gpasswd -A 15user2 15group\r[root@localhost ~]# tail -2 /etc/group\r15group:x:1007:\r15user2:x:1002:\r[root@localhost ~]# tail -2 /etc/gshadow\r15group:$6$d4pzl/CPrp$3NYvX8gzE3DBm35BLqAE8aGzfUhrUZTSMGQfeRve2iUhrH1tZGR8I8t91gWzFD2GWFEDaaocO7XO85RjKDY.q1:15user2:\r15user2:!::\r[root@localhost ~]# usermod -u 2024 15user\r[root@localhost ~]# tail -2 /etc/passwd\r15user:x:2024:1007::/home/15user:/bin/bash\r15user2:x:1002:1002::/home/15user2:/bin/bash\r[root@localhost ~]# userdel 15user\r[root@localhost ~]# groupdel 15group\r[root@localhost ~]# userdel 15user2 在上面的例子中，我们使用gpasswd -A来设置用户组管理员。\n文件目录和目录权限管理 文件访问权限与用户分类 文件的访问权限 读(r)：允许读文件的内容 写(w)：允许向文件中写入数据 执行(x)：允许将文件作为程序执行 目录的访问权限 读(r)：允许查看目录中有哪些文件和目录； 写(w)：允许该在目录下创建（或删除）文件、目录，修改文件名字或者目录名字 执行(x)：允许访问目录(用 cd 命令进入该目录，并查看目录中可读文件的内容) 用户分类 文件所有者（owner）：建立文件、目录的用户。 同组用户(group)：属于同一组群的用户对属于该组群的文件有相同的访问权限。 其他用户(other)：除了文件所有者、同组用户的其他用户。 我们先用ls -l 查看文件的权限信息：\n在上面的开头有三段他们分别表示为文件所有者、同组用户、其他用户：\n其中的d表示目录。\n权限修改 访问权限的表示 （1）字母表示法（如：rwxr-xr-x） （2）数字表示法 （如：755） 使用数字进行文件权限的划分，其中r=4、w=2、x=1、-=0，这样rwx这组权限就是4+2+1=7，r-x这组权限就是5。\n修改权限的命令：chmod 命令格式1： chmod $n{_1}n{_2}n{_3}$ \u003c文件|目录\u003e 功能：为指定文件或目录修改给定的数值访问权限。 选项： $n{_1}n{_2}n{_3}$三位数字表示的文件访问权限。 命令格式2： chmod [用户标识] [设定方法] [权限字符] \u003c文件名或目录名〉 功能：修改文件或目录的访问权限。 选项： （1）用户标识：所有者（u）、同组（g）、其他人（o）、所有的人员（a） （2）设定方法：+ 增加权限、- 删除权限、= 分配权限，同时删除旧的权限 （3）权限字符：r（读）、w（写）、x（执行）、u（和所有者的权限相同）、g（和所同组用户的权限相同）、o（和其他用户的权限相同） 修改文件所有者的命令：chown 格式：chown [-R] \u003c用户[：组]\u003e \u003c文件或目录\u003e 功能：更改属主和组。 选项： -R：对目录及其子目录进行递归设置。 例如：chown sjh：sjh result.txt\n修改文件所属组群的命令：chgrp 格式：chgrp group file\n其中group：组名或组代号\n功能： 改变文件或目录组群\n例如：chgrp user result.txt\n关于chown与chgrp的命令的例子：\n展开 [root@localhost ~]# chown user2:user2 /tmp/test/user1_2.txt\r[root@localhost ~]# ls -l /tmp/test/\r总用量 0\r-rw-rw-r--. 1 user2 user2 0 1月 15 19:40 user1_2.txt\r[root@localhost ~]# chgrp root /tmp/test/user1_2.txt\r[root@localhost ~]# ls -l /tmp/test/\r总用量 0\r-rw-rw-r--. 1 user2 root 0 1月 15 19:40 user1_2.txt\r[root@localhost ~]# 修改默认权限的命令：umask 格式：umask [mask]\n功能：设置文件或目录的默认权限\n注意：系统默认屏蔽的权限为022（umask的默认值为0022），因此新 创建的目录权限就为777-022=755，用字符表示就是rwxr-xr-x，新创 建的普通文件权限为666-022=644，即rw–r–r–。\n文件隐藏属性 1）查看文件隐藏属性：lsattr\n2）修改文件隐藏属性：chattr\nchattr [+-=] [ ai] 文件或目录名称\na: 当设置a之后，这个文件将只能增加数据，而不能删除也不能修改数据， 必须要为root才能设置这个属性。 i：不能删除，不能修改，不能改名。必须要为root才能设置这个属性。 文件特殊权限 文件特殊权限有以下三种：\n1）SUID：Set UID（只对二进制程序有效，对shell script无效）\n例如：ll /usr/bin/passwd\n注意：当用户执行passwd命令的时候，需要修改/etc/shadow文件，而该文件普通用户并没有任何权限。\n2）SGID：Set GID\n例如：ll /usr/bin/locate 注意：当用户执行locate命令的时候，需要读取/var/lib/mlocate/mlocate.db文件。\n3）SBIT：Sticky Bit （只对目录有效）\n设置方法：\nchmod -o+t [指定目录名]\r或者\rchmod 1777 [指定目录名]对一个目录进行如上设置以后，假设有用户A和B，用户A在该目录下创建的文件只有他自己的root用户可以删，像B这样的其他用户删不了。\n特殊文件说明文章链接\n软件包管理 接下里介绍两个软件安装的工具，分别是RPM：Red Hat Package Manager（Red Hat软件包管，以及YUM:Yellow dog Dpdater,Modified.\nRPM工具不需要网络，需要提前准备好安装包，但是他也有缺点安装的时候如果缺少依赖包你还需要再安装依赖包；\n而YUM工具需要再有网的状态下才可以下载，它免去了依赖包提醒，自动将依赖包下载好，较为方便，我跟推荐使用YUM。\nRPM工具的使用 1．安装软件包（install）\nrpm -ivh rpm软件包全名：\ni：安装一个新的软件包 v：显示详细信息 h：显示安装进度条理工具 2．查询已安装的软件包（query）\nrpm –qa //查询出本机所有已经安装的软件\rrpm –q httpd //查询httpd软件包是否已经安装\rrpm -q【i l c d R】 vsftpd\rrpm -qf /etc/inittab\r查询未安装的软件包：\rrpm -qp 【i l c d R】 gconf-editor-2.28.0-3.el6.i686.rpm3．升级与更新（upgrade/freshen）\nrpm -Uvh 软件包名称\r//原来没有安装过的，直接安装；如果已安装过，则更新至新版\rrpm -Fvh 软件包名称\r//原来没有安装过的，不安装；如果已安装过，则更新至新版4．卸载RPM包（erase）\nrpm -e vsftpd\r注意：卸载时只需要给出软件包名称vsftpd，而不需要给出软件包的全部名称信息vsftpd-2.2.2-6.el6.i686.rpm。YUM工具的使用 yum在线升级机制：\n安装软件 yum install gcc 删除软件 yum remove gcc 查询软件 yum search gcc 软件包管理：\n举例一：搜寻与磁盘阵列(raid)相关的软件有哪些？ [root@www ~]# yum search raid 举例二：找出mdadm这个软件的功能为何？ [root@www ~]# yum info mdadm 举例三：列出yum 服务器上面提供的所有软件名称。 [root@www ~]# yum list 举例四：列出目前服务器上可供本机进行升级的软件有哪些？ [root@www ~]# yum list updates 举例五：列出提供passwd这个文件的软件有哪些？ [root@www ~]# yum provides passwd yum的软件组功能：\n查询软件组：yum grouplist（查阅目前容器与本机上面的可用与安装过 的软件群组有哪些？） yum groupinfo Eclipse（查询Eclipse软件组的相关信息）\n安装软件组： yum groupinstall Eclipse 删除软件组： yum groupremove Eclipse 硬盘分区及格式化 硬盘分区介绍 硬盘的分区分为主磁盘分区和扩展磁盘分区。 一个硬盘最多可以划分为 4 个主磁盘分区，这时不能再创建扩展分区。 一个硬盘中最多只能创建 1个扩展分区 ，扩展分区不能直接使用，必须在扩展分区中再划分出逻辑分区才可以使用。 逻辑分区是从5开始的，每多1个分区，数字加1就可以。 硬盘标识 （1）IDE硬盘：hd[a-d]*\nhd表示硬盘类型为IDE，中括号中的字母为a、b、c、d中的一个，a是基本盘，b是从盘，是辅助主盘，d是辅助从盘，*指分区，即主分区和扩展分区。\n例如：hda1代表第一块IDE硬盘上的第一个分区。hdb5代表第二块IDE硬盘的第一个逻辑分区。\n（2）SCSI/SATA硬盘：sd[a-p]*\nsd表示SCSI/SATA硬盘。SCSI/SATA的引导盘使用设备文件/dev/sda1、/dev/sda2、/dev/sda3、/dev/sda4作为主分区或者扩展分区，而以/dev/sda5，/dev/sda6等作为逻辑分区。\n创建硬盘分区 先使用ls -l /dev |grep ‘sd’查看文件里是否有可用的磁盘，如果没有需要创建一个磁盘，创建步骤：\n1．通过虚拟机设置增加一块SCSI硬盘，大小为5G，重启系统。 展开 按照下图点击下一步\n根据实际情况输入所需硬盘大小，这里输入5GB\n然后点击完成\n最后在命令窗口输入reboot重启。\n2．将该硬盘分为2个主分区（每个主分区的大小为1G），1个扩展分区（大小为3G），将第2个主分区制作成swap分区。\n命令： 展开 //先用命令查看sd,sd表示SCSI/SATA硬盘， ls /dev/sd |grep sd //硬盘分区 fdisk /dev/sdb //使用m查看帮助命令，n为新建命令，d为删除命令，w为写入命令，每次配完都要写入才有效。 n p //这是新建主分区的意思 //接着指定分区起始位置，一般我们默认，所以回车就可以 //然后就是指定分区的大小，这里我设置1G、 +1G //可以用p命令查看设置的情况 P //按照上面的流程进行其他的设置，一下给出步骤命令 n p +1G n e +3G 3．将扩展分区划出2个逻辑分区（大小分别为1G、2G）。\n命令： 展开 //到这步后我们可以给扩展分区分配逻辑分区，分配时逻辑分区用l命令。 n l +1G n l +2G 查看磁盘情况与磁盘格式化 （1）查看系统中的新硬盘：ls /dev/sd* （2）查看分区：fdisk –l /dev/sda （3）创建主分区：fdisk /dev/sdc （4）创建扩展分区：输入n,再输入e （5）创建逻辑分区: 输入n,再输入l （6）修改分区类型 （7）格式化分区： mkfs –t ext4 /dev/sdc1 还可以写成**mkfs.ext4 /dev/sdc1** 格式化交换分区略有不同，使用命令 mkswap ,例如： mkswap dev/sdb2 （8）磁盘检查命令：fsck –t ext4 /dev/sdc1 badblocks /dev/sdb5 （9）查看磁盘使用情况 df,或使用df -h输出更易于查看。 上面的-t意思是参数TYPE的意思，后面接ext4()、vfat(FAT32)、ntfs()等，\n挂载文件系统：mount 1、 挂载硬盘分区： 步骤1：mkdir /usr/music 步骤2：mount /dev/sdc5 /usr/music 2、 挂载光驱： 步骤1：mkdir /mnt/cdrom 步骤2：mount /dev/cdrom /mnt/cdrom 3、 挂载U盘： 步骤1：mkdir /mnt/usb 步骤2：mount /dev/sdd1 /mnt/usb 4、 挂载Windows下的C盘 （FAT32格式）： 步骤1：mkdir /mnt/dosc 步骤2：mount -t vfat /dev/sda1 /mnt/dos 注意： C盘必须已经被格式化为FAT32格式。\n显示系统内所有已经挂载的文件系统 mount 不带任何参数执行mount命令，则会显示当前系统中已经挂载的所有的文件系统列表。\n卸载设备：umount 格式： umount \u003c设备名或挂载点\u003e\n说明：卸载指定的设备，既可以使用设备名也可以使用挂载点。\n举例： # umount /dev/cdrom\n自动挂载文件系统：/etc/fstab 每条记录由6个字段组成。\n1.设备名称 2.设备挂载点 3.文件系统类型 4.挂载选项 5.是否备份 6.自检顺序\n如果想要系统自动挂载/dev/sdc5分区，可在/etc/fstab文件添加下面这行：\n/dev/sdc5 /usr/music ext4 defaults 0 0\n注意:由于fstab文件非常重要，如果这个文件有错误，就可能会造成系统不能正常启动。因此向fstab文件中添加数据时应非常小心。修改完该文件后务必使用mount -a命令测试有没有错误。\n磁盘配额 以sdb1为例\n第一步：先配置sdb磁盘，然后挂载sdb1磁盘\n第二步：使用quotaon /sdb1/生成aquota.group和aquota.user文件\n第三步：对用户或用户组进行磁盘限制,例如：edquota -u user1，然后会进入一个文件，文件里的0表示禁用，在里面可以设置创建文件个数或文件大小的软限制、硬限制；\n第四步：我们登录user1，在/sdb/目录下创建文件，使用 db if=/dev/zero of=/sdb1/test/ bs=1k count=10这条命令进行测试，这是一个写文件大小的命令，这样可以快速测试文件大小的软限制和硬限制；\n第五步：子里面建文件，检验创建文件个数的软限制和硬限制；\n第六步: 可以使用repquota -u查看目录的情况；\n第七步：关闭磁盘匹配额，quotatoff /sdb1/\nLinux编程 附件 ",
    "description": "",
    "tags": [
      "软硬件"
    ],
    "title": "Linux期末复习",
    "uri": "/branch-bundle-1/9.%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F/linux%E6%9C%9F%E6%9C%AB%E5%A4%8D%E4%B9%A0/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 软硬件",
    "uri": "/tags/%E8%BD%AF%E7%A1%AC%E4%BB%B6/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 2.AndroidStudio",
    "content": "AndroidStudio简介 1.配置Android开发环境：\n安装JDK： （1）下载JDK （2）配置环境变量； 安装Android Studio； 安装SDK。 2.自动构建工具Gradle：\nGradle 是以 Groovy 语言为基础，面向Java应用为主，基于DSL（领域特定语言）语法的自动化构建工具。它可以自动化地进行软件构建、测试、发布、部署、软件打包，同时也可以完成项目相关功能，如生成静态网站、生成文档等。另外其集合了Ant的灵活性和强大功能，以及Maven的依赖管理和约定，从而创造了一个更有效的构建方式。凭借Groovy的DSL和创新打包方式，Gradle提供了一个可声明的方式，并在合理默认值的基础上描述所有类型的构建。Gradle目前已被选作许多开源项目的构建系统。\n3.Logcat日志输出工具：使用 Logcat 查看日志\nAndroid Studio 中的 Logcat 窗口会实时显示设备日志来帮助您调试应用，例如，使用 Log 类添加到应用的消息、在 Android 上运行的服务发出的消息或系统消息（例如在发生垃圾回收时）。如果应用抛出异常，Logcat 会显示一条消息，后跟相关联的堆栈轨迹，其中包含指向代码行的链接。\n4.Android Studio中 Make Project 、Clean Project 、Rebuild Project 的作用\nMake Project：编译Project下所有Module（组件或模块），一般是自上次编译后Project下有更新的文件，增量编译，不生成Apk。 Clean Project：删除之前编译后的编译文件。部分版本的AS会自动重新编译整个Project，不生成Apk。 Rebuild Project：先执行Clean操作，删除之前编译的编译文件和可执行文件，然后重新编译新的编译文件，不生成Apk 5.Run窗口：可以输出程序运行过程中出现的错误。 6.manifests文件夹（清单文件夹）：Android系统配置文件夹，包含一个AndroidManifest.xml文件（清单文件），可在此文件注册声明\n\u003cactivity\u003e页面、 \u003cservice\u003e服务、 \u003creceiver\u003e接收器、 \u003cprovider\u003e提供者或提供程序、 \u003cuses-permission\u003e使用权限等； 7.java文件夹：存放Java代码的文件夹，新建项目时默认生成了三个文件夹，com.first.project文件夹用来存放Java文件，这里包含一个名为MainActivity的Java文件，是新建项目时默认生成的。 第二个和第三个文件为测试代码文件夹，不是十分常用。\nres文件夹：存放Android项目的资源文件，包含四个文件夹： drawable（图片资源文件夹）、 layout（布局资源文件夹）、 mipmap（图片资源文件夹，存放项目图标）、 values（存放数值资源文件）， 此外有menu文件（菜单资源文件）。 8.Android系统体系结构四层，从上到下分别是\n应用程序层 应用程序框架层 系统运行库层 Linux内核层 每一层都是用其下面各层所提供的服务。 应用程序层\nAndroid平台包含了许多核心的应用程序，诸如Email客户端、SMS短消息程序、日历、地图、浏览器、联系人等应用程序。这些应用程序都是用Java语言编写的。开发人员可以灵活地根据需求替换这些自带的应用程序或者开发新的应用程序。\n应用程序框架\n开发者可以完全访问核心应用程序所使用的API框架。该层简化了组件的复用，使得开发人员可以直接使用系统提供的组件来进行快速地开发，也可以通过继承灵活地加以拓展。这些东西包括：\n活动管理器（Activity Manager，管理各个应用程序的生命周期以及通常的导航回退功能） 视图系统（View System，构建应用程序的基本组件） 内容提供器（ContentProvider，使得不同的应用程序之间可以存取或者分享数据） 资源管理器（Resource Manager，提供应用程序使用的各种非代码资源，如本地化字符串、图片、布局文件等） 通知管理器（Notification Manager，使应用程序可以在状态栏中显示自定义的提示信息）等。\n系统运行库层\n包括系统库和Android Runtime，系统库是应用程序框架的支撑，是连接应用程序框架层与Linux内核层的重要纽带。程序在Android Runtime中执行，其运行时分为核心库和Dalvik虚拟机两部分。\nLinux内核层\nAndroid基于Linux2.6的内核，其核心系统服务如安全性、内存管理、进程管理、网络协议以及驱动模型都依赖于Linux内核，同时内核层也扮演了介于硬件层和软件栈之间的抽象层的角色。 Linux内核层和系统运行库层之间，从Linux操作系统的角度来看，是内核空间与用户空间的分界线，Linux层运行于内核空间，以上各层运行于用户空间。系统运行库层和应用框架层之间是本地代码层和Java代码层的接口。应用框架层和应用程序层是Android的系统API的接口，对于Android应用程序的开发，应用程序框架层以下的内容是不可见的，仅考虑系统API即可。\n9.四大核心组件有：activity（活动或页面）、service（服务）、broadcast receiver（广播接收器）、content provider（内容提供者）\n10.Activity介绍Android系统是通过任务栈来管理Activity的。当一个Activity启动时，会把Activity压入到堆栈中，当用户按返回键或者结束掉该Activity时，它会从堆栈中弹出。\n11.Android为我们定义了四种加载方式\nStandard 加载模式 ——标准模式/默认加载模式\n标准模式：系统默认的Activity启动模式，当Intent欲打开Activity时，在该Activity不存在，存在于栈顶和存在于栈底三种情况下都会正常创建Activity，并压入任务栈栈顶；\nSingleTop 加载模式 ——栈顶单例模式\n栈顶单例模式：当启动一个Activity时，只有当该activity存在任务栈中且为栈顶，Intent才会通过onNewIntent()方法传递给在栈顶Activity实例；其他情况则正常创建Activity并压入任务栈；\nSingleTask 加载模式 ——栈内单例模式\n站内单例模式：当启动一个Activity时，系统会先检查任务栈内是否有该Activity，如果该Activity不存在则正常创建Activity实例，如果存在且在栈底则会将它上面的Activity弹出并销毁，使该Activity置于栈顶再调用onNewIntent()方法；\nSingleInstence 加载模式 ——全局单例模式\n与SingleTask模式基本一样，只是在这个模式下Activity所处的任务栈中只能有Activity这一个实例，不能有其他的实例。\n12.Activity生命周期是指Activity从创建到销毁的过程，在这一过程中，Activity一般处于4种状态，即：Active/Running、Paused、Stop、Killed\n（1）Active/Running 此时Activity一定处于屏幕的最前端，用户完全可以看得到，并且可以与用户进行交互。对于Activity栈来说，它处于栈顶； （2）Paused 此时Activity在屏幕上仍然可见，但是它已经失去了焦点，用户不能与之进行交互。暂停状态的Activity是存活的，它仍然维持着其内部状态和信息，但是系统可能会在手机内存极低的情况下杀掉该Activity； （3）Stop 此时Activity在屏幕上完全不能被用户看见，也就是说这个Activity已经完全被其他Activity所遮住。处于停止状态的Activity，系统仍然保留有其内部状态和成员信息，但是它经常会由于手机系统内存被征用而被系统杀死回收； （4）Killed Activity被系统杀死回收或者未启动。\n13.为了能够让Android程序了解自身状态的变化，Android系统中具有很多事件回调函数，我们可以重载这些方法来实现自己的操作。Android生命周期的事件回调函数如下：\nvoid onCreate(Bundle savedInstanceState) void onStart() void onRestart() void onResume() void onPause() void onStop() void onDestroy()14.Activity生命周期\n15.Fragment必须是依存于Activity而存在，因此Activity的生命周期会直接影响到Fragment的生命周期。图在课本第50页。\n由图可以看到Fragment比Activity多了几个额外的生命周期回调函数：\nonAttach(Activity)：当Fragment与Activity发生关联时调用。从该方法开始，就可以通过Fragment.getActivity方法获取与Fragment关联的窗口对象了，但在该方法中仍然无法操作Fragment中的控件。 onCreateView(LayoutInflater, ViewGroup, Bundle)：创建该Fragment的视图。onActivityCreated(Bundle)：当Activity的onCreate方法返回时调用。\nonDestoryView():与onCreateView相对应，当该Fragment的视图被移除时调用。onDetach()：与onAttach相对应，当Fragment与Activity关联被取消时调用。\n16.在使用Intent进行Activity之间的跳转时，我们通常有三种Intent跳转方式，即：不带参数的跳转、带参数的跳转以及带返回值的跳转，代码实现可参考实验报告或书本。\n17.TextView常用的属性\nandroid:id=\"@+id/textView1\"表示该控件的id，在布局文件中或者代码中被引用 android:textStyle=\"bold\"表示TextView里面的字加粗显示 android:layout_height=\"wrap_content\"表示该控件的高度为其包含内容的高度 android:layout_width=\"wrap_content\"表示该控件的宽度为其包含内容的宽度 android:text=\"@string/signin\" 显示的内容，这里表示存放在string.xml文件中name=signin的文本 android:layout_height=\"40dip\"设置具体的高度 android:textColor=\"#7089c0\"设置文本的颜色 android:textSize=\"18sp\"设置文本的大小 android:gravity=\"center_vertical\"设置文本垂直居中 android:paddingLeft=\"5dip\"设置内边距 android:layout_marginTop=\"5dip\"设置外边距18.LinearLayout线性布局、\nRelativeLayout相对布局、 FrameLayout帧布局、 TableLayout表格布局、 AbsoluteLayout绝对布局 线性布局，是指该容器（LinearLayout）内子控件的摆放方式有两种： 第一种：垂直放置（VERTICAL），相对水平放置来讲，垂直放置就相当于一列，放置的控件或者容器只能在该列中的某个位置，两个控件之间只存在上下方向的关系，不存在其他方向上的关系。当这一列放满后，再添加的控件就至于屏幕之外存在，无法看见。 第二种：水平放置（HORIZONTAL），指的是该容器里面存放的控件或者容器只能以一行的形式出现，放置的控件只能是该行中的某个位置，两个控件或者容器之间只有左右关系没有其他方向上的关系，当放置水平方向满屏时不会自动换行，再放置的控件将在屏幕之外存在，无法看见。 在线性布局中重要的属性值对应表示\nandroid:orientation\t//设置控件或者容器存放的方式 android:id\t//设置控件id，方便在使用时找到其引用 android:layout_width\t//容器的宽度，该值必须设置 android:layout_height\t//容器的高度，该值必须设置 android:layout_weight\t//该属性针对其内的子控件，存放在LinearLayout中的控件都有这个属性，用来设置该控件或者容器占父控件或者容器的比例。相对布局，是指利用控件之间的相对位置关系来对布局进行放置。换句话说，在该容器中的控件与其他任何一个控件或者容器（包括父控件）有相对关系。\n帧布局，是指该容器内放置的控件或者容器没有上下左右的关系，只有层叠前后的关系。放置在容器内的控件按放置的前后顺序逐一层叠摆放，自然地后面摆放的控件就将前面摆放的控件覆盖了，叠在它的上面了。对于放置前后的关系，在没有设置其他属性之前，Android系统采用的是叠放的原则，即后加入节点的层叠在上面。设置属性android：bringToFront=“true|false”将前面放置的控件提到最前面可见。\n表格布局，指该容器是一个表格，放置控件时，控件的位置坐落在表格的某个位置上。其中TableRow是配合TableLayout使用的，目的是为了让TableLayout生成多个列，否则TableLayout中就只能存在一列元素，但可以有多行。\nTableLayout的直接父类是LinearLayout，所以其具有LinearLayout的属性，TableLayout中的每一行用TableRow表示，每一列就是TableRow中的个数指定的。TableRow的直接父类是LinearLayout，但是其放置的方式只能水平放置。\n绝对布局，是指以屏幕左上角为坐标原点（0,0），控件在容器中的位置以坐标的形式存在，可以随意指定控件的坐标位置，非常灵活。在开发过程中很少使用，原因是屏幕兼容性不好，不便控制两个控件之间的位置。其中控件或者容器放置的位置通过android:layout_x和android:layout_y这两个属性进行设置。\nConstraintLayout约束布局\n优点：\nConstraintLayout之所以成为目前Android开发中主流的布局，除了官方建议使用ConstraintLayout外还有以下几个方面的优势 1.功能强大，ConstraintLayout几乎能实现其他布局所有的功能 2.能减少布局层次的嵌套，有性能的优势 3.可视化操作的增强，大部分界面用ConstraintLayout都能通过可视化编辑区域完成\n19.对话框（Dialog）是Android系统在Activity或者其他组件运行过程中提供的一种资源消耗很小的提示机制，它可以帮助应用完成一些必要的提示功能，同时还提供一些用户交互的功能，包括简单的提示、等待、选择、展示等功能。操作简单，资源消耗较少。代码实现可参考实验报告或书本\n1提示对话框\npackage com.example.alertdialog; import android.content.DialogInterface; import android.os.Bundle; import android.view.View; import android.widget.Button; import android.widget.TextView; import android.widget.Toast; import androidx.annotation.Nullable; import androidx.appcompat.app.AlertDialog; import androidx.appcompat.app.AppCompatActivity; import java.util.ArrayList; import java.util.HashMap; public class MultipleChoiceDialogBox extends AppCompatActivity { private Button button; @Override protected void onCreate(@Nullable Bundle savedInstanceState) { super.onCreate(savedInstanceState); setContentView(R.layout.test); button = findViewById(R.id.dialog_box_up); button.setOnClickListener(new View.OnClickListener() { @Override public void onClick(View view) { AlertDialog.Builder builder = new AlertDialog.Builder(MultipleChoiceDialogBox.this); builder.setTitle(\"这是一个简单的弹窗\"); builder.setIcon(R.mipmap.ic_launcher); builder.setMessage(\"你学会了吗？\"); builder.setPositiveButton(\"学会了\", new DialogInterface.OnClickListener() { @Override public void onClick(DialogInterface dialogInterface, int i) { } }); builder.setNegativeButton(\"不会\", new DialogInterface.OnClickListener() { @Override public void onClick(DialogInterface dialogInterface, int i) { } }); builder.show(); } }); } }2单选对话框\npackage com.example.alertdialog; import android.content.DialogInterface; import android.os.Bundle; import android.view.View; import android.widget.Button; import android.widget.TextView; import android.widget.Toast; import androidx.annotation.Nullable; import androidx.appcompat.app.AlertDialog; import androidx.appcompat.app.AppCompatActivity; import java.util.ArrayList; import java.util.HashMap; public class MultipleChoiceDialogBox extends AppCompatActivity { private Button button; private TextView textView; private String sexx[] ={\"男\",\"女\"}; private int choiceWitch = 1; @Override protected void onCreate(@Nullable Bundle savedInstanceState) { super.onCreate(savedInstanceState); setContentView(R.layout.test); button = findViewById(R.id.dialog_box_up); textView=findViewById(R.id.show_dialog_box_text); button.setOnClickListener(new View.OnClickListener() { @Override public void onClick(View view) { AlertDialog.Builder builder = new AlertDialog.Builder(MultipleChoiceDialogBox.this); builder.setCancelable(false); builder.setSingleChoiceItems(sexx, -1, new DialogInterface.OnClickListener() { @Override public void onClick(DialogInterface dialog, int which) { choiceWitch=which; } }); builder.setPositiveButton(\"确定\", new DialogInterface.OnClickListener() { @Override public void onClick(DialogInterface dialogInterface, int i) { textView.setText(sexx[choiceWitch]); } }); builder.setNegativeButton(\"取消\", new DialogInterface.OnClickListener() { @Override public void onClick(DialogInterface dialogInterface, int i) { } }); builder.show(); } }); } }3多选对话框\npackage com.example.gpc.wzxapplicationwu1; import android.content.DialogInterface; import android.os.Bundle; import android.support.annotation.Nullable; import android.support.v7.app.AlertDialog; import android.support.v7.app.AppCompatActivity; import android.view.View; import android.widget.Button; import android.widget.TextView; import java.util.ArrayList; import java.util.HashMap; public class AlertDialogActivity extends AppCompatActivity{ private Button button; private TextView textView; private String sexx[] ={\"a\",\"b\",\"c\",\"d\"}; private boolean stu[] = {false,false,false,false}; private int choiceWitch = 1; private ArrayList\u003cInteger\u003e list = new ArrayList(); private String str = \"\"; private HashMap\u003cInteger,Integer\u003e map = new HashMap\u003c\u003e(); @Override protected void onCreate(@Nullable final Bundle savedInstanceState) { super.onCreate(savedInstanceState); setContentView(R.layout.alert_dialog); textView = findViewById(R.id.alert_dialog_textview); button = findViewById(R.id.alert_dialog_button); button.setOnClickListener(new View.OnClickListener() { @Override public void onClick(View view) { AlertDialog.Builder builder = new AlertDialog.Builder(AlertDialogActivity.this); builder.setMultiChoiceItems(sexx, stu, new DialogInterface.OnMultiChoiceClickListener() { @Override public void onClick(DialogInterface dialogInterface, int i, boolean b) { if(b == true){ map.put(i,i); } else { map.remove(i); } } }); builder.setPositiveButton(\"确定\", new DialogInterface.OnClickListener() { @Override public void onClick(DialogInterface dialogInterface, int i) { for (Integer j : map.keySet()){ int z = map.get(j); str = str + sexx[z]; } textView.setText(str); str = \"\"; } }); builder.setNegativeButton(\"取消\", new DialogInterface.OnClickListener() { @Override public void onClick(DialogInterface dialogInterface, int i) { } }); builder.show(); } }); } }19.Android系统中的ContextMenu(上下文菜单)类似于PC中的右键弹出菜单，当一个视图注册了上下文菜单时，长按该视图对象将出现一个提供相关功能的浮动菜单。上下文菜单可以被注册到任何视图对象中，最常见的是用于列表视图中，但上下文菜单不支持图标和快捷键。\n选项菜单 当Activity在前台运行时，如果用户按下微信消息列表页面右上角加号键，此时就会在屏幕右上角弹出相应的选项菜单。但这个功能需要开发人员编程来实现，如果在开发应用程序时没有实现该功能，那么程序运行时按下手机的meun键是不会起作用的。\n下拉菜单 严格来讲Spinner不算是一个菜单，但是其操作和表现形式具有菜单的行为。Spinner的有效使用可以提高用户的体验。当用户需要选择的时候，可以提供一个下拉列表将所有可选的项列出来，供用户选择。\n21.Toast（提示）的使用，代码实现可参考实验报告或书本。\nToast.makeText(MultipleChoiceDialogBox.this,“nihao”,Toast.LENGTH_LONG).show();\n22.Notification表示通知，是可以显示在Android系统通知栏上的一种数据的封装形，运用Notification可以提高应用的交互性，带来良好的用户感受。 关于Notification，主要涉及到Notification类与NotificationManager类的使用。 Notification类的实例表示在通知栏显示的一个通知，该通知内容包括该通知的ID、时间、内容、标题、图标等。 NotificationManager实例用来将该通知发送到系统的通知栏上。\n23.本地服务（Local Service）用于应用程序内部，可以实现应用程序自己的一些耗时任务，比如查询升级信息、网络传输，或者在一些场合需要在后台执行，比如播放音乐，并不占用应用程序比如Activity所属的线程，而是单开线程后台执行，这样用户体验比较好。\nService的两种启动方式 (1)通过bindService绑定： 绑定时，bindService -\u003e onCreate() –\u003e onBind()； 解绑定：unbindService –\u003eonUnbind() –\u003e onDestory()； 此时如果调用者（如Activity）直接退出，Service 由于与调用者绑定在一起，则Service随着调用者一同停止。\n（2）通过startService绑定： 启动时，startService –\u003e onCreate() –\u003e onStart()； 停止时，stopService –\u003e onDestroy()； 此时，服务与调用者（如Activity）没有绝对关联，当调用者关闭后服务还会一直在后台运行。 服务的生命周期\n23.在Android里面有各式各样的广播，比如：电池的状态变化、信号的强弱状态、电话的接听和短信的接收等等，本节将会介绍系统发送、监听这些广播的机制。\n两种广播注册方法的区别 第一种不是常驻型广播，也就是说广播跟随程序的生命周期 第二种是常驻型，也就是说当应用程序关闭后，如果有信息广播过来，程序广播接收器也会被系统调用自动运行\n25.作为一个完整的应用程序，数据的存储与操作是必不可少的。Android系统为我们提供了四种数据存储方式，分别是：Shared Preference、SQLite、File和ContentProvider。 SharedPreference：一种常用的数据存储方式，其本质就是基于xml文件存储键值对（key-value）数据，通常用来存储一些简单的配置信息。\nSQLite：一个轻量级的数据库，支持基本SQL语法，是Android系统中常被采用的一种数据存储方式。Android为此数据库提供了一个名为SQLiteDatabase的类，封装了一些操作数据库的API。 文件储存：即常说的文件（I/O）存储方法，常用于存储数量比较大的数据，但缺点是更新数据将是一件困难的事情。 ContentProvider：它是Android系统中能实现应用程序之间数据共享的一种存储方式。由于Android系统中，数据基本都是私有的，存放于“data/data/程序包名（package name）”目录下，所以要实现数据共享，正确方式是使用ContentProvider。由于数据通常在各应用间是私密的，所以此存储方式较少使用，但是其又是必不可少的一种存储方式。如果应用程序有数据需要共享时，就需要使用ContentProvider为这些数据定义一个URI（包装成Uri对象），然后其他的应用程序就通过ContentResolver传入这个URI来对数据进行操作。\n26.SharedPreferences对象的常用方法有以下几种：\n27.Sqlite数据库的使用涉及到两个类：SQLiteDataBase和SQLiteOpenHelper\nSQLiteDatabase具体方法：\nSQLiteOpenHelper 具体方法\n例：要得到一个可写数据库，首先创建一个类继承 SQLiteOpenHelper，重写 onCreate()方法并在该方法中创建表，然后使用创建出的 SQLiteOpenHelper 的子类对象的 getWritableDatabase()方法获得一个可读写的数据库对象。\n28.网络状态\n29.JSON数据解析 是一种轻量级的数据交换格式，它基于纯文本，采用完全独立于语言的文本格式来存储和传输数据。在编程环境中解析JSON数据意味着将JSON字符串转换为程序可以理解并操作的数据结构 JSON Object：JSON中对象(Object)以“{”开始, 以“}”结束。对象中的每一个item都是一个键值对，表现为“key:value”的形式, 键值对之间使用逗号分隔。如下代码所示： { “name”：“coolxing”， “age”：24， “male”：true， “address”：{ “street”:“huiLongGuan”， “city”:“beijing”， “country”:“china” } }\nJSONArray: JSON数组(Array)以\"[“开始, 以”]“结束, 数组中的每一个元素可以是String,Number, Boolean, null, Object对象甚至是Array数组, 数组间的元素使用逗号分隔,如下代码所示： [ “coolxing”, 24， { “street”:“huiLongGuan”， “city”:“beijing”， “country”:“china” } ]\n30.Webview WebView 加载页面主要调用三个方法：LoadUrl、LoadData、LoadDataWithBaseURL. LoadUrl 直接加载网页、图片并显示。 LoadData 显示文字与图片内容。(模拟器1.5、1.6)。 LoadDataWithBase 显示文字与图片内容 (支持多个模拟器版本)。 使用webview的websetting来设置，WebSetting websetting = webView.getSettings(). Websetting常用方法：\n31.进程是一个具有一定独立功能的程序关于某个数据集合的一次运行活动。它是操作系统动态执行的基本单元。 通俗地讲一个进程代表一个应用程序，该应用程序运行在自己的进程当中，使用系统为其分配的堆内存，不受其他应用程序或者是其他进程的影响，是独立运行的。当然一个进程中可以同时运行多个应用程序，这时堆内存是共享的。\nAndroid系统为每个应用程序分配了一个进程，应用程序中组件（Activity，Service，BroadCast）的状态决定的一个进程的“重要性层次”，层次最低的属于旧进程。这个“重要性层次”有五个等级，也就是进程的生命周期，按最高层次到最低层次排列如下： （1）前台进程 （2）可视进程 （3）服务进程 （4）背景进程 （5）空进程\n一个Android应用只能存在一个进程，但是可以存在多个线程，也就是说，当应用启动后，系统分配了内存，这个进程的内存不被其他进程使用，但被进程中一个或多个线程共享。宏观地讲所有的进程是并发执行的，而进程中的多个线程同时执行但并不是并发的，系统的CPU会根据应用的线程数触发每个线程执行的时刻，当CPU时间轮到分配某个线程执行时刻时该线程开始执行，执行到下一个线程执行的时，依此轮询，直到线程执行结束。 在理解启动模式前，理解几个概念\n任务 用户尝试在您的应用中执行操作时与之互动的一系列 activity。这些 activity 按照每个 activity 的打开顺序排列在称为“返回堆栈”的堆栈中，也称为任务栈。 Activity：简单理解就是页面，下面介绍启动模式的时候我们都把它理解为“页面”； Intent：教材一般叫意图，简单理解它就是带操作的信息，像指令一样，接收到Intent就类似接收到指令一样。 一个应用可以有多个任务栈，在考虑一个应用一个任务栈的情况下，两个页面如果在不同应用程序，那么在启动这两个页面的时候，他们会被压入各自的任务栈，所以两个不同应用程序的各自页面一般不会出现在同一个任务栈中； onNewIntent() 方法的作用主要是允许已存在的 Activity 更新其状态以响应新的 Intent 数据。例如，在接收动态广播（如地理位置更新、消息通知等）或重新加载内容时，无需重启 Activity 就可以处理新的数据。开发者需要重写这个方法并在其中处理接收到的新 Intent 数据。 四种启动模式：\n标准模式（standard）\n默认启动模式，如果任务栈中没有Activity则会实例化一个新的Activity，并将其压入当前任务栈的顶部。 如果同一个Activity已经存在栈顶，那么新的实例仍然会被创建并压入栈中，因此栈中可能包含多个该Activity实例。\n单例模式（singleTop）\n当一个新的Intent要启动已位于栈顶的Activity（与请求的Intent匹配的Activity）时，系统不会创建新的Activity实例，而是将intent通过onNewIntent()方法传递给现有的Activity实例；\n如果目标Activity不在栈顶，则会正常创建新的实例； 如果目标Activity不在栈顶而在栈顶的下一层呢？ 比如现在有A-B-C-D,D在栈顶，如果传来的Intent是要打开页面C，在单例模式下也是正常创建； 总结：\n在单例模式下，\n如果页面不存在，也就是要打开的Activity没有在任务栈中实例化，那么正常创建Activity实例，并压入栈中； 如果Activity已经存在于任务栈中，且为栈顶，那么系统不创建新的Activity实例，而是将intent通过onNewIntent()方法传递给现有的Activity实例， 如果不是栈顶，正常创建Activity实例。 栈内复用模式（singleTask）\n当打开一个页面，也就是启动一个Activity时，系统首先会在整个任务栈中查找这个Activity是否已经在栈中，\n情况一：如果存在并且处于栈底，则直接把该Activity之上的所有Activity弹出栈，使这个Activity置于栈顶并调用其onNewIntent()。 情况二：如果在栈顶，则将intent通过onNewIntent()方法传递给现有的Activity实例 如果不存在已有的Activity实例，才会创建新的实例并放入栈顶。这种模式下的Activity始终只有一个实例存在于任务栈中。\n单实例模式（singleInstance）\n当启动Activity时，系统会为它创建一个新的任务栈，然后在这个新的栈顶放上这个Activity的实例。 如果再次启动这个Activity，即使是在另一个任务栈中，系统也不会创建新实例，而是将意图传递给已经存在的Activity实例。\n附件 ",
    "description": "",
    "tags": [
      "安卓"
    ],
    "title": "AndroidStudio",
    "uri": "/branch-bundle-1/2.androidstudio/androidstudio%E5%A4%8D%E4%B9%A0%E8%B5%84%E6%96%99/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: Z-专业课",
    "uri": "/categories/z-%E4%B8%93%E4%B8%9A%E8%AF%BE/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 安卓",
    "uri": "/tags/%E5%AE%89%E5%8D%93/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: R-软硬件",
    "uri": "/tags/r-%E8%BD%AF%E7%A1%AC%E4%BB%B6/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 13.计算机组成原理",
    "content": "1 计算机系统概论 计算机的分类 计算机总体上分为：电子模拟计算机1和电子数字计算机。二者区别如下表\n比较内容 电子数字计算机 电子模拟计算机 数据表示方法 0或1 电压 计算方式 数字计算 电压组合和测量值 控制方式 程序控制 盘上连线 精度 高 低 数据存储量 大 小 逻辑计算能力 强 无 计算机的五代变化 第一代1946~1957年， 数据处理 得到应用； 第二代1958~1964年， 工业控制 开始得到应用； 第三代1965~1971年， 小型计算机开始出现； 第四代1972~1990年， 微型计算机 开始出现； 第五代1991年开始， 单片机 开始出现 计算机的性能指标 处理机字长 指处理机运算其中一次能工处理的二进制数运算的位数，例如32位，64位。 存储器带宽 单位时间内从存储器独处的二进制数信息量，一般用 字节数/秒表示。\n2 运算方法和运算器 注：\n掌握各进制之间的转换； 掌握小数点之间的二进制与十进制之间的转换； 二进制纯小数或纯整数表示方法 二进制纯小数： 0.10101 或 1.10101，0或1表示正负号，在正负号后面，在实际中计算机并不存储小数点； 二进制纯整数： 10101.，同样纯整数也用0或1区分正负号。 用Xn-1表示二进制数的个数，Xn表示符号位，如下： Xn Xn-1……X0 符号 量值（尾数） 纯小数表示范围： $0\u003c=|x|\u003c=1-2^{-n} $ 纯整数表示范围： $0\u003c=|x|\u003c=2^{-n} - 1$\n浮点数表示方法 电子质量(克)： 9×10^28 = 0.9×10^27 太阳质量(克)： 2×10^33 = 0.2×10^34\n任意十进制数 N 可以表示为：\n$$N=10^E \\cdot M$$同样在二进制中也有这样类似的表达：\n$$ N=2^e \\cdot M$$ 在二进制浮点数表达中：\n尾数：M，是一个纯小数； 比例因子：e，表示指数，常用整数表示，也称为 阶码 ； 基数：式子中的2 二进制浮点数格式：\n$E_s$ $E_m-1…E_1 E_0$ $M_s$ $M_m-1…M_1 M_0$ 阶符 阶码 数符 尾数 IEEE754标准格式表示浮点数\n知识储备： $\\frac{1}{2^0}=1$, $\\frac{1}{2^1}=0.5$, $\\frac{1}{2^2}=0.25$, $\\frac{1}{2^3}=0.125$, $\\frac{1}{2^4}=0.0625$, $\\frac{1}{2^5}=0.03125$\n浮点数表示：\n$$ N=2^e \\cdot M$$ 浮点数所占位数：\n$S$ $E$ $M$ $31$ $30 \\gets 23$ $22 \\gets 0$ 基数R=2，基数固定，采用隐含方式来表示它。 32位的浮点数： S数的符号位，1位，在最高位，“0”表示正数，“1”表示负 数。 M是尾数， 23位，在低位部分，采用纯小数表示,不对小数点进行存储； E是阶码，8位，也就是说阶码最大不超过255，但阶码采用移码表示 $E=2^{7}+e=127+e$，原因是移码比较大小方便。 规格化： 若不对浮点数的表示作出明确规定，同一个浮点数的表示就不是惟一的，所以一般都会规定这个浮点数的位数 尾数域最左位(最高有效位)总是1， 故这一位经常不予存储，而认为隐藏在小数点的左边。 采用这种方式时，将浮点数的指数真值e变成阶码E时，应将指数e加上一个固定的偏移值127(01111111)，即E=e+127。如果是二进制转真值就E=e-127 下面举两个例子进行说明：\n例1：二进制转十进制若浮点数x的754标准存储格式为(41360000)16，求其浮点数的十进制数值。\n解：将16进制数展开后，可得二制数格式为\n0 100 00010 011 0110 0000 0000 0000 0000\n符号S=0\n阶码E=100 00010\n尾数M=011 0110 0000 0000 0000 0000\n指数e=E-127=10000010-01111111=00000011= $(3)_10$，故有\n1.M=1.011 0110 0000 0000 0000 0000=1.011011\n于是有\n$x=(-1)S \\times 1.M \\times 2^e=+(1.011011) \\times 2^3=+1011.011=(11.375)_10$ 问： 0.011怎么转成0.375？\n根据上面的知识储备有 $ \\frac{1}{2^0}\\times 0 + \\frac{1}{2^1}\\times 1 +\\frac{1}{2^2}\\times 1=0+0.25+0.125=0.375 $\n例2：十进制转二进制若浮点数为 $(28.8125)_10$，求其浮点数的IEEE754标准存储格式的二进制数值。\n解： $(28.8125)_10$= $(11100.1101)_2$\n格式化表示为： $(11100.1101)_2=1.11001101 \\times 2^4$\n于是有\ne=4\nE=e+127=4+127=131= $(1000 0011)_2$\nM=1100 1101 0000 0000 0000 000（去掉小数点和小数点前的1，而且有23位，不够补0）\nS=0\nIEEE754标准的32为存储数据位：0 1000 0011 1100 1101 0000 0000 0000 000\n数的机器码表示 计算机进行运算时，会把符号位和数字一起编码表示为相应的数，这些数可以用不同的方法表示，例如：原码、补码、移码、反码；\n为了区别一般写的数（比如-12，+3等）和机器中的编码（比如 0 1100,1 0011），通常前者称之为 真值，后者称为 机器数 或 机器码 。\n$[x]_原$表示机器数，x表示真值。\n例如：\n$x=+0011$， $[x]{_原}=\\textbf{0}0011$\n$x=-0011$， $[x]{_原}=\\textbf{1}0011$，\n原码机器中有“+0”“-0”之分，固有两种形式：例如： $[x]{_原}$与 $\\textbf{1}0011$表达的意思一样。\n数学上把类似于 $-3=+9 (mod12)$的式成为 同余式。\n原码、反码、补码、移码 对原码、反码、补码、移码的简单说明，已知计算机为4位，x=-3.\n例子 表示方法 二进制 说明 -3 原码 $[-3]{_原}$=00011 -3 反码 $[-3]{_反}$=01100 按位取反 -3 补码 $[-3]{_补}$=01101 反码最低位加1，注意这个时候符号还是1 -3 移码 $[-3]{_移}$=1,1101 $[e]{_移}=2^{k}+e=2^4-0011=0,1101$ 对于正数来说，前三个都一样，重点说明移码：\n定点整数定义 $[e]{_移}=2^{k}+e, 2^k \u003ee≥-2^k$\n上面的表达式中， $[e]{_移}$表示机器码，e为真值， $2^k$表示固定偏移常量。\n已知e=+0011,k=4， $[e]{_移}=2^{k}+e=2^{4}+0011=1,0011$\n已知e=-0011,k=4， $[e]{_移}=2^{k}+e=2^{4}-0011=0,1101$\n移码中的逗号不是小数点，而是表示左边一位是符号位，显然移码中符号位与前三者的表示相反（详见P21）。\n下面请看例题：\n已知计算机是8位的，请分别写出纯整数125，-110，纯小数+0.125，-0.375；二进制数x=11011,y=-01010的原码、反码、补码、移码。（注意格式，要对齐）\n表示方法 表示方法 +125=00101 1111 -110=10011 1011 $[125]{_原}$=00101 1111 $[-110]{_原}$=10011 1011 $[125]{_反}$=00101 1111 $[-110]{_反}$=11100 0100 $[125]{_补}$=00101 1111 $[-110]{_补}$=11100 0101 $[125]{_移}$=1,0101 1111 $[-110]{_移}$=0,1100 0100 +0.125=0.0010 0000 -0.357=1.0110 0000 $[125]{_原}$=0.0010 0000 $[-110]{_原}$=1.0110 0000 $[125]{_反}$=0.0010 0000 $[-110]{_反}$=1.1001 1111 $[125]{_补}$=0.0010 0000 $[-110]{_补}$=1.1010 0000 $[125]{_移}$=1,0010 0000 $[-110]{_移}$=0,1010 0000 x=11011 -110=-01010 $[125]{_原}$=00001 1011 $[-110]{_原}$=10000 1010 $[125]{_反}$=00001 1011 $[-110]{_反}$=11111 0101 $[125]{_补}$=00001 1011 $[-110]{_补}$=11111 0111 $[125]{_移}$=1,0001 1011 $[-110]{_移}$=0,1111 0111 定点加法、减法运算 公式 补码加法：任意两数补码之和等于两数之和的补码， $[x]{_补}+[y]{_补}=[x+y]{_补}$\n补码减法： $[x-y]{_补}=[x]{_补}-[y]{_补}=[x]{_补}+[-y]{_补}$\n从 $[y]{_补}$求 $[-y]{_补}$的法则是对 $[y]{_补}$包括符号位在内求反，最低位加1得到表达式为：\n$[-y]{_补}=\\rightharpoondown [y]{_补}+2^{-n}$ 其中，符号 $\\rightharpoondown$表示对 $[y]{_补}$作求反操作，包括正负号在内， $2^{-n}$表示末位（最低位）加1.\n下面举例加以理解运算过程：\n（ 详见P29 ）\n溢出概念与检验方法 在定点整数机器中，运算过程中出现大于字长绝对值的现象称为 溢出，溢出分正、负溢出两种，用两位符号位表示， 00、11分别表示整数和负数，01表示正溢出，10 表示负溢出。\n详细说明原理： 假设x表示二进制数，用 $2^{-n}",
    "description": "",
    "tags": [
      "R-软硬件"
    ],
    "title": "计算机组成原理-复习",
    "uri": "/branch-bundle-1/1.%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BB%84%E6%88%90%E5%8E%9F%E7%90%86/%E8%AE%A1%E7%AE%97%E6%9C%BA%E7%BB%84%E6%88%90%E5%8E%9F%E7%90%86-%E5%B0%8F%E7%9F%A5%E8%AF%86/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 物联网工程",
    "uri": "/tags/%E7%89%A9%E8%81%94%E7%BD%91%E5%B7%A5%E7%A8%8B/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 6.Arduino",
    "content": "物联网的特点 物联网是互联网的拓展和延伸，物联网设备通常为带传感器的电子硬件，并与网络相连接。 物联网的应用层是核心。 物联网的作用 全面感知：全面感知就是通过各种类型的传感器实时感知被测物理对象的状态。 可靠传递：可靠传递就是通过各种网络与互联网的融合，将物体的信息实时准确地传递出去。 智能计算：智能处理就是利用云计算、模糊识别等各种智能计算技术，对海量的数据和信息分析和处理，以实现对物体智能化控制。 物联网体系架构 ISO七层参考模型 以及每一层的功能。\n物理层：在物理媒体上传输原始的数据比特流。 数据链路层：将数据分成一个个数据帧，以数据帧为单位传输。有应有答，遇错重发。 网络层：将数据分成一定长度的分组，将分组穿过通信子网，从信源选择路径后传到信宿。 传输层：提供不具体网络的高效、经济、透明的端到端数据传输服务。 会话层：进程间的对话也称为会话，会话层管理不同主机上各进程间的对话。 表示层： 为应用层进程提供格式化的表示和转换数据服务。 应用层：提供应用程序访问OSI环境的手段。 物联网的三层结构 “云”、“管”、“端”分别指：应用层、网络层、感知层。 物联网服务器的主要功能接收数据、处理数据、保存数据。 物联网硬件设备有感知和反馈的作用\n可用于物联网短距离无线通信的技术主要有： Zigbee； RFID； NFC ; 蓝牙。 物联网近距离通信技术有： 蓝牙、 RFID、 ZigBee 工业物联网设备的组网方式可分为RS-232；RS-485；USB。\nRS-232： RS-232是一种早期广泛应用于串行通信的标准，提供点对点的数据传输，通常用于短距离通信（约15米以内）。 信号电平范围较大（±15V左右），支持全双工通信，即数据可以在两个方向上同时传输。 在工业环境中，RS-232常用于配置设备、调试或连接单个设备到计算机或其他控制器。 RS-485： RS-485基于差分信号传输，允许更长的传输距离（可达几千米），并且具有更好的抗噪声和电磁干扰能力。 它支持多点总线式网络架构，可以实现一个主设备与多个从设备之间的通信，因此特别适用于构建分布式控制系统或传感器网络。 RS-485采用半双工通信模式，在同一时间只能进行发送或接收操作，但通过软件协议控制可以实现在同一总线上多个节点有序通信。 USB（Universal Serial Bus）： USB是一种通用串行总线标准，它提供高速数据传输，并且能够为设备供电，使得它在现代工业自动化和物联网应用中越来越普遍。 USB支持热插拔，使用方便，而且有多种速度版本（如USB 2.0, USB 3.0等），数据传输速率远高于RS-232和RS-485。 在工业环境中，USB接口可能用于快速配置设备、固件升级或者连接各种智能设备，但它不适合长距离传输，一般局限于设备间较近距离的直接连接。 物联网M2M通信指的是机器与机器通信\n蓝牙采用高速跳频(Frequency Hopping)和时分多址(Time Division Multiple Access，TDMA)等先进技术，支持点对点及点对多点通信。其传输频段为全球公共通用的2.4 GHz频段，能提供1 Mb/s的传输速率和10 m的传输距离，并采用时分双工传输方案实现全双工传输。\nAndroid客户端在物联网体系中属于应用程序层。\n人工智能属于物联网体系中的服务层。\nNFC 是一种非接触式的识别技术。\n开关量与传感器 开关量与数字信号 数字信号指的是0和1两种信号的变化。传感器可以只使用0和1来表示自己的状态变化，也就是“有信号”和“没信号”两种情况，类似我们生活中的开关装置。\n模拟信号抗噪算法\n2.1 算术平均算法\n方法: 采样N个数据后进行平均\n优点: 算法简单、适合于一般带有不规则噪声的信号\n缺点: 用来运算的数值会越来越多，相对反应会越慢，不适用于实时性的控制，另外占用内存也多\n2.2 移动平均算法\n方法: 先将每一个新数据加入队列中并删除最后一个，再进行平均\n优点:算法简单、适用于有周期性干扰噪声的信号\n缺点:对于突然出现的异常脉冲信号的抑制较差，采样的数量过大时同样占用内存。\n模数转换 把传感器获取的测量值用连续的电子信号表示出来，就是模拟信号。想用PC处理模拟信号，就需要进行模拟/数字(A/D）转换，把模拟信号转换成离散值，即数字信号。A/D转换操作分成以下3个步骤。\n采样(sampling) =\u003e用某个频率来区分模拟输入信号，获取值 量化=\u003e把采样后的值近似表现为离散值 编码(coding)=\u003e把量化后的数值编码成二进制代码。如下图 传感器知识点 在物联网节点之间做通信的时候，通信频率越高，意味着传输距离越近。\n传感器的性能指标： 传感器动态特性：指传感器在输入变化时，它的输出特性，常以迁跃响应和频率响应来表示。\n传感器的线性度：传感器的实际静态特性输出是条曲线而非直线。\n传感器的灵敏度：传感器在静态工作情况下，输出变量变化y对输入变化量x的比值。\n传感器的分辨率：指传感器能感受到的被测量的最小变化的能力，也就是说某一输入量缓慢变化，当输入未超过某一值时，输出不变，超过了就有变化，则可以说此时传感器能分辨出来，这就是传感器的分辨率。\n传感器的组成与结构 传感器一般由敏感元件、转换元件、基本转换电路组成。 敏感元件：直接感受被测量，并且输出与被测量成一定关系的某一物理量的元件； 转换元件：敏感元件的输出就是它的输入，把输入转换成电路参量； 转换电路：将转换电路的输出转换成电量输出； 传感器的静态特性 静态特性是指测试系统在静态信号下，输入与输出的关系； 衡量测试装置静态特性的重要指标：\n线性度(Linearity) 灵敏度(Sensitivity) 迟 滞(Hysteresis) 重复性(Repeatability) 常见的传感器 光电式传感器（光敏电阻传感器） 如果把光敏电阻连接到外电路中，在外电压的作用下，用光照射就能改变电路中电流的大小。 如下图为工作原理图 光敏电阻的重要参数与基本特性 暗电流、暗电阻与亮电流、亮电阻：\n光敏电阻在未受到光照时的电阻和流过的电流分别称之为暗电阻和暗电流，有光照时则对应称之为亮电流、亮电阻；\n光电流 亮电流与暗电流的差值；\n结露传感器 理想的干燥空气：78%氮气+21%氧气+1%其他气体\n多尔顿分压定律：空气的压强P应该等于该混合物中各种气体分压之和,公示如下： 什么是湿度？ 空气中所含的水蒸气的量\n湿度的表示方法：\n绝对温度 相对温度 露点温度 露点温度(露点)：在一定的空气压力下，逐渐降低空气的温度，当空气中所含水蒸气达到饱和状态，而开始结露或结霜时的温度。 震动传感器： 震动三要素：振幅、频率、相位 以简谐运动为例： x=A cos(wt+y)\n红外对管（红外传感器） 红外对管中，黑色管子是红外发射传感器。\n智慧大棚中的常用传感器： （1）空气温湿度传感器 （2）光照传感器 （3）土壤湿度传感器 （4）风速传感器 （5）二氧化碳传感器 数据分析的基础架构\n首先把数据分析的基础架构分为 4 项来看，这 4 项分别是采集、积累、加工、分析。 高级分析的基础 机器学习可以说是高级分析的典型代表。机器学习领域汇集了众多技术，这些技术用于让计算机基于大量数据来学习数据的倾向并作出某些判断。机器学习的算法可以根据输入的数据类型分为“监督学习”和“非监督学习”两种。\n监督学习和非监督学习\n监督学习：当用机器学习的算法让计算机学习数据倾向时，算法会根据用于学习的数据中是否含有“正确答案”的数据而有所不同。 打个比方，假设现在要从传感器数据来判断分析设备的故障情况和建筑物的损坏情况等异常状况。如果采用监督学习的算法，就需要输入过去实际发生异常状况时的数据，即需要明确地输入“异常”的数据。说白了，算法要学习“正确答案”和“不正确答案”之间存在的差异。 非监督学习：监督学习则处理的是未标记的数据集，即数据集中没有预先定义的输出变量或目标变量。 非监督学习的目标在于发现数据内部的隐藏结构、模式、相似性或关联性，而不是预测特定的结果。非监督学习的主要主要任务有以下几种： Android IDE 介绍 Android客户端在物联网体系中属于 应用程序层 。\nArduino是2005年被设计开发出来的，开发平台的特点有： 开放性、混合编程、容易拓展。\nArduino开发环境是免费和开源的，开发语言为C/C++混合编程。\nArduino中下载程序到单片机需要先安装串口转USB的驱动程序。\nArduino程序的架构大体可分为3个部分 （1）声明变量及接口的名称。\n（2） setup()。 在Arduino程序运行时首先要调用setup()函数，用于初始化变量、设置针脚的输出/输入类型、配置串口、引入类库文件等等。每次Arduino上电或重启后，setup()函数只运行一次。\n（3） loop()。 在setup()函数中初始化和定义变量，然后执行loop()函数。顾名思义，该函数在程序运行过程中不断地循环，根据反馈，相应地改变执行情况。通过该函数动态控制Arduino主控板。\nArduino IDE编程并下载程序流程 在Arduino IDE编程并下载程序到开发板的过程，实际上是编译器将程序翻译为 机器语言（即二进制语言）的过程。计算机将二进制的指令传送到单片机程序闪存中，单片机识别指令后进行工作。下图是从编写好的程序到Arduno开发板运行程序的流程 Arduino开发中 数字管脚读取函数 digitalRead（） ； 模拟管脚读取函数 analogRead（） ； 串口调试函数为 Serial.println()，用于在串口打印内容 延时函数——Delay() 延时的基本单位为ms,Delay(200)为延时200ms Arduino UNO开发板提供6个模拟接口，模拟信号分辨率为10位（意味着ADC可以将输入的模拟电压分成2^10 = 1024个离散级别进行数字化），它能测到的最小电压为 5V/1024=0.0049V 。 Arduino的物理管脚有Analog、Digital、VCC、GND、VIN、RES等 Analog（模拟）管脚：\nArduino Uno等开发板上有一组特定的引脚标记为A0、A1、A2…A5（或更多，取决于具体型号），它们是模拟输入引脚。 这些引脚可以接收连续变化的电压值（通常在0到5V之间），并将其转换成数字值（0-1023，对应于ADC即模数转换器的分辨率是10位）。 通过这些引脚，你可以读取来自传感器或其他模拟信号源的数据。 Digital（数字）管脚：\n数字管脚用于处理二进制信号，也就是高电平（通常对应5V或3.3V，取决于板子类型和所处的操作模式）和低电平（接地，即0V）。 它们既可以作为输入端口检测外部设备的高低电平状态，也可以作为输出端口驱动LED、继电器或其他数字器件。 部分数字管脚还支持PWM（脉宽调制）输出，这样就可以模拟出不同亮度级别的LED或者调整电机速度等。 VCC：\nVCC代表“电源正极”。 GND：\nGND代表“接地”。 VIN：\nVIN是外部电源输入端，允许用户接入高于5V的电源（比如9V或12V电池）。这个引脚的电压将被板载稳压器转换成稳定的5V供给VCC使用。当Arduino通过USB线供电时，VIN不是必需的，但如果需要更高功率或独立电源，则可以使用此引脚。 RES / RESET：\nRES或RESET是复位引脚，当此引脚被拉低（一般是短接到GND）时，Arduino板上的微控制器会执行复位操作，重启其程序执行从头开始。在一些情况下，可以通过外部电路控制复位信号来实现更高级的功能，例如硬复位或远程复位。 Soc（系统芯片）处理器的功能强于MCU处理器的功能 SOC（System-on-a-Chip）处理器相较于MCU（Microcontroller Unit）处理器功能更强大的原因主要体现在以下几个方面：\n集成度：\nSOC芯片高度集成了中央处理器（CPU）、图形处理器（GPU）、内存（RAM、ROM/Flash）、以及其他专用硬件加速器如DSP（数字信号处理器）、通信模块（如Wi-Fi、蓝牙、LTE等）、以及各种外设接口，形成一个一体化的复杂系统。而MCU虽然也在单一芯片上集成了CPU和一些内存资源及I/O接口，但集成度一般低于SOC。 性能与计算能力：\nSOC通常采用高性能的CPU内核架构，可以支持多核设计，运行速度更快，并且可能支持运行复杂的操作系统（如Linux、Android等），能够处理更多的并发任务和执行更为复杂的算法。 MCU往往采用针对低功耗和实时控制优化的精简指令集CPU，更适合于简单、快速响应的任务。 存储容量和扩展性：\nSOC具有更大的内存空间，包括程序存储器和数据存储器，支持更大数据量的处理和存储需求，同时也可以通过外部总线连接更多存储设备。 相比之下，MCU的内部存储器相对有限，虽然也能扩展外部存储，但在规模上通常不及SOC。 多媒体与通信能力：\nSOC普遍具备强大的多媒体处理能力，例如图像处理、音频编解码、视频编码等，还集成有高级网络和无线通信功能，以适应移动设备和物联网应用的需求。 MCU在这些方面的集成程度和性能则较低，除非专门设计用于某些特定领域，否则它们通常不包含这些复杂的功能模块。 能耗与散热管理：\n虽然SOC功能强大，但也面临着更高的能耗和散热挑战。不过，现代的SOC设计采用了先进的电源管理和低功耗技术来平衡性能与能效之间的关系。 MCU在设计之初就重点考虑了低功耗应用，适合电池供电或对能源敏感的应用场景。 上课实验知识点 温湿度传感器 温湿度传感器采用的是 单总线协议 。\n单总线传送数据定义以AM2302为例。 SDA用于微处理器与AM2302之间的通讯和同步,采用单总线数据格式，一次传送40位数据，高位先出。\n通信格式 AM2302的湿度分辨率是16bit，高位在前。\n主机和传感器之间可以通过如下几个步骤完成数据读取。 步骤一 传感器上电后 ，测试环境温湿度数据，并记录数据，此后传感器自动转入休眠状态。\n步骤二 微处理器的I/O设置为输出，同时输出低电平，且低电平保持时间不能小于80ous，典型值是拉低1Ms，然后微处理器的I/O设置为输入状态，释放总线，由于上拉电阻，微处理器的I/O如AM2302的SDA数据线也随之变高，等主机释放总线后，AM2302发送响应信号，即输出80us的低电平作为应答信号，紧接着输出80us的高电平通知外设准备接收数据，信号传输如图7所示 步骤三 AM2302发送完响应后，随后由数据总线SDA连续串行输出40位数据，微处理器根据l/o电平的变化接收40位数据。\n位数据“o”的格式为:50微秒的低电平加26-28微秒的高电平; 位数据“1”的格式为: 50微秒的低电平加70微秒的高电平; 位数据“o”、位数据“1”格式信号如图8所示。 // REQUEST SAMPLE（发送请求，此阶段为激活温湿度传感器） pinMode(DHT_PIN, OUTPUT);//4号引脚设置输出模式，默认高电平输出 digitalWrite(DHT_PIN, LOW);//设置低电平输出，并延迟18ms delay(18); digitalWrite(DHT_PIN, HIGH);//设置高电平，并延迟40us delayMicroseconds(40); //第二阶段：通知开发板，自己准备发数据。 pinMode(DHT_PIN, INPUT);//设置输入模式 // ACKNOWLEDGE or TIMEOUT（确认或超时） unsigned int count = 10000;//定义无符号整形 while(digitalRead(DHT_PIN) == LOW) if (count-- == 0) return DHT_ERR_TIMEOUT;//返回DHT_ERR_TIMEOUT = -1 count = 10000; while(digitalRead(DHT_PIN) == HIGH) if (count-- == 0) return DHT_ERR_TIMEOUT; // READ OUTPUT - 40 BITS =\u003e 5 BYTES or TIMEOUT（读取输出- 40比特=\u003e 5字节或超时） for (int i=0; i\u003c40; i++) { count = 10000; while(digitalRead(DHT_PIN) == LOW) if (count-- == 0) return DHT_ERR_TIMEOUT; unsigned long t = micros(); //函数返回Arduino板开始运行当前程序时的微秒（us）数。 count = 10000; while(digitalRead(DHT_PIN) == HIGH) if (count-- == 0) return DHT_ERR_TIMEOUT; // |=:按位或后赋值 if ((micros() - t) \u003e 40) bits[idx] |= (1 \u003c\u003c cnt); //上次读取的时间到现在读取的时间差大于40，那么bits[idx] //的1左移CNT位，假设传的第一个数据是1，即(micros() - t)\u003e40， //那么把1左移cnt位后赋值给数组bits[]（刚开始的时候cnt=0, //也就是1左移0位） if (cnt == 0) // 高8位数据传完了没有呢？ { cnt = 7; // 传完了，那让cnt=7，即进行下一轮低八位的传输， idx++; // 数组加1，说明下一次存的数据放在了数组的下一位 } else cnt--; } sum = bits[0]+bits[1]+bits[2]+bits[3]; if(bits[4] != sum) return DHT_ERR_CHECK; //校验位 单总线读写流程 初始化 发命令 读取湿度和温度 流程图如下： 系统设计 物联网系统的开发流程： （1）系统规划阶段 （2）验证假设阶段 （3）系统开发阶段 （4）系统交付阶段 （5）维护应用阶段\n需求分析 首要步骤是获取用户需求。\n物联网详细设计 有代码编写、流程图绘制、 软件测试等。\n物联网设备选型的主要流程： （1）处理器选型，选择合适的单片机或开发板。\r（2）传感器选型，选择合适的数字或模拟传感器。\r（3）中间件选型，选择合适的网络通信方式。\r物联网系统测试的主要流程： （1）进行软件测试，分静态测试和动态测试。\r静态测试和动态测试是软件测试中的两种主要类型，它们在软件开发生命周期的不同阶段用来验证软件的质量和正确性。\r（2）进行硬件测试和网络测试。\r（3）进行系统集成测试。\r静态测试： 静态测试是指不执行程序代码的情况下进行的测试活动。它主要用于检查软件的非执行属性，主要包括：\n文档审查：检查需求规格说明书、设计文档、用户手册等非代码类文档是否清晰、完整、一致以及符合标准。\n代码审查（包括桌面检查、走查和正式审查）：通过人工或自动化工具对源代码进行逐行分析，查找可能存在的错误、缺陷、不符合编码规范的地方，以及潜在的设计问题和结构弱点。\n静态分析：利用静态分析工具自动检测代码中的潜在错误，如未初始化的变量、死代码、数据流错误、复杂度过高函数等问题。\n静态测试的目标在于发现并修复在软件开发早期就能确定的问题，以减少后期动态测试时发现严重错误的可能性。\n动态测试： 动态测试则是在实际运行软件的过程中进行的测试，重点在于检查程序的实际执行效果，主要包括：\n单元测试：针对单个模块或函数进行测试，确保其内部逻辑功能正常。\n集成测试：将各个模块组合在一起测试，验证接口间的交互及整体功能。\n系统测试：验证整个系统的功能、性能、安全性等方面是否满足预定要求。\n验收测试（包括用户验收测试）：根据业务需求验证软件能否在真实环境中正确工作。\n压力测试、负载测试和性能测试：检验软件在极限条件下的表现，例如处理大量并发请求的能力。\n动态测试通常使用黑盒测试、白盒测试和灰盒测试策略来构造测试用例，并通过实际运行程序得到结果与预期结果对比，从而发现并报告错误。\n总之，静态测试关注的是不运行程序就可识别的问题，而动态测试则侧重于在实际运行条件下暴露软件行为中的缺陷。两者结合能够更全面地保证软件质量。\n标准 , ASCI码使用7bit数据来表示所有的大写和小写字母、数字0到9、标点符号,以及在美式英语中使用的特殊控制字符。\n串口通信 标准 , ASCI码使用7bit数据来表示所有的大写和小写字母、数字0到9、标点符号,以及在美式英语中使用的特殊控制字符。\n串行通信是指使用一条数据线,将数据一位一位地依次传输,每一位数据占据一个固定的时间长度\n在进行串口通信时,两个串口设备间需要**发送端(TX)与接收端(RX)**交叉相连,并共用电源地(GND)。\n串行通信的约定 串行通信中的这种约定包含两个方面，\n一方面是通信的速率要保持一致， 另一方面是字符的编码要一致。 波特率 通信速率是指单位时间内传输的信息量,可用比特率和波特率来表示。 比特率 是指每秒传输的二进制位数,用bps (bits)表示。 波特率 是指每秒传输的符号数,若每个符号所含的信息量为1比特,则波特率等于比特率。\n串口工作原理\n在Arduino与其它器件通讯的过程中,数据传输实际上都是以数字信号(即电平高低变化)的形式进行的,串口通信也是如此.当使用Serial.print()函数输出数据时,Arduino的发送端会输出一连串的数字信号,称这些数字信号为数据帧. 例如,当时用Serial.print(‘A’)语句发送数据时,实际发送的数据帧格式如下图所示: Serial.begin()是Arduino开发平台串口初始化函数。 物联网设备跟云平台的通讯方法分为同步传输和异步传输\n以光照度传感器为例，讲解串口通信模式。\nconst int sensorPin = 2; const int ledPin = 13; int lineFound = -1; void setup() { Serial.begin(115200); pinMode(sensorPin, INPUT); pinMode(ledPin, OUTPUT); } void loop() { lineFound = digitalRead(sensorPin); if(lineFound == HIGH) { Serial.println(\" \"); digitalWrite(ledPin, HIGH); } else { Serial.println(\" \"); digitalWrite(ledPin, LOW); } delay(10); }流程如下： 串口例程：\nconst int analogInPin = A0; int sensorValue = 0; void setup(){ Serial.begin(115200,8N1); } void loop(){ sensorValue = analogRead(analogInPin); delay(250); }（1）串口通信模式有：1）波特率为115200 （2）校验方式为无校验 (3)数据位为8位、停止位为1位 （2）串口通信流程图 ",
    "description": "",
    "tags": "物联网工程",
    "title": "物联网控制-小知识",
    "uri": "/branch-bundle-1/6.arduino/21%E7%BA%A7%E7%89%A9%E8%81%94%E7%BD%91%E6%8E%A7%E5%88%B6%E5%A4%8D%E4%B9%A0%E8%B5%84%E6%96%99/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 4.Esp8266_WiFi",
    "content": "通信串口 参照上一节课\n物联网是新一代信息技术领域的重要组成部分。其英文名称是“The Internet of things”，顾名思义，“物联网就是物物相连的互联网”。\n这有两层意思：\n第一，物联网的核心和基础仍然是互联网，是在互联网基础上的延伸和扩展的网络； 第二，其用户端延伸和扩展到了任何物品与物品之间，进行信息交换和通信。\n全面感知：全面感知就是通过各种类型的传感器实时感知被测物理对象的状态。 可靠传递：可靠传递就是通过各种网络与互联网的融合，将物体的信息实时准确地传递出去。 智能计算：智能处理就是利用云计算、模糊识别等各种智能计算技术，对海量的数据和信息分析和处理，以实现对物体智能化控制。 通信 通信的目的 传递消息中所包含的信息\n消息 是物质或精神状态的一种反映，例如语音、文字、音乐、数据、图片或活动图片等\n信息 是消息的有效信息内容\n通信系统的一般模型 信息源、发送设备、信道、接收设备、受信者、噪声源。\n发送端：信息源、发送设备； 接收端：接收设备、受信源； 通信系统分类 根据按信道中传输的 信号分类 ，通信系统分为 模拟通信系统 和 数字通信系统 。模拟通信系统传送的是模拟信号，这代表消息的信号参量取值是连续的。\n调制是指把信号转换成适合在信道中传输的形式的一种方产。广义调制分为 基带调制 和 频带（载波）调制\n点对点之间的通信，按消息传送的方向，通信方式可分为 单工通信 、半双工通信及全双工通信 三种\n串行通信 将数字元码序列以串行方式一个元码接着一个元码的在一条信道上传输。\n优点：只需一条通信信道，节省线路铺设费用； 缺点：速度慢，需要外加码组或字符同步措施。\n随着技术的发展，以USB为代表的串行传输速度已经超过并行传输。\n并行通信 将代表信息的数字信号元码序列以组的方式在两条或者两条以上在并行信道上同时传输。\n优点：节省传输时间，速度快，不需要字符同步措施； 缺点：需要n条数据线，成本高。\n标准 , ASCI码使用7bit数据来表示所有的大写和小写字母、数字0到9、标点符号,以及在美式英语中使用的特殊控制字符。\n串行通信是指使用一条数据线,将数据一位一位地依次传输,每一位数据占据一个固定的时间长度\n在进行串口通信时,两个串口设备间需要**发送端(TX)与接收端(RX)**交叉相连,并共用电源地(GND)。\n串行通信的约定 串行通信中的这种约定包含两个方面，\n一方面是通信的速率要保持一致， 另一方面是字符的编码要一致。 波特率 通信速率是指单位时间内传输的信息量,可用比特率和波特率来表示。 比特率 是指每秒传输的二进制位数,用bps (bits)表示。 波特率 是指每秒传输的符号数,若每个符号所含的信息量为1比特,则波特率等于比特率。\n串口工作原理\n在Arduino与其它器件通讯的过程中,数据传输实际上都是以数字信号(即电平高低变化)的形式进行的,串口通信也是如此.当使用Serial.print()函数输出数据时,Arduino的发送端会输出一连串的数字信号,称这些数字信号为数据帧. 例如,当时用Serial.print(‘A’)语句发送数据时,实际发送的数据帧格式如下图所示: Serial.begin()是Arduino开发平台串口初始化函数。 物联网设备跟云平台的通讯方法分为同步传输和异步传输\n以光照度传感器为例，讲解串口通信模式。\nconst int sensorPin = 2; const int ledPin = 13; int lineFound = -1; void setup() { Serial.begin(115200); pinMode(sensorPin, INPUT); pinMode(ledPin, OUTPUT); } void loop() { lineFound = digitalRead(sensorPin); if(lineFound == HIGH) { Serial.println(\" \"); digitalWrite(ledPin, HIGH); } else { Serial.println(\" \"); digitalWrite(ledPin, LOW); } delay(10); }流程如下： 串口例程：\nconst int analogInPin = A0; int sensorValue = 0; void setup(){ Serial.begin(115200,8N1); } void loop(){ sensorValue = analogRead(analogInPin); delay(250); }（1）串口通信模式有：1）波特率为115200 （2）校验方式为无校验 (3)数据位为8位、停止位为1位\n（2）串口通信流程图 ZigBee与IEEE802.15.4 ZigBee网络中的每一个节点都有一个16bit网络地址和一个64bit IEEE扩展地址。\nIEEE802.15.4定义了2450MHz、868MHz、915MHz三个频段。对于不同的国家和地区，为其提供的工作频率范围是不同的，其中2450MHz （2.4GHz）频段是全球统一无需申请的的ISM频段，提供 250kbps 的通信速率，并提供16个信道;868MHz频段是欧洲的ISM频段，提供1个速率为20kbps的信道，915MH频段是美国的ISM频段，提供10个速率为40kbps的信道。\n在ZigBee网络中存在三种节点类型：\nCoordinator(协调器)， Router(路由器) End-Device(终端设备)。 ZigBee网络由一个Coordinator以及多个Router和多个End_Device组成。\nZigBee可采用 星状 、片状 和 网状 网络结构，由一个主节点管理若干子节点，最多一个主节点可管理254个子节点;同时主节点还可由上一层网络节点管理，最多可组成65000个节点的大网。\n三种设备类型\n三种节点类型及其案例\n三种网络拓扑结构类型\n星形拓扑 包含一个Co-ordinator（协调者） 节点和一系列的 End Device（终端）节点，每一个End Device 节点只能和 Co-ordinator 节点进行通讯。如果需要在两个 End Device 节点之间进行通讯必须通过Co-ordinator 节点进行信息的转发。\n树形网络 树形拓扑包括一个Co-ordinator（协调者）以及一系列的 Router（路由器） 和 End Device（终端）节点。Co-ordinator 连接一系列的 Router 和 End Device， 他的子节点的 Router也可以连接一系列的 Router 和End Device. 这样可以重复多个层级。 Co-ordinator 和 Router 节点可以包含自己的子节点。End Device 不能有自己的子节点。有同一个父节点的节点之间称为兄弟节点。\n网型网络（Mesh拓扑） 网形网络（Mesh拓扑） 包含一个Co-ordinator和一系列的Router 和End Device。这种网络拓扑形式和树形拓扑相同；请参考上面所提到的树形网络拓扑。但是，网状网络拓扑具有更加灵活的信息路由规则，在可能的情况下，路由节点之间可以直接的通讯。这种路由机制使得信息的通讯变得更有效率，而且意味这一旦一个路由路径出现了问题，信息可以自动的沿着其他的路由路径进行传输。\nRFID射频识别技术 RFID的定义：射频识别（Radio Frequency Identification，RFID）是一种 非接触式 的自动识别技术，它通过射频信号自动识别特定目标对象并读写相关数据，而无须识别系统与特定目标之间建立机械或光学接触。\nRFID系统通常由 电子标签 、读写器 和 计算机网路 三部分组成。\nRFID系统中的读写器的 工作频率 决定了整个RFID系统的工作频率，功率大小决定了整个RFID系统的工作距离。\n在RFID系统中常用的频段有4种：低频LF(125kHz)、高频HF(13.56MHz)、超高频UHF(850～910MHz)及微波(2.45GHz)\n电子标签分为 无源标签(passive)、 半无源标签(semi-passive) 和 有源标签(active)三种类型。\nRFID最基本的硬件体系结构由RFID电子标签、RFID读写器和计算机。\nRFID系统的工作原理 利用射频信号的空间耦合（电磁感应或电磁传播）传输特性，实现对静止的、移动的待识别物品的自动识别，如图所示：\nRFID网络框架结构 通信串口组网、 读写器与计算机直接连接、 读写器通过中间件连入网络 RFID工作过程 读写器向M1卡发一组固定频率的电磁波，卡片内有一个LC串联谐振电路，其频率与读写器发射的频率相同，在电磁波的激励下，LC谐振电路产生共振，从而使电容内有了电荷，在这个电容的另一端，接有一个单向导通的电子泵，将电容内的电荷送到另一个电容内储存，当所积累的电荷达到2v时，此电容可做为电源为其它电路提供工作电压，将卡内数据发射出去或接取读写器的数据。\n蓝牙技术 蓝牙技术工作在2.4GHz频段，2.4GHz的ISM波段是一种短距离无线传输技术，供开源使用。 2. 蓝牙使用跳频技术，将传输的数据分割成数据包，通过79个指定的蓝牙频道分别传输数据包。每个频道的频宽为1MHz，蓝牙4.0使用2MHz间距，可容纳40个频道。 3. 蓝牙采用高速跳频(Frequency Hopping)和时分多址(Time Division Multiple Access，TDMA)等先进技术，支持点对点及点对多点通信。其传输频段为全球公共通用的2.4 GHz频段，能提供1 Mb/s的传输速率和10 m的传输距离，并采用时分双工传输方案实现全双工传输。 4. 在一个微微网中，所有设备的级别是相同的，具有相同的权限。主设备单元负责提供时钟同步信号和跳频序列，从设备单元一般是受控同步的设备单元。\n链路管理协议层利用状态机定义了设备的五中状态\n就绪 扫描 广播 发起 连接 WiFi技术 WiFi技术的基本概念 定义： 一种可以将个人计算机、手机设备等终端以无线方式互相连接的技术。 WiFi（wireless Fidelity），在无线局域网领域称为“无线相容性认证”，是一种无线网络通信的品牌，有Wi-Fi联盟所持有，目的是为了改善基于IEEE802.11b标准的无线网络产品之间的互通性。 WiFi既是一种商业认证，也是一种无线联网技术； WiFi技术的优点：可移动、实现简单、可靠性强、环保指数高； 无线局域网（Wireless Local Area Network，WLAN） 无线局域网（WLAN）工作频段\n按照国家的无线电管理部门规定，WLAN使用2.4GHz和5.8GHz两个频段。这两个频段属于特高频和微博范围，属于微波波段（波长小于一米） 2.4GHz频段信道划分： 可用的宽带为83.5MHz，划分13个信道，每个信道宽为22MHz，信道之间有间隔，间隔5MHz。2.4GHz频段信道划分如下图所示：\n5.8GHz频段信道划分： 在中国大陆，IEEE802.11a使用的是5.98GHz频段，工作频率范围为5725-5875MHz。可用信道为5个，分别为149，153，,157，,161，165，每两个信道之间相差4，信道之间没有间隔。 无线局域网（WLAN）的架构 无线局域网参考模型与OSI七层参考模型如下图： IEEE802标准遵循ISO/OSI 参考模型的原来规则确定最低两层——物理层与数据链路层的功能，以及与网络层的接口服务、网络互联等有关的高层功能。 2. 无线局域网（WLAN）的重要协议\nIEEE最初制定的无线局域网标准主要用于解决 办公室局域网 和 校园网 中用户以及 终端的无线接入 问题，其业务主要限于数据存取，其速率最高只能达到2Mpbs。 由于它在速率和传输距离上都不能满足人们的需要，IEEE小组又相继推出了802.11b、802.11a、802.11g、802.11n、802.11ac等一系列标准。 (1) WLAN技术具有以下优势\n灵活性强，终端设备可以在WLAN网络的覆盖范围内任意放置和低速移动。 部署成本较低，省去了终端设备综合布线的费用。 扩展能力好，增加AP就可以增大容量和覆盖范围。 技术成熟，在国外已经得到广泛的应用。 采用了扩频技术和加密机制，具有较强的抗干扰性和网络保密性，安装简单。 (2）帧的种类和用途如下:\n数据帧:用来传送数据，不含任何数据的空帧也属于数据帧。 控制帧:控制媒体存储的各种帧。 管理帧:与无线网络运作有关的帧，例如无线设备的连接，身份认证等等。 ESP8266单片机 ESP8266模块的开发语言C语言 ESP8266模块有1个模拟输入管脚 常用函数 WiFi.begin(ssid,pass)： ssid: 热点的名字 pass：热点的密码 WiFi.mode()：设定wifi的操作模式，其参数值为: WIFl_AP,WIFl_STA,WIFI_AP_STA或者WIFI_OFF WIFI_OFF:关闭WiFi WIFI_STA:设置成Wi-Fi终端 WIFI_AP:设置成Wi-Fi网络接入点(基站，热点) WIFI_AP_STA:-设置成Wi-Fi网络接入点以版终端 WIFI.getMode():返回当前的WIFI模式，上述四种模式中的一种。 WIFI.softAP(ssid):创建一个无线局域网热点。这个热点允许其他设备（如手机、电脑等）通过Wi-Fi连接到ESP8266。参数 ssid 是要创建的Wi-Fi热点的名称，是一个字符串类型变量,最多31个字符。 WiFi.softAP(ssid,password,channel,hidden,max_connetion)：设置受密码保护的网络或配置其他网络参数，此功能的第一个参数是必须的，其余四个是可选的； password 带有密码的可选字符串。对于WPA2-PSK网络，其长度至少应为8个字符。如果未指定，则接入点将打开，任何人都可以连接（最多63个字符）\nchannel（可选参数） ：指定SoftAP要使用的Wi-Fi信道。不同的国家和地区有不同的可用信道范围，我国的信道范围规定,选择一个相对空闲的信道有助于提高无线通信质量。\nhidden（可选参数） ：如果设为true，表示创建一个隐藏网络，即不广播其SSID，这样其他设备不能通过常规方式自动扫描到该热点。用户需要手动输入正确的SSID才能连接。\nmax_connection（可选参数） ：定义允许同时连接到SoftAP的最大客户端数量。超出这个数目的设备将无法再加入此Wi-Fi网络。\nsoftAPgetStationNum()：获取连接的soft-AP接口的站点数WiFi. softAPdisconnect(wifioff)，功能会将当前配置的SSID和soft_AP的密码设置为空值，该参数wifioff是可选的，如果设置为true，将关闭soft-AP模式 WiFi.softAPIP(): 返回访问点的网络接口的IP地址，返回值是IPAddress类型。 WiFi.softAPmacAddress(mac): 函数接受一个参数mac，该参数是指向内存位置的指针（一个uint8_t大小为6个元素的数组），以保存mac地址。函数本身返回相同的指针值。 Station模式 首先AP发出信标(beacon)帧，意思就是我在这里，谁来连接我啊; 移动工作站 也会发出探(probe)帧，意思是有谁我可以连接啊。这个是工作站主动发出来的，每隔一定时间发出一次。 所以，根据这点，可以产生很多有价值的应用。比如你的带WiFi功能的手机，即使不连接wifi的情况下，只要打开WiFi功能，就可以被路由器截获这帧信息，路由器收集之后，你的信息就会被一个审计的东西发到服务器上，你手机号xxx上线时间xxx下线时间xxx都浏览了那些网页，WiFi建立连接过程都一目了然，你的位置也全都暴露了，这就叫WiFi探针。\n具体流程如下所示:\n探测请求过程： STA：设备 ————\u003eProbe Request(探测请求)—\u003e AP：热点\n返回应答帧： STA\u003c———– Probe Response \u003c———– AP，这个是由wifi（热点）返回的应答帧;\n接下来是身份验证过程，可以使用诸如 WEP、WEP2、WPA 等加密方式应用到认证请求上;\n身份验证过程： STA ————\u003e Authentication Request ——–\u003eAP 认证请求中包含认证 Auth类型，Open System , Shared Key等信息，路由器返回认证结果;\n连接请求 STA\u003c———— Authentication Response\u003c——— AP连接请求; STA————\u003e Association Request ————\u003eAP请求与AP建立关联，从而可以进行数据交互;认证过连接请求OK返回。\n数据传输 STA\u003c————- Association Response\u003c———– AP\n#include \u003cESP8266WiFi. h\u003e #define ssid\"ESP8266\" #define pssd\"123456789” const char* stassid= \"doit\"; const char* stapssd = \"doit3305\"; void setup(){ // put your setup eode here, to run once : serial.begin(115200);//波特率设置为115200 wiPi.mode(WIFI_AP_STA);//设置WIFI操作模式为WIFI_AP_STA,即接入点以及终端 wiPi.disconnect();// wiri.begin(stassid, stagssd); while(WiPi.status() !=L_COHIEECTED){ delay=(500) ; Serial.print(\"\".\"\"); } serial .println(\"TIFI connect sucess\") ; serial. println(WiPi.localIP()); WiPi.softAP(ssid,pssd);//连接WIFI IPAddress ip=wiPi.softAPIP();//softAPIP()返回网络接口IP地址，返回值为IPAddress serial . println(ip): Serial . println(wiPi.softAPmacAddress().c_str()); } void loop(){ //put your main code here, to run repeatedly : Serial.printf(\"Station conneted to soft-AP = %d\\n\" ,WiPi.softAPgetStationJlun());//softAPgetStationJlun获取soft-AP接口的站点数 delay=(5000); }TCP/IP协议 TCP/IP不是指特定的某一个协议，而是一个协议族，包含众多的协议。\n互联网通信的本质是数字通信，任何数字通信都离不开通信协议的制定，通信设备只有按照约定的、统一的方式去封装和解析信息，才能实现通信。互联网通信所要遵守的众多协议，被统称为TCP/IP .\nServerd的应用 与之相关的函数：\nServer ：服务器是所有基于WIFI Server的基类， Server()函数：创建一个服务器，以侦听指定端口上的连续； Server(port) 参数port:侦听的端口（int类型）； 返回值：无 如下为一个Server应用的代码，代码实现了用开发板连接手机开的热点，然后在手机上输入串口监视器打印的IP，然后可以看见显示 “analog input:2” 的网页。\n#include\u003cESP8266WiFi.h\u003e cconst char* ssid = \"LW\"; const char* pssd = \"ping123456\"; WiFiServer server(80);//侦听端口，无返回值 void setup() { // put your setup code here, to run once: Serial.begin(115200); Serial.println(); Serial.printf(\"connetctint tu %s\",ssid); WiFi.begin(ssid,pssd); //连接wifi while(WiFi.status()!=WL_CONNECTED) //等待连接wifi { delay(500); Serial.print(\".\"); } Serial.println(\"connected\"); server.begin(); //侦听服务器 Serial.printf(\"web server started,open %s in a web browser\\n\",WiFi.localIP().toString().c_str()); } String prepareHtmlPage() //返回网页浏览器 { String htmlPage= String(\"HTTP/1.1 200 OK\\r\\n\")+ \"Contect-Type:text/html\\r\\n\"+ \"Connerction:close\\r\\n\"+ //连接关闭请求 \"Refersh:5\\r\\n\"+ //5秒刷新一次网页 \"\\r\\n\"+ \"\u003c!DOCTYPE HTML\u003e\" + \"\u003chtml\u003e\"+ \"analog input:\" + String(analogRead(A0))+ \"\u003c/html\u003e\"+ \"\\r\\n\"; return htmlPage; } void loop() { // put your main code here, to run repeatedly: WiFiClient client = server.available(); //检测是否有客户端存在 if(client) { Serial.println(\"\\n[Client connected]\"); while(client.connected()) //判断客户端是否连接成功 { String line = client.readStringUntil('\\r'); //每行读取到r结束 //等待服务器的应答 if(line.length()==1\u0026\u0026line[0]=='\\n') { client.println(prepareHtmlPage()); break; } } } delay(1); }TCPClient函数 相关函数介绍\nconnect()描述：\r连接到构造函数中指定的IP地址和端口。返回值指示成功或失败。使用域名( ex:google.com）时，connect()还支持DNS查找。\r句法:\r- client.connect(ip,port)\r- client.connect(URL,port)参数\rip: 客户端将连接的ip地址（4个字节的数组)\rURL: 客户端将连接到的域名（字符串，例如: \"arduino.cc\"）\rPort: 客户端将连接到的端口（ int）\r返回值：如果连接成功，则返回 true;\r否则，返回false\rprint()描述：\r将数据打印到客户端连接到服务器。将数字打印为数字序列，每个数字为一个ASCI字符句法:\rclient.print(data)\rclient.print(data,BASE)参数\rdata:要打印的数据（char,byte,int,long或string）\rBASE（可选）:打印数字的基数:DEC代表十进制（基数10），\rOCT代表八进制（基数8），\rHEX代表十六进制（基数16\u003e\r客户端访问服务器流程\n连接到Wi-Fi 选择服务器 实例化客户端WiFiClient client; 把客户端连接到服务器 请求数据 读取来自服务器的回复 实现代码如下： #include \u003cESP8266WiFi.h\u003e const char* ssid = \"LW\"; const char* pssd = \"ping123456\"; const char* host = \"www.baidu.com\"; void setup() { // put your setup code here, to run once: Serial.begin(115200); Serial.println(); Serial.printf(\"connecting to %s \",ssid); WiFi.begin(ssid,pssd); while(WiFi.status()!=WL_CONNECTED) //等待WIFI连接成功 { delay(500); Serial.print(\".\"); } Serial.println(\"connected\"); } void loop() { // put your main code here, to run repeatedly: /* String host=\"\"; while(Serial.available()\u003e0) { host += (char)Serial.read(); delay(2) } */ //char host[30]; // for(int i=0;i\u003c30;i++) // { // host[i]='\\0'; // } // while(Serial.available()\u003e0) // { // host += (char)Serial.read(); // delay(2) // } // WiFiClient client; Serial.printf(\"\\n[connecting to %s ...\",host); if(client.connect(host,80)) //连接服务器成功 { Serial.println(\"connected]\"); //访问google.cn的报头，采用GET方式， Serial.println(\"[Sending a request]\"); client.println(String(\"GET/\")+ \"HTTP/1.1\\r\\n\"+ \"Host:\"+host+\"\\r\\n\"+ \"Connection: close\\r\\n\"+ \"\\r\\n\" ); Serial.println(\"[Response:]\"); while(client.connected()||client.available()) //等待如果客户端已经连接，并且有数据到来 { if(client.available()) { String line = client.readStringUntil('\\n'); //从缓存区读取服务器的数据 Serial.println(line); } } client.stop(); //停止客户端 Serial.println(\"\\n[Disconnected]\"); } else { Serial.println(\"connection failed !\"); client.stop(); } delay(5000); }HTTP协议简介 当使用浏览器(客户端)访问一个网页时,大致经过了以下三步:\n用户输入网址后,浏览器(客户端)会向服务器 发出HTTP请求 ; 服务器收到请求后会返回HTML形式的文本以响应请求; 浏览器收到服务器返回的HTML文本后,将文本转换为网页显示出来。 HTTP请求 当客户端访问网页时,会先发起HTTP请求。HTTP请求由三部分组成,分别是 请求行、请求报头 和 请求正文。\nHTTP响应 服务器在接收到HTTP请求消息后,会返回一个响应消息。HTTP响应也是由三个部分组成,分别是状态行、响应报头和响应正文。\nUDP协议 用户数据报UDP有两个字段:数据字段和首部字段。首部字段很简单，只有8个字节(图5-5)，由四个字段组成，每个字段的长度都是两个字节。各字段意义如下:\n(1)源端口 源端口号。在需要对方回信时选用。不需要时可用全0。 (2)目的端口 目的端口号。这在终点交付报文时必须使用。 (3）长度 UDP用户数据报的长度，其最小值是8（仅有首部)。 (4)检验和 检测UDP用户数据报在传输中是否有错。有错就丢弃。\n程序流程：\n设置ESP8266工作在station模式（ WiFi.mode(WIFI_STA)) ;②将ESP8266接入到wIFI网络中WiFi.begin(SSID,PSSD); 实例化WiFiUDP对象指定端口，建立UDP连接，连接后自动开始侦听传入的数据包。 WiFiUDP Udp; Udp.begin(localUdpPort); 等待输入的UDP包处理收到的数据并回复。 Udp.parsePacket ( ) ; Udp.read(incomingPacket,255); Udp.beginPacket(Udp.remotelP(), Udp.remotePort()); Udp.write(replyPacket); Udp.endPacket(); /* 1、设置ESP8266工作在station模式（WiFi.mode(WIFI_STA)）; 2、将ESP8266接入到WIFI网络中WiFi.begin(SSID,PSSD); 3、实例化WiFiUDP对象指定端口，建立UDP连接，连接后自动开始侦听传入的数据包。 WiFiUDP Udp; Udp.begin(localUdpPort); 4、等待输入的UDP包处理收到的数据并回复。 Udp.parsePacket（）; Udp.read(incomingPacket, 255); Udp.beginPacket(Udp.remoteIP(), Udp.remotePort()); Udp.write(replyPacket); Udp.endPacket(); */ #include \u003cESP8266WiFi.h\u003e #include \u003cWiFiUdp.h\u003e const char* ssid = \"iPhone\"; const char* password = \"peng2020\"; WiFiUDP Udp; unsigned int localUdpPort = 4210; // local port to listen on char incomingPacket[255]; // buffer for incoming packets char replyPacket[] = \"Hi there! Got the message :-)\"; // a reply string to send back void setup() { // put your setup code here, to run once: Serial.begin(115200); Serial.println(); Serial.printf(\"Connecting to %s \", ssid); WiFi.mode(WIFI_STA); WiFi.begin(ssid, password); //开始连接WIFI while (WiFi.status() != WL_CONNECTED) //等待连接 { delay(500); Serial.print(\".\"); } Serial.println(\" connected\"); Udp.begin(localUdpPort); //指定本地连接端口号 Serial.printf(\"Now listening at IP %s, UDP port %d\\n\", WiFi.localIP().toString().c_str(), localUdpPort); } void loop() { // put your main code here, to run repeatedly: int packetSize = Udp.parsePacket(); //调用函数解析数据包 if (packetSize) { // receive incoming UDP packets Serial.printf(\"Received %d bytes from %s, port %d\\n\", packetSize, Udp.remoteIP().toString().c_str(), Udp.remotePort()); int len = Udp.read(incomingPacket, 255); //从缓存区读取数据 if (len \u003e 0) { incomingPacket[len] = 0; //给缓存区加结束符 } Serial.printf(\"UDP packet contents: %s\\n\", incomingPacket); // send back a reply, to the IP address and port we got the packet from Udp.beginPacket(Udp.remoteIP(), Udp.remotePort()); //指定远程连接地址和端口号 Udp.write(replyPacket); Udp.endPacket(); } }HTTP与MQTT协议对比 不同于HTTP的标头采用文字描述，MQTT的标头探用数字编码，整个长度只占2位元组，等同两个字元，后面跟著讯息的主题(topic)和内容(payload)，实际格式如下:\nQoS(品质)设定 QoS代表发布者与代理人，或者代理人与订阅者之间的传输品质。MQTT定义了0,1和2三个层级的品质设定（实际支援情况依伺服器软体而定，Mosquitto伺服器全都支援)∶0:最多传送一次(at most once) 1:至少传送一次(at least once)2:确实传送一次(exactly once) 用寄信来比喻，QoS0就像寄平信，不保证讯息会送达。\n阿里云平台 物联网云平台：接收设备上报的数据、向设备下发数据、对数据进行转发/分析/计算/显示、管理设备… #include \u003cESP8266WiFi.h\u003e//安装esp8266arduino开发环境 static WiFiClient espClient; #include \u003cAliyunIoTSDK.h\u003e//引入阿里云 IoT SDK //需要安装crypto库、PubSubClient库 //设置产品和设备的信息，从阿里云设备信息里查看 #define PRODUCT_KEY \"k0mzriwvgtZ\"//替换自己的PRODUCT_KEY #define DEVICE_NAME \"LED2\"//替换自己的DEVICE_NAME #define DEVICE_SECRET \"674c24074d05a31a672094c0d23dc07c\"//替换自己的DEVICE_SECRET #define REGION_ID \"cn-shanghai\"//默认cn-shanghai #define WIFI_SSID \"LW\"//替换自己的WIFI #define WIFI_PASSWD \"ping123456\"//替换自己的WIFI #define PIN_LED 2 //LED unsigned long lastMsMain = 0; void setup() { Serial.begin(115200); //pinMode(LED_BUILTIN, OUTPUT); // digitalWrite(LED_BUILTIN, HIGH); pinMode(PIN_LED, OUTPUT); digitalWrite(PIN_LED, HIGH); //连接到wifi wifiInit(WIFI_SSID, WIFI_PASSWD); //初始化 iot，需传入 wifi 的 client，和设备产品信息 AliyunIoTSDK::begin(espClient, PRODUCT_KEY, DEVICE_NAME, DEVICE_SECRET, REGION_ID); //绑定一个设备属性回调，当远程修改此属性，会触发LED函数 AliyunIoTSDK::bindData(\"LED2\", LED); } void loop() { AliyunIoTSDK::loop();//必要函数 if (millis() - lastMsMain \u003e= 2000)//每2秒发送一次 { lastMsMain = millis(); //发送LED状态到云平台（高电平：1；低电平：0） AliyunIoTSDK::send(\"LED2PIN\", digitalRead(PIN_LED)); } } //wifi 连接 void wifiInit(const char *ssid, const char *passphrase) { WiFi.mode(WIFI_STA); WiFi.begin(ssid, passphrase); while (WiFi.status() != WL_CONNECTED) { delay(1000); Serial.println(\"WiFi not Connect\"); } Serial.println(\"Connected to AP\"); } //灯的属性修改的回调函数 void LED(JsonVariant L)//固定格式，修改参数l { int LED = L[\"LED2\"];//参数l，与标识符一致 if (LED == 0) { digitalWrite(PIN_LED, HIGH); } else { digitalWrite(PIN_LED, LOW); } Serial.printf(\"收到的LED是：\"); Serial.println(LED); }",
    "description": "",
    "tags": "物联网工程",
    "title": "物联网通信技术-小知识",
    "uri": "/branch-bundle-1/4.esp8266_wifi/21%E7%BA%A7%E7%89%A9%E8%81%94%E7%BD%91%E9%80%9A%E4%BF%A1%E6%8A%80%E6%9C%AF%E5%A4%8D%E4%B9%A0/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: D1-51单片机",
    "uri": "/categories/d1-51%E5%8D%95%E7%89%87%E6%9C%BA/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 8.51单片机",
    "content": "不知道keil5从哪个版本开始就不支持了晶振的设置操作，我在网上搜也得到不同的答案，所以从哪个版本开始限制这就不提了， 好在这样的改变并不会形象我们使用keil5。最近在刚进阶学习stm32，用到了pretues_8.11 仿真软 件和keil5代码编辑器，自己把心中所得分享一下。\n别人编译编译成功的工程，我另外用keil5打开编译为什么会失败？\n假设你拿到的别人的工程所选芯片为stm32f103VC，那么你在另外的电脑打开keil5，在设置里选芯片也是stm32f103VC，如果选的芯片与工程最初选的型号不同，那编译可能会失败，接着在打勾生成.hex文件。\npretues里没有找到keil5里选择的芯片，能用别的芯片代替吗？\n答案是可以的，但尽量使用版本更高的芯片，使之能向下兼容，在keil5如果选了stm32f103VC，而pretues仿真的芯片是stm32f103C6，那么你并不用担心芯片不对应而导致你仿真失败。\n在pretues导入.hex文件后直接开始仿真，为什么报了许多错误？\n可能原因：在选择好.hex文件后，还必须设置晶振频率，即12MHz，如果没置会导致仿真失败，另外你不用担心选择的.hex文件路径有中文，我测过即使导入文件路径有中文也可以正常运行。\n附件 ",
    "description": "",
    "tags": [
      "代码烧录",
      "报错与解决"
    ],
    "title": "pretues+kiel5仿真软件配合使用时需要注意的地方",
    "uri": "/branch-bundle-1/8.51%E5%8D%95%E7%89%87%E6%9C%BA/%E4%BB%A3%E7%A0%81%E7%83%A7%E5%BD%95/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 代码烧录",
    "uri": "/tags/%E4%BB%A3%E7%A0%81%E7%83%A7%E5%BD%95/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 二、小 说",
    "content": "第一章 与君初相识 高中那会儿我老失眠，原因一言难尽。\n记得有一次我去吃饭，遇到张君，我们聊闲聊中，谈到了我失眠的事，张君听了说，他们有个朋友以睡觉为己任的人。我不信，哪有这种人？\n几天后张君竟把他介绍给了我，我们仨还一起去吃了饭，顺便逛了街，特别是喝奶茶的时候，张君故意给我和他有二人空间，整得像相亲似的，而后只是聊了些生活学习上的问题……在买花的时候我叫住他：“那个？”\n没想到他没听见，“听说你以‘睡觉’为己任，”我提了声音又叫了一遍，搞得自己有些尴尬：“是真的？”\n他一脸疑惑，又露出让人想笑的表情，道：“what?”\n气氛顿时尴尬，我有些不好意思，手挡了挡额头，说了句，没什么。回头继续吃着烧烤便不再问什么，寻思着张君的话自己也信？\n傍晚有些冷，校门就是我们的最后一站，老天在天角涂了层口红，不知道什么色号的，仔细看还挺美的。突然，岭正叫住了我，道：“都是为了我的下一代!”\n我一时间没反应过来，以为他在与别人对话，不想他似有深情地看着我，补充道：“所以，你要好好睡觉才行！”\n而后迷人之笑，怎么说呢？看着像在演戏一样，感觉这种桥段只有小说电视里才有，让我又懵又有些难为情，一时想不到什么好的词，只好顶着职业假笑示意“好的”。 “绘妹妹，”回寝室路上张君调侃道：“你要好好睡觉哦。”而后一阵哈哈大笑，我急忙想制止她，可越要这么做她就越要说，越说越开心。\n回宿舍后我细品了岭正的话，总感觉有什么意思在里头，但时间久了便不再放在心上。\n……\n后来张君不怎么提他，我倒是期待着张君说点关于他的什么，至于为什么这么想，我不敢究其原因，也不想问张君 ，只想着张君能和我说说，明明是些琐碎的事罢了，再次回忆，便不由自主地想起那些人，那些事。\n三个月后的一天，张君突然问我，还记得不得上次给你介绍的帅哥。我说，帅哥不记得了，只记得有个人说什么好好睡觉。随后聊的具体内容记不太清，依稀记得张君说，他转到了我们学校，而且在我们隔壁班。这算个惊喜吗……在我的生活里没那么多惊喜，也许眼睛会和惊喜反应，“生成”眼睛和平平无奇。\n分班后的一天，我去找张君，问她在哪个班。张君告诉我，他们班在一楼，离食堂最近。她还说，一般来说，学校的食堂都挺干净的，外面的不怎么卫生，可绘啊！我还是喜欢吃外面的，特别是小帅哥带来的。\n我说：“又是用美色挣来的吧！”\n张君听到后哈哈笑了，笑声爽朗，我也跟着笑了起来，和她总能这么开心，但是，笑过之后我却突然感觉心情有些沉重。因为在上个学期期末考试结束后，我看到她和另外一个男同学坐在靠窗的位置上，他们俩个正在讨论着什么。他们的讨论是那样的热烈和激情，这是我从未见到过的。这一刻，我不知为何渴望着融入他们。\n第二章 仲夏夜之星 张君看着楼道下，一个小巧的女孩正一步一步走来，她知道是谁，长舒了一口气，转身对着小峰说道，小峰，我好像有点喜欢上你了。小峰一时还转不过来，刚刚还在讨论高考的试题，现在怎么……小峰没说什么，故意移开视线看着试题，张君，又继续道：\n“可以牵牵我的手吗？一会儿，就一会儿。”张君抿了抿小嘴，“不说话就是默许。”张君不再犹豫，牵起了小峰的手。小峰面颊泛红，激动又开心，温暖的小手，好像柔软的云朵，微风拂过两腮，不经意让小峰忆起往事。他想：现在怎么也不想松开这个女孩的手了，因为这一天小峰已经等了很久很久了。\n四年前的一个夜晚，我打球准备回宿舍，在收拾时，看到张君一个人独自坐在长椅上，篮球场两排明亮的灯光照在她的身上，泛着光，影子投影到地面综错散乱，被拉成常常的弧线，我走了过去，夜晚的榕树下凉得让人想就地睡觉，有些疲惫的我边走边拉伸着身体。\n“唉，在这干嘛呢？”\n“哟，打球呐。”张君寻着熟悉声音，看向小峰，确认是他后，说道：“出来乘凉。”\n“切，女生宿舍不有风扇吗？”\n“你以为想吹就吹啊！那也是要看舍友滴……女生的世界，你个男生不懂。”\n小峰擦了擦头，看着地面道：\n“谁tm大晚上跑出来乘凉啊？现在又不是夏季。”\n“小峰，如果有个男生喜欢你……”张君长叹，又咽了咽口水，慵懒的说：“你们……”\n“什么？男的！那不搞基吗？”\n“呀，什么搞基啊，认真听我说嘛！”她继续道：“她还是你同学，你怎么办？”\n“拒绝啊……为什么？当然是因为我喜欢女孩子啦，而且我接受不了……如果吗？哪有什么如果，你这是假设，这样的场景和画面我敢都不敢想像，怎么你搞……” 张君插话道：“什么什么呀！好好说话好不好。”\n那天我想着要再次向张君表白，当时气氛尤为适宜，夜晚的操场很快人离影散，满天的星空捧着圆月，远远的传来葡萄架下的蟋蟀的奏鸣曲，好像拉小提琴一样，悠长而又慢慢地穿到我和张君这，操场的灯光还明着，铺洒一地，犹如海浪扑来，直冲张君的脚下，瞬间在身上如水浸透白纸般，我坐在长椅较暗的地方，一身好像穿着高雅的西服，一切都让我内心波涛汹涌。\n我们似乎同时说出了对方的名字，我有些不好意思，他亦如此，我便让他先说。\n“我被个女孩喜欢上了，她是我要好的朋友，看着小颗小颗的，纤弱又可爱，让我……不由自主产生保护她的心理，可是我不想因为这件事破坏我们的友谊……”\n聊了会，交谈中张君告诉了我那人的名字，知道后也有些震撼，也许那时候不知道什么是喜欢，什么是爱，所以我不能理解她们的关系和情愫。正说着，我们看到校警摸着电筒，四处照射，似个夜间丛林里的猎人，我们也结束了相关的话题。\n那后我渐渐的对她们之间的关系有些不自在起来，虽然如此，但我对张君的心却一直不变，对她仍存一丝丝希望，期待着有一天她回头，可以见到我还在原地等她归来，我无法忘记我与她们一同“出境”的尴尬处境，特别是虚假地做她男友，在喜欢她的人面前，把恋人的关系发挥到极致的事，我讨厌又害怕，犹如一场美梦，醒来却是肮脏的现实，噩梦般的现实。\n记得有一次我还因此谎称生病，停了一周的课，可我忘不掉张君，我依旧喜欢她，我想和她来一次真正的恋爱，不一定热烈浪漫，但一定真实难以忘怀。在高中时我就知道她其实不喜欢我，可我还是默默等待着，在漆黑的夜晚做个可怜的人。\n等我明白渐渐理解，和解这些事时，那已是许多年后的事了，张君也早已远嫁他乡，他乡的那颗星也一直在我可以看到的地方闪闪发光。\n第三章 剪不断，理还乱 苏绘走上楼梯，走廊传来张君的声音，他们讨论着今年高考各科试卷。\n我纳闷一个文科生，一个理科生的，有什么好讨论的？我知道此刻我是羡慕的，想想自己摸底考自己就是一个失败者，失败者，失败者……\n我苦涩地一笑，恰巧张君见状问道：“绘，怎么了？”\n我回过神，道：“没什么。”\n等我微微抬头——张君和小峰的手十指相扣，看着好像他们的手被牢牢焊死，原来刚刚的男孩是小峰，为什么，为什么，那背影，那声音完全是另外的人。对我是那样的尊敬，玩笑都开不起，而对张君却畅言所欲，小峰， 小峰……我的内心一声又一声，就像远山传来的回音。\n张君闻言大笑：“哈哈哈……你这个形象真好笑，对了告诉你哦，我和小峰确立关系了哦，今晚要不要庆祝一下下。”\n张君说的小峰，是我认识的人，那会还初中，我一直觉得小峰比较内向，又有点高冷，可现在看来它和张君的性格都比较随意，所以关系也建立得很快，现在都是情侣了。我和张君是从小认识的，可以说我们是死党，我总喜欢调戏她和她的堂弟云，和他们关系特别好，我觉得我是他们最好的朋友，所以总是会开开些无伤大雅的玩笑。\n“干嘛呢？开玩笑的，我和小峰没交往，”和小峰分开后，张君说了实话，可我当时并不相信，即使她说，有个人喜欢他，小峰为了避开她，他们就演演喽。\n“我说嘛！君姐怎么会那么快换男朋友嘛！”\n“啊？”张君看着我，愣了会儿，说道：“那不是。”随后我们鹅鹅地笑出声。\n后面我和张君又聊了几句，然后就各回了各自己的寝室，我推开寝室进去，一片死寂充斥着寝室，我坐在床边，呆呆地看着天花板，突然觉得心里一阵空落落，仿佛心底里丢失了一个什么东西，很难受很难受。\n张君，小峰和岭正分到了一个班，他们三个在班级里很低调，也不敢在学校里表露出他们三个的关系，毕竟那个班有些特殊，或许是不想引起别人的注意吧。不知道从什么时候开始自己躲在暗角默默地暗恋着岭正，对岭正的记忆自从分开后慢慢从脑海中消失，突然我想起，张君说的，我以后可能会是他的妻子，虽然我知道这是个假的概率，毕竟我和他还没到那一步，但心底里却不免升腾起一丝妄想，这些妄想也随着时间一天一天蒸发殆尽，为了不让这样的念头消失，我试着与他见面。我知道我配不上他，但是心底深处，却有些隐隐约约的期盼，期盼着有一天，我们能够在校园偶遇，在校园内，能够成为朋友，这样，我就能够时时刻刻，见证我和他在张君心目中的地位了。\n一晃一年的时间，转瞬即逝。\n我和张君、小峰、岭正他们的联系少之又少，除了偶尔见面聊聊，别的联系少之又少。\n我们似乎都各奔东西了。\n第四章 再忆江南曲 大一的一天晚上，我一个人躺在床上，想着和张君的点滴往事，我想起了我们初入江南高中时那个阳光开朗的张君，想起了那个总是喜欢逗我，却从来没有欺负我的云，想起了初中我第一次在学校的篮球场和小峰见面的那个早晨。\n初中篮球场。\n那一天天气格外炎热，有些受不了的直接不来，有些则虚弱地装一下，老师自然是信的，这样的天气搞不好真的会中暑呢。小峰注意班上的班花很久了，从军训那天开始，他就一直关注着她，报体育委员也是因为有她的名字，只可惜她没选上。这天，女子篮球组在练习，\n“唉！她身边老跟一个家伙”\n“什么家伙，人家有名字，叫苏绘。”\n“耶，你们认识？”小峰的同学手靠在他肩上，说道：“什么时候的事。”\n“唉，小学那会儿了，不过她是隔壁班的，她应该不记得我。”\n小峰看要到他们组训练了，顾不了那么多了，直接上前与班花搭话。\n我们第一次见面。小峰说：“如果你愿意当我的女朋友，我可以考虑带你进军篮球队。”当时张君愣了好一会，我也一样，这句话他是对张君说的，想想当时他是体育委员，我只不过是个连投球都不会，还硬要参加女子篮球队的家伙，自己真的傻得可怜。\n张君看了看绘，对她说，绘可以帮我去拿一下纸巾吗，在那边的树底下，谢谢。\n看着绘远去，张君提高了些声音，说道，你有那本事，我就答应。\n小峰一脸春风拂面，说道：“你说的，别反悔。”\n想到这我觉得那件事张君是刻意这么做的。\n第五章 终章 那时的我还是一个不谙世事的毛丫头，看着张君与小峰在一起，自己竟眼红了起来，那段时间一切的事情都只想着怎么和岭正在一起，我每天都在幻想着和他有朝一日可以成为男女朋友的画面，但是，一切的梦境都只是梦境而已，在现实里，我和他永远也不会在一起。想到那天鼓气勇气与岭正告白，却被拒绝的画面……眼泪不知怎的流出眼眶，打湿脸颊，黑夜抚摸着我，似乎在特意安慰，可我内心久久无法平静，久久无法入睡。\n翻来覆去怎么也是那美好而又难过的岁月。\n那天，我去学校图书馆借书，张君的书包落在图书馆里。张君让我在图书馆外面等一下，张君走了很久，我在图书馆外面站了好久好久，突然有人拍了我肩膀一下，我吓了一跳，猛地回头，见是云，我松了口气，拍了拍胸脯，责怪他道：“怎么走路一点声音都没有，吓死我了。”\n云微笑着，道：“我看你站在外面想事情想得很投入，所以就狠下心打扰你。”\n我问：“你怎么在这里？”\n云说：“我和朋友谈了点事儿，他们让我在这里等。”\n云的那些朋友都是高年级的学生，有男有女，看起来都不怎么好惹的样子，不用说也知道，云在这里肯定是认识不少人的，我心中不禁有些担忧，担心云在这里受到别人欺负。 我问：“你朋友都是些什么人啊？”\n云道：“是我以前的同学，现在都在这个学校里上学，我在这里认识不少人，以后有事儿，找我，我罩着你！”\n我道：“好啊，那我有事儿了再找你吧！”\n云说：“行！”\n云和我说的话很简单，但是，我知道他一定是一个善良的人。\n在外面久久不见张君出来，我的内心莫名有些难受，等待也许就是这样……\n想到这我才知道，那时的自己对张君是怎么样的感情，我就是只愿做信鸽脚下的信筒，即使有天会被丢弃，只要有一刻还在与她在一起，我所忍受的都是值得的，可我一直在她的庇护下，一步一步走向自己的未来，这种种美好而痛苦的记忆我永生难忘，这一生也不会再有。\n写于2021年6月\n",
    "description": "",
    "tags": [
      "校园",
      "爱情"
    ],
    "title": "君绘语",
    "uri": "/textbook/4.%E5%90%9B%E7%BB%98%E8%AF%AD/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 二、小 说",
    "content": "“时间的真的存在吗？”\n我很意外王妈为什么会问我这样的问题，王妈小时候家境不好，没有机会上学，她对我说过，去学校上学的次数十个手指都数得过来。王妈的问题是显而易见的——时间是存在的，我想这么说，但还是如此回答了她：“王妈您怎么突然问我这个？” “没有嘛，你们读书嘛！”她啊了一声，好像对我的答案有些失望，说道：“就想问问你，看你懂不懂。”\n“时间是存在的，你看每天时间都在走，太阳升起，太阳西落……”我有些难受的说道，不知道为什么自己不知不觉的也编不下去了，觉得这个话题是不是太哲学了呢？\n“从前呢，天上有个管理太阳升起，落下的神仙，人们管他叫乍，本来人死后去的地方也是有太阳的，后来就没有了，说是有一天乍在水边叫太阳下山的时候，看到一个老奶奶在水边哭，他就上去问，你怎么在这哭得这么伤心。那个老奶奶回答道，我不想离开我的丈夫，因为他一个人生活会很辛苦。这个时候乍才知道这个老奶奶是一个鬼魂，乍听完说，他在地上活得好好的，你应该高兴。老奶奶还在哭，边哭边抹着泪说，要是你每天让太阳晚点出来，晚点下山，人们就不会死那么早，我也会多陪陪自己的丈夫。乍听完那个老奶奶说完，慢慢的坐下来，跟老奶奶说，每个人心里都有一个太阳，如果把这个太阳丢掉，你就不会再说那样的话，你也就不会那么伤心了。说完乍把太阳收了回去就走了，从那以后死去的人生活的地方再也没有太阳，心里也没有了。”\n听王妈娓娓道来的故事，我内心五味杂陈，我顺意点了点头，早已把王妈刚才的问题丢掉，后来又调皮的和王妈吐槽这个故事，为什么老奶奶不知道一天时间其实是一样的，即使白天变久了，一天还是二十四小时！王妈也只是笑笑，没在说什么，继续自己手里的针线活。\n暑假漫长而又炎热，特别是在东州这一带地方，一天不开空调自己无法在房间里待下去，外面也是闷热，空气划过脸脖，抽离着细小的汗珠和油脂，黏着皮肤的汗珠让人不禁想抓一抓，今天的太阳也是同样的毒辣，闷热的大地烘烤着水面上的水葫芦，可水葫芦似乎未伤分毫，到是蒸熟了一旁的芭蕉——龇牙咧嘴的。\n王妈家住在工厂旁不远处，每每早上六七点和晚上十或十一点就会看到许多打工人出现在小区楼下，他们总是拖着疲惫的身体上班，拖着疲惫的身体下班，在学校我总能看到一些人精神饱满的过着每一天，过着充裕的生活，想到这我不禁感叹：还是待在学校好啊！\n自己来东州游玩也有些许天了，闲下来的时候总要睡午觉，因为住在工厂旁边，午觉的时候总能听到远处工厂传来的“轰隆”声，不是被惊醒，就是与梦境“重影”，构建着一些奇怪的梦境，前些天到处跑，也许是玩的太疯了，现在对外面的美食，风景一点兴趣都没有，只想静静地躺下，午觉醒后在阳台看到王妈在做针线活，于是便上前与她聊了会儿天，关于王妈提出的时间是否存在这一话题，我想大部分人都会回答“是的”吧，想想拿掉后人生活的一切岂不是都失去了本有的意义，不知道什么时候醒，那个点该吃饭，出去玩多久等等，涉及到时间的话题太多，没了时间概念的世界会很无聊的吧！\n“王妈，我爸说我们明天就回家了，您要和我们回宁云吗？”我说道：“去我家玩几天呗！” “明天就走了？”王妈停住了手里的针线活看着我问道。\n“对啊，我爸说出来太久，没钱了。”后面一句是自己对父亲的调侃。\n“哎，你爸打不准蒙你的呐！他呀哪是没钱，估计也是像你玩累了，”她一边朝着我笑，一边继续自己的针线活——转而问道，“你爸还是在你外公那个木厂吗？”\n“早就不在了，几个月前的事情了。”\n“你爸也是不容易，”她叹气道，我回答“也是”后，她继续道：“赘婿呢就是这样了，做什么都得看丈母娘家的脸色，你妈妈家也是呀……想想以前我从村里出来的时候，你妈妈家来的礼就是最贵的，那玩样现在还在我那木箱里呢？” “是个什么东西呀，王妈？”\n“是个织布机。”\n“织布机是那个时候最贵的吗？”\n“你不知道，那个时候我们苗家的姑娘衣服都是自己做的，街上也有卖，但穷人家哪买得起哦,织布机可以做嫁妆，可以做新年衣服……”\n“那岂不是每家都得有才行？不然他们就没新衣服了。”\n“是喽，是喽！”王妈笑着回答道：“那时候有的人来件衣服，来套棉被，还有的是直接给钱的……那时候家家都是得有个织布机，对我们苗族人来说要有的，有嘛都好喔，没有嘛叫人做都要做出来，所以织布机一对比起来就不一样了，你妈妈送我那件做得很好，听说是一个很厉害的木匠做的。”\n“那等你忙完，带我去看看呗。”我倒要看看是什么高档货，王妈这么多年还留着。\n从阳台往里走是大厅，大厅左边有两个房间，两个房子之间隔着上二层楼的楼梯，楼梯下有一道木门通往地下室，打开木门，随着一声喀吱的声音感觉自己走入封存已久的宝库，仓库楼梯扶手是钢焊接不久，下楼梯时能闻到焊接时留下的味道，其间夹杂着木质发霉的味道，沿着台阶往下走，右边挂着一些画和幼儿园、小学的奖状，奖状估计是大厅那边放不下而移到了这里的，奖状上写有王思芳和王季远姐弟两的，还有那个我熟悉的名字杨——白唐，在这边。王妈叫住了我，示意我往下走，我小跑下了楼梯，右拐再下一次楼梯就到了地下室的仓库，地下室就在大厅的下面，被一堵墙分成两半，另一半则是车库，走到楼下刚才木质发霉的味道很快就消散了，地下室灰尘很少，打扫的也很干净，从楼梯下来右手边堆积着许多破旧的书籍，在红色的书架上高高堆叠，远远看着给人一种难以接近的感觉，下边堆积的是一些工具和木质器件，洋枪的枪柄，木凳子，木长椅，甑子，锄头镰刀柄等等，还有很多我都不认识，在靠近车库的右下角就放着织布机，由于常年使用有些地方光滑亮泽，好像刚被涂上树脂漆一样，又好像一个精神抖擞的老奶奶。织布机一共有两台，王妈告诉我小的那一台是后来王爷爷自己做的，属于是织布机的改小版本，而小织布机旁边就是父母送王妈的织布机，现在去网上搜也能找到这种老款的木质织布机，唯一不同的是这台留存着王妈从出嫁到现在的种种回忆，梭子上的光泽，打纬中间因每次缝制衣服都会拉一下而有所磨损，这些也许就是勾起记忆的痕迹吧！雨落红花谢了春，莫熵增！日月颠倒长河归，同与故人醉。织布机上贴着贴纸，贴纸上写着一首这样的诗歌，虽我字字都认识，但古诗赏析什么的绝非我强项。\n“王妈，这首诗是谁写的？”\n“那里……哦，说不定是季远他们胡闹贴上去的，”她小心的撕下贴纸，又小声的骂了季远一通，接着说：“这就是那台织布机，你要是想学王妈教你，打不准那天自己给自己做嫁衣呢！”\n“我吗？还是算了，我针线活也就那样，平时能缝缝补补自己的衣服就好了，至于做嫁衣……算了算了。”\n“多会一样对自己也好的，但是现在人家都用机器弄了，什么衣服都可以弄出来，所以你们这群小鬼把老祖宗的东西都忘干净了。”\n“新时代了嘛，不一样了王妈！”我尬笑的说道。\n王妈笑了笑，似乎准备给我介绍什么，突然手机响了起来，王妈出去接了电话，我便独自一人看着织布机，怎么看也看不出它的高档所在，以及工艺精湛，或许我是我对这方面了解太少，想到这真为自己堪忧，自己到底该了解，该知道什么，越是深入思考这个问题自己就会陷入“无解”的死循环。\n看到刚才的贴纸被王妈丢到了地上，我半蹲拾起贴纸，心里又默默念了一遍，王妈家会写诗的人，除了姐弟两还有谁呢，他吗，可他的语文水平不咋地呢，要写出诗来——一万个不可能！估计是在哪里摘抄的。我起身去看了上边的书籍，一些幼儿园到高中的课本七七八八的叠堆在一起，地上放着各个科目的习题试卷，还有一些配套资料，看到这些我也不禁想起自己的初中生活，想不到这么快就初中毕业了，不论是美好的，还是难过的事就这么过去，一去不复返了，我有时候会不经意间想起某个人，某件事，即使令人难过，那些画面还是会不间断的脑海里浮现，说“忘记那些痛苦难过的事，这些都过去了”的人一定是自欺欺人吧!我想恰恰是这些痛苦难过的事难以忘记，让我们学会珍惜现在，珍惜现在的每一天。\n写于2023年7月\n",
    "description": "",
    "tags": "悬疑",
    "title": "白唐战绛",
    "uri": "/textbook/2.%E7%99%BD%E5%94%90%E6%88%98%E7%BB%9B/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 悬疑",
    "uri": "/tags/%E6%82%AC%E7%96%91/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 二、小 说",
    "content": "牛村与花村仅隔一片红树林，深秋里，满山的红叶铺天盖地，牛村的村尾是个好地方，常聚着城里来的人，就是离阿牛家远了些。\n“嘿！ 阿牛。你要老婆不……不，只要你开……开……金口……”阿牛理着枯萎的草，寻声一看，是那跑腿的阿光，阿光无力地扶着杆，面红耳赤。\n阿牛生硬地答道：“老婆？不要。”\n阿光一身酒气，吐字不清，阿牛手头又忙着，便不再想理他，正要离开，不想阿光一把扯住他，断断续续的说道：“村尾……有靓妹哩！啊哈……看看去，保你……保你……爱。”\n阿牛无奈道：“行了行了，我嘚去花村，忙着呢！”便离开了，而阿光还在牛槽旁自言自语，暗自欢喜着什么。\n乌云渐渐压向红树林，此刻花村也许已倾盆大雨了吧，想到这阿牛便想回家拿伞，正要离开，一声声熟悉的笑声拉住了他的步子，寻声向桥下俯视，那寸头高鼻梁，小眼尖脸蛋，黝黑黄皮肤，臂粗高大个，影子印于桥头，此景定格于此时。\n那熟悉的背影，那熟悉的声音，没错，她就是阿牛的青梅竹马——阿花，还有从小到大一直欺负他的阿狗。\n“哎呀，你轻点……”说话的是阿花，她往前，阿光紧挨着，她手一拣，他手一搭；她手一捻，他手一抓。桥下，一男一女，你前我后，我左你右，动作形如流水，相当娴熟，此刻阿花的声音传到安流这儿，都是嗲里嗲气，而阿光的举止在阿牛眼里，那就是讥笑。\n阿牛气得肝疼，怒骂道：“靠！这厮的真扫兴，呵。”把手里将给未来岳父大人的酒摔了一地，扭头不知将去哪里。一路上阿牛又气，又百思不得其解，他不明白，从小到大，阿花便是自己的玩伴，实打实的青梅竹马，渐渐的她成了阿牛的中意人，阿牛追阿花这些年也没有三心二意，她哭，阿牛安慰；她闹，阿牛捧哄；她病，阿牛照顾。为给她买生日礼物，阿牛千里迢迢，去城里挑玩偶，对于阿牛而言，他愿为阿花上刀山下火海，拼死拼命也要护着他，可是现在她却和别的男人在一起，还是自己憎恨，厌恶的男人。\n阿花听到远处山林“哗哗”作响，又看了天气，便道：“哎，阿狗，要下雨了，咱们回家吧！说不准阿牛哥已经到花村了。”\n“唉！花妹妹，”阿狗忙着收东西，向阿花追去，道：“你别急嘛。”又嘀咕了句，道：”整日阿牛哥，阿牛哥，你眼里就只有他吗？”\n阿花在前边督促道：“狗子，你快点呀，雨要来了。”\n“来了。”\n自那后，阿牛觉得阿花已不再喜欢自己，但自己终又放不下她，可阿牛越想头脑子越乱，越想心里越烦，不久他便同阿光去了村尾。\n那日大雨唏哩哗啦地下后，花村口也不见阿牛哥的踪影，阿花在自家门口，盼着盼着，盼了个寂寞。突然眼前一个身影，“阿牛哥——”她叫道，那人回头——咦！是阿狗，阿狗见了阿花大喜，道：“花……”还没说妹妹，阿花已关了门。阿花爸见她一脸愁，问问咋啦！她唉声叹气，她爸看着庭院外道：“你这娃儿……阿牛怕是这段都不来喽！”\n阿花疑问道：“不来，为啥子嘛！”\n阿huaba笑眯眯的道：“年轻人的那些事我哪懂得嘛！听隔壁张姨说，那天看到阿牛把酒摔在了桥头那哩。”\n阿花愣了一愣，这才想：难不成……呀！阿花起身回了房，不一会儿便带门出去了。\n她爸在院里喊道：“天快黑了，哪去……不吃饭啊！”\n“不吃了，晚点会回来。”回声渐渐从远处传来，此时灯火已经渐渐亮起了。\n一路上，阿花的回忆伴着喘气声，一段一段的在脑子里浮现。那天，“哎呀，你轻点，别把鱼给吓跑了。”阿花说道， 阿狗往阿花那靠了一靠说：“你现在这声音不就把他给吓跑了吗。”阿花无语反驳，一把推开了阿狗。她手一拣，阿狗手一搭，阿华厌恶地瞪了他眼；她手一捻，阿狗手一抓，阿花像抓狂的狒狒一样，怒斥道：“狗子，我告诉你，你最好给我老实点……男女授受亲，你不懂吗！”阿狗摸着后脑勺表示明白。可此景在按钮眼里，似乎是“别样”的风景。\n然后一边跑心里还一边默念：二牛哥不是你想的那样，不是你看到的那样……你……你不要……\n炎炎夏日，一天，阿牛上山背马草，午时正要回阿光家，在田道上遇到几个小伙子在偷窥田间的姑娘，路过时，听到他们议论那姑娘，且尽说些低下话，阿牛听不惯，这烦还在心头，二话不说，上去就是一拳，他们还没反应过来，阿牛又一勾拳，打得那些人七窍流血，这才停手。\n姑娘见有动静，便前来阻止，阿牛呵斥道：“再见到你们说姑娘坏话，我就捆你们去犁田，打断你们的狗腿子……”\n那些人见不妙，便纷纷离开。\n“干嘛打他们……”\n说话的正是田头头的姑娘——瑶妹，蓬松刘海，大麻花长辫，玉颜黛眉，肤白胜雪，水汪汪大眼，娇小玲珑，袅娜丰满，蔚蓝花衣，青黑长裤——真是乡间仙女。阿牛一辈子还真没见过这样的美女人，若不是心里住着阿花，或许此刻他内心早已小鹿也乱撞。他脸颊泛红又低了头。\n突然严肃道：“那些混蛋偷看你还说你坏话，我……我听不惯低下的话，就揍了他们。”\n瑶妹微微笑，绽出两个酒窝，道：“听不惯？是讨厌那样的人吧！”\n“讨厌？”阿牛嘻嘻道：“姑娘看不是本地人，是外地来的吧！”\n瑶妹答道：“不是噢！我的家……老家就在这的。”\n阿牛接过瑶妹，端来的茶水望着瑶妹 ……\n说着，瑶妹便要阿牛回家喝口茶，以表感谢，阿牛也不好回拒，便去了。\n阿花那日去阿牛村找阿牛，没找着，探到阿牛已去了村尾，这天才早早从家里匆匆赶来，正午烈日灼心，阿花看到村尾就在半山腰上，这才为自己捏了把汗，心中也不由得欣喜了些。\n“阿牛哥，你……你……”阿花盘扶在村口门柱上，道：“你这个负心汉啊，我以为你不来家吃饭，是咱们有误会了，不想你是有别的女人了。”\n瑶妹一边揕着茶水，一边道：“还不知道你的名字呢？”\n阿牛：“哦，我叫阿牛。”\n瑶妹迟疑了会儿，说：“是阿牛村的牛哥哥吗？”\n阿牛心一暖，笑咪咪道：“是的，牛村就只有我一个叫阿牛。”\n“我刚从城里回来，真想去村里看看红叶林。”瑶妹看着村外，一面期待地道：“还有去花村划竹排……真的好想你去呢。”\n“这离村里也不是很远，有时间你可以去看看，红叶林，花……”阿牛愣了一会儿才道：“花村那条江也很漂亮的……”\n瑶妹看了看阿牛哥笑了笑，端茶水递给了阿牛哥。\n他正要接过茶水，不想一阵“阿牛哥”，让一下他停住的手。\n他一看——阿花。阿花边走边说，道：\n“阿牛哥，你……你……”\n阿花不小心摔倒在地，叫喊道：“你这个负心汉啊，我以为你不来家吃饭，是咱们那个误会，不想你是有别的女人了。”接着就是一阵哭。\n阿牛急忙跑去扶阿花，那黄油脸，黏着土，蓬乱发，携着泥，小眼肿鼻，淡须大嘴，红色大花衣，黑色大长裤，无不散发着咸味，那猪腩大粗腿，墩墩似柱肚， 瑶妹见了大惊，但又觉得没有哪里不适。\n阿牛正要扶阿花，不想一只手把他推开，那人道：“走开！你个负心汉，枉费花妹妹对你一片痴情。”\n瑶妹对那人骂道：“哥，你干嘛推他……阿牛哥，你没事吧！”\n阿花见到此景怒气冲天，立马起身，阿狗担心道：“唉！花妹妹……”\n瑶妹一边扶起阿牛 ，一边询问他，没事吧，阿牛道：“阿花你怎么来。”阿花看到瑶妹扶着阿牛，欲说的因果一之间烟消云散，不经意间泪流满面，她哭着说 ：“阿牛你口口声声说喜欢我，可你离开就是为了见……见这样的女孩。”\n瑶妹连忙解释：“花姐姐，我想这里面有什么误会。阿牛哥他……”\n“住口！死厚脸皮你个婆娘，”阿花口吐碎沫怒斥道：“牛哥……那么喜欢我，你为什么要抢走他，你个毒辣女……”\n瑶妹一脸委屈，说不出什么话来。\n那流氓出来打断道：“阿花你够了！这是咱俩的事，跟她没关系。”\n阿狗道：“啊，你又看不出啊，你是这样的人，脚踏两条船胆够肥的呀，我看你对阿花好是为了他家那几亩地吧，唉，话都说到这份上了，前些年他娘死也是跟这有关的吧”\n阿牛大怒道：“你不乱说，行吗，没这回事，我对阿花好真心实意，不是图他家那几亩地。”\n阿狗道：“呵呵，谁知道呢，人心难测，况且你现在对阿花移情别恋，呵我看你就不是个好东西，你就是馋他身子下贱！”\n听到这阿牛更怒了，他道：“你说什么……”正说着，阿牛正想给他一拳，不想这个时候，阿花一脚，阿狗伏倒在地，\n阿花大叫道：“放你娘狗屁，阿牛哥对我怎么样？用不着你左一个右一个。”\n阿花转回头，对着阿牛说道：“阿牛哥，我一直觉得那天在桥上那件事是个误会，但是……”\n阿狗一听到桥上，立马机灵了起来，抢在阿花前说道：“哦！我终于明白了，那天你摔酒在桥上是故意的吧，你就是想趁这个机会把阿花给甩了，听说那天不久，你就和阿光去了阿光家，阿光的姐姐一直中意你，这全村人都知道……呵！阿牛你够狠啊！”\n阿花听了，声带似乎打了结，望向阿狗。\n阿牛气头上来，便一拳打在了阿狗脸上，他两在地上狰狞不休，围观者左右难劝，突然，阿花大吼道：“行了！”一时间地上的他俩也停住了手。\n阿花对着阿牛道：“我一直以为那天在桥头上的是个误会，但现在我觉得这确实不是个误会，你所看到的都是真的。阿狗对我比你好多了。”\n说完阿花哭着跑回了村，阿牛坐在地上沉默了很久很久。\n（上篇完）\n写于2020年\n",
    "description": "",
    "tags": [
      "爱情",
      "民风"
    ],
    "title": "阿牛和阿花的爱情故事",
    "uri": "/textbook/1.%E9%98%BF%E7%89%9B%E9%98%BF%E8%8A%B1/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 民风",
    "uri": "/tags/%E6%B0%91%E9%A3%8E/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 二、小 说",
    "content": "第一章 序 火车站往东沿着才华路步行十分钟便到衡岭财经学院，这条路王肖一年会走五六次——多的是回家或回校，他的理想大学是南国大学，虽与之擦肩而过，但南国大学也在衡岭，想到这他觉得这何尝不是一种好的选择。\n“王肖，你参加社团了吗？要不要来我们财经社团。”舍友问道。\n“话说王肖你参加什么社团了吗？”舍长小声的问道。\n王肖放下手中的游戏，“农户养殖协会。”他生硬的说道，大伙都没听清，于是他又重复了一遍。这番话惹得另外一位舍友讥笑道：“还得是你，这才是我们水产品专业该去的。”\n“平时干嘛的？”舍友认真的问道。\n“我怎么知道，加了个会员就不见动静了。”王肖听着他的问题有些不耐烦的回答道，接着继续玩起了自己的游戏，不一会他又解释道：“好像要做干事这些才会有活干，我嘛就是去混分的。”\n没人回答，不做声的何天宇笑了笑，缓解着尴尬的气氛，随后他们开始讨论了何天宇为什么笑？只是王肖不再想接收任何信息，对于这种场面他痛恨自己很多次了。\n晚饭过后，王肖又是一个人去逛街，点了杯烤奶，又买了份炸鸡，边走边吃是他的习惯，果然到宿舍楼下仅剩半杯烤奶，今晚没课舍友都窝在宿舍里打游戏，王肖也不例外，为了打上王者王肖估计是要拼一晚了，他已经做好了打算，白云慢慢的擦拭着月亮，月亮的肤色也渐渐的皎洁明亮，在学校能听到公鸡打鸣是件难得的事，而王肖却不这么认为。\n人有时候熬夜到四五点，便能把困意死死的钉在大脑疼痛之中，然后与似乎垂至暮年的心肝迎接那抹刺痛双眼的朝阳。\n第二天，他早早起床洗漱，然后安安静静的离开宿舍，到校园那片似乎要撑破天的松林，聆听盛夏遗留下来的鸟鸣，还有那些新闻广播专业同学的嗓音，一切听起来为什么这么动听？宛若圣洁的教堂，只是他的教堂不一样。离上课还有十几分钟，他便起身拎包往教学楼走去，结果教室一个人都没有……\n大家都这么懒的吗，就我一个先到，不会吧？他不想表露这份心情，可表情却如此诚实，洋溢着的微笑证明了他真实的内心，紧接着他开始不安，已经快上课了，一个人也没有，他掏出手机看了看宿舍群——一片死寂，“你们知道教室在哪吗？”这则消息在他指尖乱窜，几乎快隔空点在键盘上，不知道什么样的能耐才能让这样的消息同时背负希望与耻辱，想想发出去后会遭到舍友嘲笑，王肖便就此作罢。\n“同学，这间教室被征用了！”一位女同学开门提醒道。\n王肖哦了一声便快速离开了教室，走到楼梯口，他又来回看了看班级群才知道——教室改了，消息是昨晚发的，顿时王肖的那份心情跌落谷底——摔得很痛！\n校运会的一天中午。\n“又打包？！”何天宇开宿舍门后说道：“这小子，空调也不开。”\n“是啊！”王肖小声的说道，似乎是说给自己听的：“不是很冷。”\n“以前校运会没见这么冷的。”一位舍友说道。\n“昨晚又到几点啊！”另一位舍友说道。\n“两点这样吧！”王肖知道问的是他。\n“我昨晚上厕所还看见他在玩，三点多这样！”何天宇说道：“小心点小子，身体支不住才懂错。”听到这王肖心里颤了颤，想想多少点已经无所谓，熬夜从来不看时间，看的是身体能坚持到什么时候。\n“妈的，你们知道么！我们学校实验楼一楼男女厕所一样，上次我去出来一个女生，吓我一跳。”何天宇说道。\n“我靠，真假啊……那哪个是那次呢？”一位舍友问道。\n“谁知道，反正我以后不去了。”何天宇边调空调边说道。\n……\n晚饭过后王肖去剪头发时发现，自己发量比以前少了很多，看来最近的顾虑是对的，上次献血时医生告诉他，他肺部可能感染了，希望他能尽早去医院检查，这件事这次才放在他心上。\n秋去冬来，远看青山带着白云草帽，不由觉得是冬天的景象。\n“喂，能听到吗？”电话一头问道，听到这边答了嗯，那头接着问道：“医生怎么说？”\n“肺部感染，还有什么胆红素过高，叫我过几天再去检查。”\n“嗯，那去做好检查，务必把病治好，钱还够不够啊？”\n“没多少了。”\n“我待会微信转你，叫你妈妈过去看看你吧……”\n“不用了，爸！”王肖打断道：“不用来了，麻烦……”王肖打心地不希望自己被一个外来人可怜。寒暄几句后，他便挂断电话，扯了扯帽子往公交站走去。\n上周。\n王肖去医院做了检查，疑似患了乙肝病毒，但具体结果还得等后面检查，医生让他不要过于担心，注意休息。走出医院的他不敢把这个消息告诉自己的舍友，自己也害怕传染给自己身边的人，似乎这个病能否患上，能否真的传染，是他说的算一样。\n从学校大门直走是学校的图书馆，图书馆面朝东方，其后面是一片松林，穿过松林就到了学校的教学楼，为迎接八十年校庆，教学楼也翻了新，远远可以闻到涂漆的味道，早上的专业课还没有结束，王肖穿过人群，上楼赶往教室，赶上了三四节课，进门——后排早早坐满了人，唯独前排只有几许人，王肖坐在了黑板前面，低着头听完了上午的课。 下课后等所有人走完后，他才慢慢起身离开教室，现在食堂一定挤满了人，他朝着图书馆走了几步，然后加快了脚步，在图书馆找了十几分钟的书籍，始终没有抽出一本，就这样不知道过了多久，他从海量书籍中借了几本小说，离开了图书馆，从图书馆往右走，经过一片桃林，在穿过一条小街，就到了南苑，此时已打铃睡觉，路上的人少之又少，一层喜悦蒙上一层凄凉，王肖走进食堂安静的坐在角落吃完了螺蛳粉后，便去教学楼打盹了。\n周五下午，王肖顶着一顶鸭帽往南苑走去，上台阶时风太大，刮走了他的帽子，他顿时感觉地中海一阵凉意，但他没有理会急忙去捡起自己的帽子，最近掉发太厉害，而且自己也不想剃寸头，于是先买个帽子遮遮面，从楼梯下来是一楼的饭堂，饭堂两侧开满鲜花，看到王肖不顾一切的样子花儿笑得前仰后合，风开始大声高歌，远远可以看见一丝丝细发在空中欢快的舞动，好像人群中有个鹤立鸡群，金光闪闪的人物出现了，同学们都遮头避面，狂风大声高歌，似乎声音能震碎金光一样，大家都看到了站立中央的王肖，他像一只瘦弱的猴子——抓耳挠腮，四处寻找的动作不禁惹人发笑，一位女同学捡起他的帽子，递给了他，王肖看见她面容平静得吓人，好像什么吓人的表情刚被埋葬一样，他接过帽子，那一瞬间那害怕的嘴脸破土而出——好像死人复活一样，接着他看清了在场所有人的面容，他习惯性地低声说了声“谢谢”，然后带上帽子含着泪水逃离了诈尸的现场，远远还可以听见他们与狂风高歌。\n王肖跑到了实验楼一楼，差点进错了厕所，慢慢摘下自己的帽子，慢慢的目光看向了镜子中的自己，尖形的头型两侧残存着一处又一处头发，真似马儿啃的一样，地中海一条条可以数清楚的毛发，好像自身有千斤重，摇摇欲坠，细细看看吧！真的有几分科学家刻板面貌，那浓眉大眼，臃肿大鼻，小嘴肥下颌，一切为什么显得那么的不搭，慢慢的自己也笑了起来，然后便是不知哪来的泪水，泪水扑向味蕾，诉说着往日岁月里所有的不甘与委屈。\n一天早上，王肖向班主任请了假，理由是自己要外出就医，但班主任告诉他小病就在校医室看，大病得有校医室的检查证明，王肖想自己的乙肝学校也查不出什么吧！而且自己也不愿意和老师说这件事情，于是下午自己在办公室的时候便又编了一个理由——外出考驾照，老师问，下午的课是专业课还是公选课？王肖诚实的说，是专业课。老师告诉他下次不许挑专业课外出，王肖点了点头，恨不得马上离开这个地方，有那么一刻他觉得自己不属于这里，这里的一切看起来为什么这么讨厌，自己的门没有紧闭，为什么没人前来敲门？ 离开学校后，王肖去医院做了检查，又向自己父亲说明了自己的情况，挂断电话后，不自觉的走到国际大厦，大厦旁边有个广告牌，上面印着“乌鸡山欢迎您的攀登！”几个大字，想来也不想回学校，不如去爬山放放松吧！\n王肖扯了扯帽子往公交站走去，消失在街道的人海里。\n不久公交到达了乌鸡山旅游景点，因为没带学生证自己没办法享受学生价，不得不付高额的原价，乘坐游览车抵达山脚下，王肖没有多想便登了山，历经几个小时，他终于到达了乌鸡山山顶，乌鸡山是衡岭最高的山峰，一千八百八十八米的海拔让王肖觉得此刻自己也有杜甫“一览众山小”的心境。因爬山前没准备食物，等到山顶王肖早已饥肠辘辘，想想也没办法，于是便找一处没人的地方休息，随后竟然睡了起来，在自己的家乡流传这样的说法，人凡在野外犯困，不能在地上睡觉，否则容易招来地狱的黑白无常，但王肖怎么会相信呢！\n太阳渐渐脱下发着毒辣光芒的衣服，奔向西边的白云，惹得白云脸上红扑扑的，像一个害羞的小姑娘。 王肖醒来看了手机发现已经很晚了，于是准备下山，乌鸡山南北边路段都可以下山，只是王肖来时是南边，现在自己不知为什么——竟产生一个奇怪的想法——去涉足自己未曾涉足的地方，去走自己从未走过的路，想到这自己为自己接下来的做法不禁自豪起来，心情也好了许多。 冬季太阳南回归线移动，山的北面往往会比南面稍暗些，对于乌鸡山这样高树众多的山来说更为明显，对黑暗的惧怕也许是人类的天性，当这类天性遇到人类所建立起来的理想准则时，一切的反应都显得那么真实。\n往北走先绕过一个弯，在下一段陡峭的路段，然后经过一座座灰白色的水泥亭，准备到第一座亭子时，由于树木渐渐变多，夕阳也渐渐袭来，森林里也渐渐地暗淡，一种恐怖气氛由之而生，王肖边走，边加快脚步，差点摔了个跟头，他一抬头——远远一个穿着白色衣服的女子扶着亭子在那边摇扇，仪态端庄高雅，就像是古代富贵门第出来的淑女，可样貌不清，王肖近视严重自然也看不清，起初他觉得那并不是什么女子，可他越是走近，样子越是清晰——突然，后林哗啦一声，王肖大叫一声：“妈呀！”紧接着他回头刚刚的白色女子依然消失，王肖发出颤抖的呼吸声，急忙往山上跑去。\n在山顶上还算是明亮，他站在今天“一览众山小”的地方，还没等他缓过气来，一声“轰隆”，山顶坍塌，他随着山石掉了下去。\n第二章 乌鸡山神庙 在乌鸡山山脚下流淌着一股清泉，泉水从乌鸡山主峰——鹊连山一座池塘里冒出，池子四周长着各种奇花异草，高大古木，池子流下山脚在一处低洼形成一小滩池子，池子长着碧绿的荷叶，过了花期的池子虽少了几分姿色，但热闹却从未消停。\n柏月每次来到这里除了捣衣外，还会观赏观赏清凉的池子，不管秋去冬来，池子外的世界都是热闹的，清晨的鸟鸣，晌午的嬉闹，傍晚的虫鸣，这些声音都在呼唤着这自认为孤寂的池子。\n“月儿，看什么呢？”\n“六娘，你看这池子多清凉啊！开满荷花的时候，美极了，要是学些诗词歌赋，多想为之吟唱。”\n“月儿啊，荷花也就开花的时候，有人来看看，像这样的地方可能就只有你了，而且过了花期你还不忘。”\n“不早了，我该回去了，不然爹爹又骂了。”\n六娘点了点头，下了石坡，把衣服又过了一遍水，同柏月回了家。\n“爹，女儿把您的衣服取回来了”柏月边进门边说道。\n老郭爷子从卧榻上起了身，月儿见了想阻止，但他摇了摇手，他从木板上取来了草鞋，又在木板堆砌起的炉火上架了铁锅，顺手抽了对筷子，一手放在瓷器上。\n“会不会太麻烦。”郭老接过月儿递过来的衣物，转身放在了卧榻上，接着说道：“下次晒家下面便好。”\n“没事的爹，这地儿像个盆似的，如今日落也是来得快，石坡那却非这般，您最近又急着用，还是多备些衣物为好。”\n“好好好，来，先吃饭吧！”\n不巧此时六娘来到屋外，喊了几声月儿，声也是大，怕是出了事，月儿急忙从屋里走了出来，下了木梯，问道：“六娘出了什么事。”\n“月儿，我家那老头的衣服还落在石坡上，现在离不开，他明又急着用……”\n“六娘放心，月儿明白，我这就去取来，您安心去忙吧！”\n六娘拜谢后便离开了，月儿告诉老郭后，一人便独自前往荷花池边的石坡，出门沿着小河一路向西走，过一座独木桥，在翻过一座山岗，便可见到石坡，沿着曲折蜿蜒的山路，可以看到远处高耸入云的乌鸡山。\n虽然海拔仅有一千多米，但站在底处却依然能感受到其威严之势，还有那风雨雕琢的美丽风光，得天独厚的喀斯特地貌与之雅丹地貌相互碰撞，相互囊嵌，孕育出了这美丽的乌鸡山。\n乌鸡山远远的看去像一条鲸鱼头上顶着一座似鸡的岛屿，因其色泽以灰黑色为多，古代帝王将之成为“乌鸡”山，但生活于当地的百姓则认为这是乌仙下饭的征兆，在其传说中，乌仙坐骑是只由鸡羽化为凤的仙兽，乌仙骑之游历四方，不想一日仙兽在凡间一处产下一子，从此便定居下来，没有再回到仙界，仙兽因其独特，常替百姓驱赶妖魔，百姓们为了感谢仙兽，便在他的山脚下建立一座庙以共答谢。\n柏月从石坡取回衣物，正要往回赶，就在这时，林中蹿出了一头野猪，吓了柏月一跳，急得她手中的衣服也掉了下来，柏月快速拾起衣服。 野猪见到人后，没有跑反而放慢了脚步——突然，迅猛的朝柏月袭来，柏月惊慌之下翻落水中，平时也只是在水浅处洗衣，不像六娘她们那般水性很好，像只卷曲的虫也是害苦了她呀！\n月亮渐渐攀上高空，披上明亮的银黄色外衣。\n石坡四周举满了一根根火把，月儿能否找到便要看看这火光了，有人在水边发现了掉落的衣服，他们还发现了野猪的脚印，一时间各种猜疑打成一片，老郭第一站了出来。\n“虽月儿平日安静，不善走动，但对付野猪还是有法子，可别忘了咋家的独门绝技。”老郭说道。\n“老郭说的是，可如果没被野猪衔去，柏月又去了哪呢？”\n众人皆疑惑，就在这时一人发现衣服不远处的河水岸上有人的脚印。\n“这恐怕是挣扎时留下的，不像是野兽的足迹。”\n“不好，快随我往下游找。”众人同老郭一同赶往了下游。\n可往下找了许久依旧不见尸体，众人边走边喊也不见柏月回应。\n王肖远远听到有人叫喊，心想有救了有救了，从刚才手机没信号，到尝试各种呼叫，再到现在有人，王肖此刻才知道在荒郊野外，没网没信号手机被削得这么厉害，好不容易找到了一个山洞落脚，奈何贝爷技能学太少，什么野外求生的知识都没有，现在好饿啊，真的要饿死了！\n他长吸了一口气，这才大声喊到“救命啊！救命啊！”\n老郭等人一会人顿了一下，细细一听——一路人喊救命——可怎么是个男儿声。\n“老郭，你听到了吧！”\n“嗯，听到了，叫得如此震耳，想必是有大麻烦，你们先一行人前去看看，我得先找到月儿。”\n众人赞同后便兵分两路，王肖看到火把正快速想他靠近，于是他也迈开腿奔向了火把——那一定是希望之光了——“刚才便是你在喊救命？”王肖与村民们见面会，带头的大胡子疑惑的说道。\n王肖一惊，啊！搁这cosplay还是拍戏呐？\n“叔叔阿姨你好！我爬山不小心摔了，迷路了不知道怎么回去了。”王肖说道。\n“啊，爬山？！”一人疑惑道。\n“不知兄台方才为何大声喊救命，想是遇到什么麻烦了，原来便是这是？”\n“是的，不好意思。”王肖说道。\n村民决定现代他下山，往后在想办法送他回去，而王肖只想马上下山，然后坐公交离开。\n正要走时，王肖说道：“对了，我今天傍晚的时候，在河边看到了一个女孩……”\n“啊！难不成是月儿。”\n众人来到山洞里，一看——果真是月儿，一位老者上前摸了摸脉象，点了点头，众人这才舒了口气，胡子大哥说道：“快，把这个消息告诉老郭？”\n一人跑了出去，看来是报消息的，奇怪了，这帮人是拍戏吗？话里话外奇奇怪怪的，还有“老郭”，这是什么人呢？\n下山洞的时候，王肖本来想问是不是在拍戏，走多久可以走到门票口，这么晚了还有没有游览车送下山……但他一句都没问上。\n走到河边后，老郭在岸边来回踱步，看到胡子大哥一行人后，急忙上前。\n“月儿呢？月儿呢？”老郭急忙问道。\n“子佩背着的。”胡子大哥说道。\n老郭重重的说了声“多谢！”胡子大哥告诉他是王肖救了月儿，老郭在王肖前又再次道谢。\n“多谢这位公子救小女一命。”老郭说道。\n听着很奇怪，但王肖还是回了一句，不客气。从见面到现在王肖都觉得怪怪的，但自己又没处说。\n回去的路上，子佩后的一位男子问道：“不知兄台是哪方人士，为何到此处游山玩水，还迷了路l”\n“我是百泽那边的人，在衡岭这边读书，”王肖淹了咽口水，不由自主的表现出无语的表情：“想来乌鸡山散散心，下山的时候山塌了，醒来就在河边了。”\n“百泽？是何地，怎没听说过。”男子问了问子佩：“子佩，你读书多，你知道吗？”\n子佩摇了摇头，有说自己不知道这个地方。\n“此处确实是衡岭，只不过你放才说在次处读书……此处多山石野兽，难不成你拜在刘夫子门下吗？”\n“比起这个，我更想问他为何衣着异样，怕是乡外人士吧？”胡子大哥说道。\n“我确实是外地的，只是在这个地方读书。”王肖说道，王肖像多说一句但还是咽了下去。\n“你这衣物看来制作精良，怕是贵门弟子吧！怎会在这穷乡僻壤读书？”那男子有问道。\n“乡檀，怎能如此无礼，这位小兄弟救了月儿，我们该感谢他，你怎在这一股劲盘问，有失礼数。”子佩说道。\n乡檀见子佩如此说道，虽有些不服气，却也在理，于是便没有多问什么。\n其实，王肖刚想问来着，子佩这么说，他又抛掉了刚才的想法，只想快点回家。\n回到村子后，王肖在想着怎么没带他下山，反而还带回了这么简陋的村子——应该说是这剧组搭建的，这时候村民们都在想着，怎么给王肖安排住宿，众人商讨后决定先留在胡子大哥家，正要带王肖过去。\n“唉！你们不带我下山吗？或者说给我指条路我自己下山。”王肖问道。\n众人投来疑惑的目光，“小兄弟，这便是山下了，不是山下那水又怎会如此平静”胡子大哥说道。\n火把远远可以找到远处的河水，河水在火把的照耀下，波光粼粼，宛若金鱼的鳞片。\n展开 预知后事如何……等我更新吧！ ",
    "description": "",
    "tags": "时空旅行",
    "title": "时空国度-木尸王朝",
    "uri": "/textbook/3.%E6%AE%8B%E6%9C%A8%E5%90%BC/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 时空旅行",
    "uri": "/tags/%E6%97%B6%E7%A9%BA%E6%97%85%E8%A1%8C/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 2.AndroidStudio",
    "content": "第一章 配置开发环境： 1.安装JDK “安装连接” 2.安装AndroidStudio “安装连接” 3.安装SDK 4.AndroidStudio汉化 https://www.bilibili.com/video/BV1Hz4y1K7Tc/ 第二章 Gradle():自动构建 日志输出工具：查看报错 Run（运行）\n工程结构： （清单文件）：对Activity，service，re广播等进行注册的文件 Java目录： 后缀为 .class drawable目录：资源文件，放图片、图标、背景资源的文件 Layout目录：放页面布局文件 放图片和.xml文件，适配不同分辨率的文件夹 values目录：颜色、数组、字符串、样式\nAndroid基本原理 Android体系结构 Android 用用程序核心组件 Activity 第四章 Activity、Fragment以及Intent通信机制 Activity生命周期 四种状态的转换\n布局的特点：\n第八章 数据存储和提供器 SharedPreference 使用键值对关系来获取文件\nSQLite 轻量级占用内存小，支持基本的MySQL语言。 创建过程：\nContentPreference（应用存储） 通过暴露URL让软件之间可以共享文件 好比一般使用文件时，软件会要求需要访问你手机文件权限。\n文件存储 网络通信编程 网络访问方式 网络状态码，例如404表示什么？\n数据解析 1.JSON格式解析： 以类对象的方式进行相应，以数组的方式进行相应，也可以二者混合。\n网络状态 JavaScript与Java交互 webView的使用\n在简单的使用webview过程中可能无法进入指定的网页，而且AndroidStudio模拟机上还会弹出如下错误：\n**Webpage not available** The webpage at http://www.baidu.comi could not beloaded because: net::ERR_CLEARTEXT_NOT_PERMITTED解决的办法： 请在AndroidManifest.xml文件下添加代码： .xml文件 添加代码 \u003cuses-permission android:name=\"android.permission.INTERNET\" /\u003e \u003cuses-permission android:name=\"android.permission.ACCESS_NETWORK_STATE\" /\u003e \u003cuses-permission android:name=\"android.permission.ACCESS_WIFI_STATE\" /\u003e 如果添加上面的还不可以，请在manifest中添加如下代码：\n.xml文件 添加代码 \u003c?xml version=\"1.0\" encoding=\"utf-8\"?\u003e \u003cmanifest ...\u003e \u003capplication ... android:usesCleartextTraffic=\"true\"\u003e ... \u003c/application\u003e \u003c/manifest\u003e “原文章链接”\ngetwebSetting\n附件 ",
    "description": "",
    "tags": "安卓",
    "title": "AndroidStudio笔记",
    "uri": "/branch-bundle-1/2.androidstudio/%E7%AC%94%E8%AE%B0/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: B2-笔记",
    "uri": "/categories/b2-%E7%AC%94%E8%AE%B0/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 1.文章",
    "content": " 附件 一、为什么要创建属于自己博客网站 自从进入大三的学习，自己接触了许多开发板、以及七七八八的软件，个人记忆力又不咋地，平时很容易把重要或者重复的知识忘记，所以我希望做一个网站记录自己所学的知识，方便查找，但我没学JS，深入学又耗费时间，如果你也有我的一些情况，想自己创建一个网站“玩玩”，那么请看下去，希望自己的一些分享能对想短期内创建静态网站、且没学过网站设计的朋友有所帮助。\n二、选择静态网站布局工具以及远程仓库 1、工具的选择 在这里我就只推荐hugo，因为本人用的就是hugo，其他的并不是很了解（如果你有更好的方法还请通过留言告诉我，谢谢！），首先确定自己要装在哪个系统上，比如装在Windows、Linux或者Mac（苹果系统），确定好这个后你就去网上搜安装方法即可，一定要搜和自己电脑系统有关的安装方法，不然安装会走很多坑的。 Windows系统。我建议使用choco工具在终端上安装，如果电脑没安装choco工具，还请自行安装。 Linux系统。首先确定自己的Linux的发行版本，举个例子，像红帽公司的和ContentOS的，这两个发行版本使用的工具可能就不一样，像ContentOS使用的是工具Yum工具安装的，还请你在网上自行搜索。 Mac系统。使用brew工具进行安装，不知道怎么用brew还请网上搜一下。 下载好后使用如下命令检查是否安装成功。\nhugo verser2、远程仓库的选择 因为要把网站的相关信息放到网上，一遍搜索查找，我们需要一个远程的仓库来装这些数据，无疑github是比较好的选择，当然Gitee、gitLab这些应该也可以（本人没有过）。至于为什么选github我想你只要稍微了解一点IT这行的，多少都知道其原因，不知道也没关系，只要能存放我们的网站数据就行。 首先你需要去注册一个github账号，并掌握在线创建、删除、导入和下载仓库，以及文件的上传、删除修改等操作，这些其实并不是很难，刚开始需要你换一点时间，详细请上网搜索。\n当我们hugo下载好和仓库创建等操作都学会后我们就可以开始操作了。\n三、仓库创建与静态网站布局 仓库创建最好是和自己github的账户名字一样，且都是小写，然后后面跟着 .github.io,例如：\nwang32.github.io\r这是比较稳妥的做法，如果你不想这么做还请自己花时间去琢磨别的方法。接着我么创建一个空项目，什么都不需要哦!\n下一步是静态网站的部署，首先你需要下载一个hugo的主题，也就是用别人的网页主题作为自己网站的基础，这样呢我们及时没学过JS也可以部署自己的网站。 创建一个目录，比如myblog，接着用code打开这个目录，在code编译器中打开终端窗口监视器，在里面输入命令\nhugo new site这个时候myblog目录下会生成一个theme的目录，用来放主题，把下载好的hugo主题放在该目录下，在使用如下命令：\nhugo --theme=\u003c主题名字\u003e --baseURL=\"\u003c你github仓库的路径\u003e\" --buildDrafts举个例子：\nhugo --theme=m10c --baseURL=\"https://wung32.github.io/\" --buildDrafts上面m10c是主题的名字，也就是你下载的hugo主题名字，而https://wung32.github.io/仓库路径。\n在这你需要注意：如果不是Windows系统这的baseURL可能写为baseUrl,要确定这件事就去看hugo.tolm文件，有的主题写为config.tolm,里面的第一二行就会提到baseURL，注意这里的要去主题目录里找。而不是在你创建的目录myblog下找。 运行上面的代码没问题就会在你创建的myblog目录下产生一个public的目录，里面装的就是你的网页信息。\n接着使用git命令把这个文件推送到远程的仓库，一般的步骤如下：\ngit init #初始化：本地建库（即文件夹）\rgit add #添加到仓库：代码文件放入本地库，\rgit commit -m “注释内容” #提交时要给注释\rgit remote add origin https://github.com/xu-xiaoya/Elegent.git #远程仓库关联\rgit push (-u) origin master #本地仓库的代码推送到远程仓库Github上如果报错：\nerror: RPC failed; HTTP 504 curl 18 HTTP/2 stream 7 was reset\rsend-pack: unexpected disconnect while reading sideband packet\rfatal: the remote end hung up unexpectedly\rEverything up-to-date\r那么加一句：\ngit config --global http.postBuffer 524288000接着继续推送就是了。\n然后去自己的仓库，点击设置，找到Page选项，有个Custom domain，在那里写上你的网站名称。\n四、买一个域名 我在没买之前网页一直加载不出来，自己也不知道为什么（如果你知道不用买域名也可以实现网站部署还请告诉我，谢谢啦！）。所以我自己是买了一个六块钱的域名的，试用期一年；当你买一个域名后要记得去解析域名，然后把解析的域名写到上面说的Custom domain那个地方，比如你解析得到的域名是：myblog.wang32.com,那么你就写这个上去。\n如果不知道怎么买。怎么解析，那么——是的，一样上网查一下。\n五、网站的优化 这个我不建议你一个人慢慢磨，慢慢的去网上找方法，其实制作主题的作者已经把怎么基于他的主题做出自己的网站的方法了，所以你老老实实的跟着作者的文档走就是了，实在有些地方不懂的在查一查看。\n补充 1、为什么我插入的图片无法显示？ 图片的显示：首先要看你的主题是基于什么语言写的，比如我的是markdown,对于这个语言只需要使用：\n![nihao](../../../public/webfonts/fa-brands-400.svg)上面的这个方法就可以让图片显示，但实际上不一定能可以，因为hugo有个目录创建规则——Page Bundles(连接：https://www.rectcircle.cn/series/hugo/content-management/page-bundles/)，如果不按照这个规则创建，那么你使用别人的主题，插入图片时可能无法显示。\n光是上面这点我就搞了一个星期，所以还是希望你好好看一下Page Bundles文档。\n今天先到这了…… 2023年12月11日\n",
    "description": "",
    "tags": [
      "网站",
      "前端"
    ],
    "title": "创建hugo静态网站的经历",
    "uri": "/branch-bundle-1/%E5%85%B6%E4%BB%96%E6%96%87%E7%AB%A0/experimence/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: C1-CC2530",
    "uri": "/categories/c1-cc2530/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: D1-点灯实验",
    "uri": "/categories/d1-%E7%82%B9%E7%81%AF%E5%AE%9E%E9%AA%8C/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 5.CC2530_ZigBee",
    "content": "实验2 IO端口输出实验 1、实验要求： 利用实验箱的基础板，实现八盏灯的点亮，下面是八盏灯的位置图： 在实际中我们可能没有实验箱，往往需要自己做一个八盏灯的板子，这个时候了解本次实验挤出实验板的八盏灯连接原理是很重要的，了解原理后你就可以自己做出自己的LED板子，并用cc2530控制它。\n2、LED灯驱动芯片 由于CC2530 单片机端口驱动能力有限，所以我们可以用ULN2003芯片做驱动，但使用uln2003需要使用到八个端口，为了不浪费端口，我们可以使用74HC595，该芯片只需要用到三个端口就可以控制八盏灯的亮灭，下面提供两块芯片的原理图： 如果你想用ULN2003还请查看相关手册，此处对74HC595进行详细说明。 74HC595 是 8 位输出锁存移位寄存器，数据输入由三个引脚组合控制，分别是数据输入引脚 SER、数据输入控制引脚 SRCK 和数据输出锁存引脚 RCK SER 引脚上的数据在 SRCK 引脚的上升沿信号保存到 QA 引脚，同时 QA 位上的数据移位到 QB位，QB 位的数据移位到 QC 位……，依次类推，所有数据向后串行移动一位，QH 位的数据被送到QH’位。所有位的数据在 RCK 引脚的上升沿信号被所存到输出端。 一下是我的个人理解： 这里我们用输入数据1001 0101，使第1、3、5、8盏灯亮（假设高电平有效）为例解释说明，首先，实际上数据输入74HC595是串行输入，所以可以数据输入时是在打开SER端口后，按照从高位到低位依次输入数据1001 0101，如上图的下面所示；接着打开SRCK，先把最高位1输入数据寄存器低位b0，接着输入次高位的0,通过0把1挤到b1，以此类推；接着再打开RCK显示灯的亮灭。\n3、IO端口输出控制 要使用CC2530的IO端口，我们需要对PxDIR、PxSEL、Px进行设置，PxDIR用来控制端口的输入输出模式，1表示输出模式，SEL为0时，表示通用IO端口，详细参照下表： 而这里的x可以取0、1、2，其实就是端口P0、P1、P2的意思,在端口下设8个端口0~7，例如P0_1,但是端口2只有0~4可用;\n下面是一个详细的例子： 当I/OP1_0~P1_7 各I/O端口输出高低电平时，设置方法如表 1.2所示： 了解以上知识后我们就可以写工程代码了。\n.xml文件 PrintfLED.h Delaye.h Initial.h 全码 //led输出设置 #include \u003cPrintfLED.h\u003e #define SER P1_0 #define SRCK P1_2 #define RCK P1_1 #define LOW 0 #define HIGE 1 void printfLED(unsigned char data,unsigned char byte){ SRCK = LOW; RCK = LOW; P1 = byte; //定义参考位 unsigned char getbit = 0x80; unsigned char i; for(i=8;i\u003e=1;i--){ if(data \u0026 getbit){ SER=1; } else{ SER=0; } SRCK = HIGE; getbit \u003e\u003e= 1; SRCK =LOW; } RCK = HIGE; } # include \"Delaye.h\" //延迟函数 void delaye() { int i,j,k; for(i=0;i\u003c5;i++) for(j=0;j\u003c200;j++) for(k=0;k\u003c255;k++) ; } #include \"Initial.h\" //初始化函数 void initial(){ P1SEL = 0x00; P1DIR = 0xFF; P1=0x00; } #include \"ioCC2530.h\" #include \"Initial.h\" #include \"Delaye.h\" #include \"PrintfLED.h\" #define Byte5 0x80 unsigned char btn[8]={0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80}; unsigned char btn1[8]={0x01,0x03,0x07,0x0f,0x1f,0x3f,0x7f,0xff}; unsigned char btn2[8]={0x81,0xc3,0xe7,0xff,0xe7,0xc3,0x81,0x00}; void main(void) { initial(); int i; while (1){ //1.发光二极管的循环点亮 for(i=0;i\u003c8;i++) { printfLED(btn[i],Byte5); delaye(); } printfLED(0x00,Byte5); delayed(); //2.流水灯正向流动随后反向流动 for(i=0;i\u003c8;i++) { printfLED(btn1[i],Byte5); delaye(); } for(i=7;i\u003c8\u0026 i\u003e=0;i--){ printfLED(btn1[i],Byte5); delaye(); } //3.流水灯两端逐步点亮，然后从中间向两边逐步熄灭 for(i=0;i\u003c8;i++){ printfLED(btn2[i],Byte5); delaye(); } } } 在使用时请建好一个外设文件专门放Initial.c、Initial.c、Delaye.c，然后在这些问阿金中引用与他们名字一样的.h文件，当然.h文件你自己也要先写好。 附件 ",
    "description": "",
    "tags": "硬件",
    "title": "实验2 IO端口输出实验",
    "uri": "/branch-bundle-1/5.cc2530_zigbee/experiment2/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: 硬件",
    "uri": "/tags/%E7%A1%AC%E4%BB%B6/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 1.文章",
    "content": "代码分制表 以\u003c tabs title=\"file name\" \u003e，\u003c /tabs \u003e结尾； 然后里面写以% tab title=\"code name\" style=\"info\" color=\"blue \" %，% /tab %结尾 他们都需要用{{}}括起来 ​ 代码 {{\u003c tabs title=\"hello.\" \u003e}} //代码块一 {{% tab title=\"py\" %}} ```markdown **这里写代码** ``` {{% /tab %}} //代码块二 {{% tab title=\"sh\" %}} ```markdown **这里写代码** ``` {{% /tab %}} {{\u003c /tabs \u003e}} 附件 在双花括号里写：attachments color=\"fuchsia\" icon=\"fab fa-hackerrank\"，即可，\n{{% attachments color=\"fuchsia\" icon=\"fab fa-hackerrank\" %}}效果如下： 附件 ",
    "description": "",
    "tags": [
      "网站优化",
      "网站",
      "前端"
    ],
    "title": "网站内常用到的模版",
    "uri": "/branch-bundle-1/%E5%85%B6%E4%BB%96%E6%96%87%E7%AB%A0/1.%E5%B8%B8%E7%94%A8%E6%A8%A1%E7%89%88/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 2.AndroidStudio",
    "content": "Toolbar是什么？ 简单理解就是页面的上的菜单栏，或者叫工具栏，在AndroidStudio的页面布局中使用Toolbar，\nmenu文件的创建 在创建menu这个目录前，请看查看res/目录下是否包含该目录，如果没有则创建。 接着在该目录下创建xml文件，此处文件名为content_menu。在该content_menu使用\u003citem,如下为部分代码： .xml文件 简码 全码 \u003citem android:id=\"@+id/content_menu_group_chat\" android:title=\"发起群聊\" android:orderInCategory=\"1\" /\u003e \u003c?xml version=\"1.0\" encoding=\"utf-8\"?\u003e \u003cmenu xmlns:android=\"http://schemas.android.com/apk/res/android\"\u003e \u003citem android:id=\"@+id/content_menu_group_chat\" android:title=\"发起群聊\" android:orderInCategory=\"1\" /\u003e \u003citem android:id=\"@+id/content_menu_add_friend\" android:title=\"添加朋友\" android:orderInCategory=\"2\" /\u003e \u003citem android:id=\"@+id/content_menu_add_RichScan\" android:title=\"扫一扫\" android:orderInCategory=\"3\" /\u003e \u003citem android:id=\"@+id/content_menu_add_QRcode\" android:title=\"扫码\" android:orderInCategory=\"4\" /\u003e \u003c/menu\u003e 在代码中orderInCategory属性是用来控制该item权重的，权重越小等级越高，该标题就会靠前显示， 结果 创建布局页面 详细代码如下： .xml文件 简码 全码 \u003candroidx.appcompat.widget.Toolbar android:id=\"@+id/options_menu_toolbar\" android:layout_width=\"409dp\" android:layout_height=\"wrap_content\" android:background=\"?attr/colorPrimary\" android:minHeight=\"?attr/actionBarSize\" android:theme=\"?attr/actionBarTheme\" app:layout_constraintLeft_toLeftOf=\"parent\" app:layout_constraintRight_toRightOf=\"parent\" app:layout_constraintTop_toTopOf=\"parent\" /\u003e \u003c?xml version=\"1.0\" encoding=\"utf-8\"?\u003e \u003candroidx.constraintlayout.widget.ConstraintLayout xmlns:android=\"http://schemas.android.com/apk/res/android\" xmlns:app=\"http://schemas.android.com/apk/res-auto\" xmlns:tools=\"http://schemas.android.com/tools\" android:layout_width=\"match_parent\" android:layout_height=\"match_parent\"\u003e \u003candroidx.appcompat.widget.Toolbar android:id=\"@+id/options_menu_toolbar\" android:layout_width=\"409dp\" android:layout_height=\"wrap_content\" android:background=\"?attr/colorPrimary\" android:minHeight=\"?attr/actionBarSize\" android:theme=\"?attr/actionBarTheme\" app:layout_constraintLeft_toLeftOf=\"parent\" app:layout_constraintRight_toRightOf=\"parent\" app:layout_constraintTop_toTopOf=\"parent\" /\u003e \u003c/androidx.constraintlayout.widget.ConstraintLayout\u003e Activity.java1文件中 此处创建类的步骤，继承AppCompatActivity方法就不再赘述。\n在onCreate获取Toolbar的id，这个过程也叫实例化； 接着使用方法setSupportActionBar; 在onCreate外重写onCreateOptionsMenu和onOptionsItemSelected方法。 .java文件 onCreate onCreateOptionsMenu onOptionsItemSelected 全码 @SuppressLint(\"MissingInflatedId\") @Override protected void onCreate(@Nullable Bundle savedInstanceState) { super.onCreate(savedInstanceState); setContentView(R.layout.opetions_menu); toolbar = findViewById(R.id.options_menu_toolbar); setSupportActionBar(toolbar); } @Override public boolean onCreateOptionsMenu(Menu menu) { getMenuInflater().inflate(R.menu.content_menu,menu); return super.onCreateOptionsMenu(menu); } @Override public boolean onOptionsItemSelected(@NonNull MenuItem item) { //获取menu目录中content_menu.xml文件里item的id int id = item.getItemId(); //判断id是否被点击，被点击就执行相应的动作，比如页面跳转 if(id == R.id.content_menu_add_friend){ Intent intent = new Intent(OpetionsMenu.this,ListDialogActivity.class); startActivity(intent); }else if(id == R.id.content_menu_group_chat){ return super.onContextItemSelected(item); } return false; } package com.example.practiceapplication; import android.annotation.SuppressLint; import android.content.Intent; import android.os.Bundle; import android.view.Menu; import android.view.MenuItem; import androidx.annotation.NonNull; import androidx.annotation.Nullable; import androidx.appcompat.app.AppCompatActivity; import androidx.appcompat.widget.Toolbar; public class OpetionsMenu extends AppCompatActivity { private Toolbar toolbar; @SuppressLint(\"MissingInflatedId\") @Override protected void onCreate(@Nullable Bundle savedInstanceState) { super.onCreate(savedInstanceState); setContentView(R.layout.opetions_menu); toolbar = findViewById(R.id.options_menu_toolbar); setSupportActionBar(toolbar); } @Override public boolean onCreateOptionsMenu(Menu menu) { getMenuInflater().inflate(R.menu.content_menu,menu); return super.onCreateOptionsMenu(menu); } @Override public boolean onOptionsItemSelected(@NonNull MenuItem item) { int id = item.getItemId(); if(id == R.id.content_menu_add_friend){ Intent intent = new Intent(OpetionsMenu.this,ListDialogActivity.class); startActivity(intent); }else if(id == R.id.content_menu_group_chat){ return super.onContextItemSelected(item); } return false; } } 最终结果 结果 展开 详细知识等我更新…… Activity.java这个文件的一般就是我们所说的主程序，类似与C语言中的包含main入口的文件。 ↩︎\n",
    "description": "",
    "tags": [
      "安卓",
      "UI设计"
    ],
    "title": "2-1.Toolbar工具栏",
    "uri": "/branch-bundle-1/2.androidstudio/toolbar/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Categories",
    "content": "",
    "description": "",
    "tags": null,
    "title": "类别 :: B3-课堂笔记",
    "uri": "/categories/b3-%E8%AF%BE%E5%A0%82%E7%AC%94%E8%AE%B0/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e Tags",
    "content": "",
    "description": "",
    "tags": null,
    "title": "标签 :: UI设计",
    "uri": "/tags/ui%E8%AE%BE%E8%AE%A1/"
  },
  {
    "breadcrumb": "王梅四郎maloudown \u003e 一、博客文章 \u003e 1.文章",
    "content": "不论是创建首页页面，还是左边框的选项，归根结底它们都是“目录”，从根上说，你需要创建一个目录然后在目录里面创建一个.md文件来装这个目录或说显示这个目录的内容。\n首页的创建 创建首页使用了命令\nhugo new –kind home _index.md\n而后产生的页面，它自动生成头文件\n+++ archetype = \"home\" title = \"\" +++ 值得注意的是，如果你用命令\nhugo new site myblog\n创建了一个myblog的目录，那么你在里面操作 hugo new –kind home _index.md 的时候,用于显示首页的文件_index.md会自动产生在content文件里。\n创建章节的方法 使用命令：\nhugo new \u003cchapter\u003e/\u003cname\u003e/_index.md 或者：\nhugo new \u003cchapter\u003e/\u003cname\u003e.md 在创建章节的时候需要加上alwaysopen = false,如下面的例子：\n+++ alwaysopen = false archetype = \"chapter\" title = \"2.AndroidStudio\" weight = 20 +++ 附件 ",
    "description": "",
    "tags": [
      "网站优化",
      "网站",
      "前端"
    ],
    "title": "网站的目录与子目录创建",
    "uri": "/branch-bundle-1/%E5%85%B6%E4%BB%96%E6%96%87%E7%AB%A0/2.%E7%9B%AE%E5%BD%95%E5%88%9B%E5%BB%BA/"
  }
]
